#pragma once

//   SDK By:if

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace sdk
{
//---------------------------------------------------------------------------
// Enums
//---------------------------------------------------------------------------

// UserDefinedEnum Angelscript.ETrackComponentIdentificationType
enum class ETrackComponentIdentificationType : uint8_t
{
	Name                           = 0,
	ComponentTag                   = 1,
	ComponentPicker                = 2,
	ETrackComponentIdentificationType_MAX = 3
};


// UserDefinedEnum Angelscript.EAudioVolumeType
enum class EAudioVolumeType : uint8_t
{
	Urban                          = 0,
	UrbanAlley                     = 1,
	UrbanAlleyTight                = 2,
	Park                           = 3,
	Field                          = 4,
	EAudioVolumeType_MAX           = 5
};


// UserDefinedEnum Angelscript.ECameraStateLayerBlendMode
enum class ECameraStateLayerBlendMode : uint8_t
{
	Override                       = 0,
	Additive                       = 1,
	ECameraStateLayerBlendMode_MAX = 2
};


// UserDefinedEnum Angelscript.EDispersionState
enum class EDispersionState : uint8_t
{
	Crouching                      = 0,
	CrouchMoving                   = 1,
	Standing                       = 2,
	StandMoving                    = 3,
	Sprinting                      = 4,
	Uncontrollable                 = 5,
	EDispersionState_MAX           = 6
};


// UserDefinedEnum Angelscript.EDispersionModifierMode
enum class EDispersionModifierMode : uint8_t
{
	Multiply                       = 0,
	Add                            = 1,
	Override                       = 2,
	EDispersionModifierMode_MAX    = 3
};


// UserDefinedEnum Angelscript.EWinchDirection
enum class EWinchDirection : uint8_t
{
	Neutral                        = 0,
	Retract                        = 1,
	Detract                        = 2,
	EWinchDirection_MAX            = 3
};


// UserDefinedEnum Angelscript.EBillboardColors
enum class EBillboardColors : uint8_t
{
	Yellow                         = 0,
	Blue                           = 1,
	Purple                         = 2,
	EBillboardColors_MAX           = 3
};


// UserDefinedEnum Angelscript.EZiplineTravelDirection
enum class EZiplineTravelDirection : uint8_t
{
	TowardsStart                   = 0,
	TowardsEnd                     = 1,
	EZiplineTravelDirection_MAX    = 2
};


// UserDefinedEnum Angelscript.EZiplineDetachReason
enum class EZiplineDetachReason : uint8_t
{
	ReachedEnd                     = 0,
	PassengerRequestDrop           = 1,
	PassengerRequestLaunch         = 2,
	ForcedDetach                   = 3,
	Death                          = 4,
	EZiplineDetachReason_MAX       = 5
};


// UserDefinedEnum Angelscript.EZiplineActorMoveState
enum class EZiplineActorMoveState : uint8_t
{
	NotMoving                      = 0,
	StartedMoving                  = 1,
	Moving                         = 2,
	StoppedMoving                  = 3,
	EZiplineActorMoveState_MAX     = 4
};


// UserDefinedEnum Angelscript.ESpinDirection
enum class ESpinDirection : uint8_t
{
	Clockwise                      = 0,
	Counterclockwise               = 1,
	ESpinDirection_MAX             = 2
};


// UserDefinedEnum Angelscript.EBallisticProjectileType
enum class EBallisticProjectileType : uint8_t
{
	Owning                         = 0,
	Proxy                          = 1,
	Num                            = 2,
	EBallisticProjectileType_MAX   = 3
};


// UserDefinedEnum Angelscript.EPracticeTargetCharacterState
enum class EPracticeTargetCharacterState : uint8_t
{
	Disabled                       = 0,
	Patrol                         = 1,
	Alerted                        = 2,
	Engaging                       = 3,
	EPracticeTargetCharacterState_MAX = 4
};


// UserDefinedEnum Angelscript.EAudienceReaction
enum class EAudienceReaction : uint8_t
{
	Neutral                        = 0,
	Positive                       = 1,
	Negative                       = 2,
	EAudienceReaction_MAX          = 3
};


// UserDefinedEnum Angelscript.EAudienceRactionEvent
enum class EAudienceRactionEvent : uint8_t
{
	None                           = 0,
	Death                          = 1,
	DBNO                           = 2,
	Extraction                     = 3,
	RoundStart                     = 4,
	HustleMode                     = 5,
	ExtractionStarted              = 6,
	RoundEnding                    = 7,
	EAudienceRactionEvent_MAX      = 8
};


// UserDefinedEnum Angelscript.EDialogueQueueAction
enum class EDialogueQueueAction : uint8_t
{
	Disable                        = 0,
	Activate                       = 1,
	Kill                           = 2,
	EDialogueQueueAction_MAX       = 3
};


// UserDefinedEnum Angelscript.EAUSItemType
enum class EAUSItemType : uint8_t
{
	None                           = 0,
	RangedWeapon                   = 1,
	MeleeWeapon                    = 2,
	DestructiveThrowable           = 3,
	EAUSItemType_MAX               = 4
};


// UserDefinedEnum Angelscript.EAUSThreatType
enum class EAUSThreatType : uint8_t
{
	Pawn                           = 0,
	Projectile                     = 1,
	EAUSThreatType_MAX             = 2
};


// UserDefinedEnum Angelscript.ECameraFovType
enum class ECameraFovType : uint8_t
{
	Locomotion                     = 0,
	Ability                        = 1,
	ECameraFovType_MAX             = 2
};


// UserDefinedEnum Angelscript.EFovModifier
enum class EFovModifier : uint8_t
{
	Additive                       = 0,
	Override                       = 1,
	EFovModifier_MAX               = 2
};


// UserDefinedEnum Angelscript.EZoomModifier
enum class EZoomModifier : uint8_t
{
	Multiplier                     = 0,
	Override                       = 1,
	EZoomModifier_MAX              = 2
};


// UserDefinedEnum Angelscript.EViewTargetPerspective
enum class EViewTargetPerspective : uint8_t
{
	Unspecified                    = 0,
	FirstPerson                    = 1,
	ThirdPerson                    = 2,
	EViewTargetPerspective_MAX     = 3
};


// UserDefinedEnum Angelscript.ECameraMagnetismState
enum class ECameraMagnetismState : uint8_t
{
	Idle                           = 0,
	Acquried                       = 1,
	ECameraMagnetismState_MAX      = 2
};


// UserDefinedEnum Angelscript.EZoomSnappingTriggerCooldownBehavior
enum class EZoomSnappingTriggerCooldownBehavior : uint8_t
{
	OnSuccessfulSnap               = 0,
	OnZoom                         = 1,
	EZoomSnappingTriggerCooldownBehavior_MAX = 2
};


// UserDefinedEnum Angelscript.EZoomSnappingState
enum class EZoomSnappingState : uint8_t
{
	ReadyToTryToSnapOnZoom         = 0,
	Snapping                       = 1,
	Cooldown                       = 2,
	EZoomSnappingState_MAX         = 3
};


// UserDefinedEnum Angelscript.EArchetypeSize
enum class EArchetypeSize : uint8_t
{
	Light                          = 0,
	Medium                         = 1,
	Heavy                          = 2,
	EArchetypeSize_MAX             = 3
};


// UserDefinedEnum Angelscript.EBodySlot
enum class EBodySlot : uint8_t
{
	Head                           = 0,
	Headwear                       = 1,
	BodyUpper                      = 2,
	TorsoUpperLeft                 = 3,
	BackLowerRight                 = 4,
	Wrists                         = 5,
	Hands                          = 6,
	bandolier                      = 7,
	BodyLower                      = 8,
	Shoes                          = 9,
	Facewear                       = 10,
	Hair                           = 11,
	Forehead                       = 12,
	Calves                         = 13,
	Eyes                           = 14,
	BodyPaint                      = 15,
	BackUpper                      = 16,
	ShoulderLeft                   = 17,
	Watch                          = 18,
	Hood                           = 19,
	MAX_BODYSLOTS                  = 20,
	EBodySlot_MAX                  = 21
};


// UserDefinedEnum Angelscript.EBodyType
enum class EBodyType : uint8_t
{
	Feminine                       = 0,
	Masculine                      = 1,
	EBodyType_MAX                  = 2
};


// UserDefinedEnum Angelscript.ECharacterCustomizationVisibility
enum class ECharacterCustomizationVisibility : uint8_t
{
	Hidden                         = 0,
	FirstPerson                    = 1,
	ThirdPerson                    = 2,
	ECharacterCustomizationVisibility_MAX = 3
};


// UserDefinedEnum Angelscript.EPoseCategory
enum class EPoseCategory : uint8_t
{
	Intro                          = 0,
	Victory                        = 1,
	EPoseCategory_MAX              = 2
};


// UserDefinedEnum Angelscript.EDebugCameraAttachmentMode
enum class EDebugCameraAttachmentMode : uint8_t
{
	Disabled                       = 0,
	DetachedLookAt                 = 1,
	Attached                       = 2,
	DetachedStatic                 = 3,
	EDebugCameraAttachmentMode_MAX = 4
};


// UserDefinedEnum Angelscript.EHealthComponentDebugVerbosity
enum class EHealthComponentDebugVerbosity : uint8_t
{
	None                           = 0,
	Low                            = 1,
	High                           = 2,
	EHealthComponentDebugVerbosity_MAX = 3
};


// UserDefinedEnum Angelscript.EHealthComponentTrackingEvents
enum class EHealthComponentTrackingEvents : uint8_t
{
	None                           = 0,
	AbsorbedDamage                 = 1,
	DamageDone                     = 2,
	EHealthComponentTrackingEvents_MAX = 3
};


// UserDefinedEnum Angelscript.EInteractableSearchResults
enum class EInteractableSearchResults : uint8_t
{
	NoResult                       = 0,
	Directly                       = 1,
	Child                          = 2,
	Owner                          = 3,
	EInteractableSearchResults_MAX = 4
};


// UserDefinedEnum Angelscript.EInteractionStatus
enum class EInteractionStatus : uint8_t
{
	Invalid                        = 0,
	Occupied                       = 1,
	Valid                          = 2,
	EInteractionStatus_MAX         = 3
};


// UserDefinedEnum Angelscript.EInteractionInteractorSupport
enum class EInteractionInteractorSupport : uint8_t
{
	Single                         = 0,
	Multiple                       = 1,
	EInteractionInteractorSupport_MAX = 2
};


// UserDefinedEnum Angelscript.EInteractionTraceState
enum class EInteractionTraceState : uint8_t
{
	NoData                         = 0,
	AwaitingTrace                  = 1,
	Finished                       = 2,
	EInteractionTraceState_MAX     = 3
};


// UserDefinedEnum Angelscript.EInteractorState
enum class EInteractorState : uint8_t
{
	None                           = 0,
	Ongoing                        = 1,
	Success                        = 2,
	Failed                         = 3,
	EInteractorState_MAX           = 4
};


// UserDefinedEnum Angelscript.EInteractionOutlineType
enum class EInteractionOutlineType : uint8_t
{
	Generic                        = 0,
	Traversal                      = 1,
	Damage                         = 2,
	Power                          = 3,
	Target                         = 4,
	KillCam                        = 5,
	EInteractionOutlineType_MAX    = 6
};


// UserDefinedEnum Angelscript.EDiscoverySpawnEffectDirection
enum class EDiscoverySpawnEffectDirection : uint8_t
{
	Spawn                          = 0,
	Despawn                        = 1,
	EDiscoverySpawnEffectDirection_MAX = 2
};


// UserDefinedEnum Angelscript.ESurfaceBreakBehaviour
enum class ESurfaceBreakBehaviour : uint8_t
{
	None                           = 0,
	Destroy                        = 1,
	SimulatePhysics                = 2,
	CustomCallback                 = 3,
	ESurfaceBreakBehaviour_MAX     = 4
};


// UserDefinedEnum Angelscript.ELaunchTarget
enum class ELaunchTarget : uint8_t
{
	Character                      = 0,
	Projectile                     = 1,
	PhysicsActor                   = 2,
	ELaunchTarget_MAX              = 3
};


// UserDefinedEnum Angelscript.EServerHealthStatus
enum class EServerHealthStatus : uint8_t
{
	Ok                             = 0,
	Warning                        = 1,
	Bad                            = 2,
	EServerHealthStatus_MAX        = 3
};


// UserDefinedEnum Angelscript.EThermalHeatPresets
enum class EThermalHeatPresets : uint8_t
{
	Cold                           = 0,
	LowHeat                        = 1,
	MediumHeat                     = 2,
	HighHeat                       = 3,
	EThermalHeatPresets_MAX        = 4
};


// UserDefinedEnum Angelscript.EPlayerConnectionState
enum class EPlayerConnectionState : uint8_t
{
	Connecting                     = 0,
	Connected                      = 1,
	Disconnected                   = 2,
	Abandoned                      = 3,
	Departed                       = 4,
	EPlayerConnectionState_MAX     = 5
};


// UserDefinedEnum Angelscript.EContestantPackSelectionMode
enum class EContestantPackSelectionMode : uint8_t
{
	AllowPackChanges               = 0,
	AllowPackLoadoutChanges        = 1,
	Both                           = 2,
	None                           = 3,
	AllowAnything_DisableValidation = 4,
	EContestantPackSelectionMode_MAX = 5
};


// UserDefinedEnum Angelscript.EDeckSlotType
enum class EDeckSlotType : uint8_t
{
	Loadout                        = 0,
	Reserve                        = 1,
	Collection                     = 2,
	EDeckSlotType_MAX              = 3
};


// UserDefinedEnum Angelscript.EStructuralDamageType
enum class EStructuralDamageType : uint8_t
{
	PointDamage                    = 0,
	RadialDamage                   = 1,
	FireDamage                     = 2,
	IntegrityFailure               = 3,
	EStructuralDamageType_MAX      = 4
};


// UserDefinedEnum Angelscript.EElevatorDoorDirection
enum class EElevatorDoorDirection : uint8_t
{
	Front                          = 0,
	Back                           = 1,
	Both                           = 2,
	EElevatorDoorDirection_MAX     = 3
};


// UserDefinedEnum Angelscript.EElevatorDoorsMovementState
enum class EElevatorDoorsMovementState : uint8_t
{
	Opening                        = 0,
	Opnened                        = 1,
	Closing                        = 2,
	Closed                         = 3,
	EElevatorDoorsMovementState_MAX = 4
};


// UserDefinedEnum Angelscript.EElectronicsState
enum class EElectronicsState : uint8_t
{
	Disabled                       = 0,
	Active                         = 1,
	Triggered                      = 2,
	EElectronicsState_MAX          = 3
};


// UserDefinedEnum Angelscript.EEnvironmentalConditionType
enum class EEnvironmentalConditionType : uint8_t
{
	Morning                        = 0,
	Afternoon                      = 1,
	Evening                        = 2,
	Night                          = 3,
	Fog                            = 4,
	Storm                          = 5,
	EEnvironmentalConditionType_MAX = 6
};


// UserDefinedEnum Angelscript.ERandomPlacementMethod
enum class ERandomPlacementMethod : uint8_t
{
	ByChance                       = 0,
	ByRate                         = 1,
	ByExactCount                   = 2,
	ERandomPlacementMethod_MAX     = 3
};


// UserDefinedEnum Angelscript.ESpawnLocationDistributionMethod
enum class ESpawnLocationDistributionMethod : uint8_t
{
	None                           = 0,
	Even                           = 1,
	ESpawnLocationDistributionMethod_MAX = 2
};


// UserDefinedEnum Angelscript.EVaultSpawnSetting
enum class EVaultSpawnSetting : uint8_t
{
	SpawnInPairs                   = 0,
	SpawnIndividually              = 1,
	EVaultSpawnSetting_MAX         = 2
};


// UserDefinedEnum Angelscript.EObjectiveState
enum class EObjectiveState : uint8_t
{
	Primary                        = 0,
	Active                         = 1,
	Inactive                       = 2,
	EObjectiveState_MAX            = 3
};


// UserDefinedEnum Angelscript.EObjectiveTimerType
enum class EObjectiveTimerType : uint8_t
{
	Elapsed                        = 0,
	Remaining                      = 1,
	EObjectiveTimerType_MAX        = 2
};


// UserDefinedEnum Angelscript.ETransferPointInsertionDirection
enum class ETransferPointInsertionDirection : uint8_t
{
	Forward                        = 0,
	Right                          = 1,
	Backward                       = 2,
	Left                           = 3,
	ETransferPointInsertionDirection_MAX = 4
};


// UserDefinedEnum Angelscript.ERestartContext
enum class ERestartContext : uint8_t
{
	SquadInitial                   = 0,
	SoloRestart                    = 1,
	SquadRestart                   = 2,
	ERestartContext_MAX            = 3
};


// UserDefinedEnum Angelscript.ESpawnValidationResult
enum class ESpawnValidationResult : uint8_t
{
	IsValid                        = 0,
	TooSoon                        = 1,
	Overlapped                     = 2,
	ESpawnValidationResult_MAX     = 3
};


// UserDefinedEnum Angelscript.ETutorialLevelTransitionState
enum class ETutorialLevelTransitionState : uint8_t
{
	FadeIn                         = 0,
	FadeOut                        = 1,
	None                           = 2,
	ETutorialLevelTransitionState_MAX = 3
};


// UserDefinedEnum Angelscript.ESpectatorMode
enum class ESpectatorMode : uint8_t
{
	FreeFlying                     = 0,
	PlayerFollow                   = 1,
	NotSpectating                  = 2,
	Static                         = 3,
	KillCam                        = 4,
	ESpectatorMode_MAX             = 5
};


// UserDefinedEnum Angelscript.EDeathReasons
enum class EDeathReasons : uint8_t
{
	KilledByEnemyPlayer            = 0,
	KilledByFriendlyPlayer         = 1,
	KilledSelf                     = 2,
	KilledByEnvironment            = 3,
	EDeathReasons_MAX              = 4
};


// UserDefinedEnum Angelscript.ERespawnType
enum class ERespawnType : uint8_t
{
	Default                        = 0,
	PlayerTimer                    = 1,
	RespawnMarker                  = 2,
	SquadTimer                     = 3,
	ERespawnType_MAX               = 4
};


// UserDefinedEnum Angelscript.EScoreNotificationType
enum class EScoreNotificationType : uint8_t
{
	None                           = 0,
	Immediate                      = 1,
	Delayed                        = 2,
	EScoreNotificationType_MAX     = 3
};


// UserDefinedEnum Angelscript.ETournamentMatchResult
enum class ETournamentMatchResult : uint8_t
{
	Pending                        = 0,
	Eliminated                     = 1,
	Qualified                      = 2,
	FinalsWinner                   = 3,
	ETournamentMatchResult_MAX     = 4
};


// UserDefinedEnum Angelscript.ETournamentStatusTierType
enum class ETournamentStatusTierType : uint8_t
{
	Qualifiers                     = 0,
	Pending                        = 1,
	Current                        = 2,
	Finished                       = 3,
	ETournamentStatusTierType_MAX  = 4
};


// UserDefinedEnum Angelscript.ETournamentMatchStatus
enum class ETournamentMatchStatus : uint8_t
{
	InProgress                     = 0,
	Finished                       = 1,
	OverTime                       = 2,
	ETournamentMatchStatus_MAX     = 3
};


// UserDefinedEnum Angelscript.ETournamentMatchMetadataSummary
enum class ETournamentMatchMetadataSummary : uint8_t
{
	MatchUneventful                = 0,
	MatchViolent                   = 1,
	MatchQuiet                     = 2,
	MatchClutch                    = 3,
	MatchClearWinner               = 4,
	MatchClearLoser                = 5,
	ETournamentMatchMetadataSummary_MAX = 6
};


// UserDefinedEnum Angelscript.EAmortizedRespawnRequestType
enum class EAmortizedRespawnRequestType : uint8_t
{
	Normal                         = 0,
	PlayerStart                    = 1,
	Transform                      = 2,
	EAmortizedRespawnRequestType_MAX = 3
};


// UserDefinedEnum Angelscript.EAnnouncementType
enum class EAnnouncementType : uint8_t
{
	Normal                         = 0,
	Important                      = 1,
	EAnnouncementType_MAX          = 2
};


// UserDefinedEnum Angelscript.EWalkingState
enum class EWalkingState : uint8_t
{
	Running                        = 0,
	Sprinting                      = 1,
	Crouching                      = 2,
	EWalkingState_MAX              = 3
};


// UserDefinedEnum Angelscript.EInteractAbilityModes
enum class EInteractAbilityModes : uint8_t
{
	NotSpecified                   = 0,
	Interaction                    = 1,
	GravityGun                     = 2,
	EInteractAbilityModes_MAX      = 3
};


// UserDefinedEnum Angelscript.EReloadLoopState
enum class EReloadLoopState : uint8_t
{
	None                           = 0,
	State1                         = 1,
	State2                         = 2,
	EReloadLoopState_MAX           = 3
};


// UserDefinedEnum Angelscript.ESingleBulletReloadState
enum class ESingleBulletReloadState : uint8_t
{
	Intro                          = 0,
	Loop                           = 1,
	Outro                          = 2,
	Complete                       = 3,
	Restock1                       = 4,
	Restock2                       = 5,
	Cancel                         = 6,
	ESingleBulletReloadState_MAX   = 7
};


// UserDefinedEnum Angelscript.EDamageApplicationType
enum class EDamageApplicationType : uint8_t
{
	Point                          = 0,
	Radial                         = 1,
	EDamageApplicationType_MAX     = 2
};


// UserDefinedEnum Angelscript.EDamageSeverity
enum class EDamageSeverity : uint8_t
{
	Normal                         = 0,
	Critical                       = 1,
	EDamageSeverity_MAX            = 2
};


// UserDefinedEnum Angelscript.EDiscoveryDamageType
enum class EDiscoveryDamageType : uint8_t
{
	Normal                         = 0,
	Piercing                       = 1,
	Fire                           = 2,
	Explosive                      = 3,
	EDiscoveryDamageType_MAX       = 4
};


// UserDefinedEnum Angelscript.EOwningPawnMode
enum class EOwningPawnMode : uint8_t
{
	Character                      = 0,
	Freefly                        = 1,
	EOwningPawnMode_MAX            = 2
};


// UserDefinedEnum Angelscript.EKneeHeightVirtualDitchStructure
enum class EKneeHeightVirtualDitchStructure : uint8_t
{
	VirtualDitchUpperBodyInStartPenetrating = 0,
	VirtualDitchAndGroundIsTooLowToGetTo = 1,
	VirtualDitchBelow              = 2,
	NoSupportFallingIsOk           = 3,
	OneHitBelowCharacter           = 4,
	UpAgainstWallFallingIsOk       = 5,
	OnlySupportedOnOneSideFallingIsOk = 6,
	FallingIsOk                    = 7,
	EKneeHeightVirtualDitchStructure_MAX = 8
};


// UserDefinedEnum Angelscript.EPredictionCatchupState
enum class EPredictionCatchupState : uint8_t
{
	IsPredicting                   = 0,
	StoppedPredictingWaitingForServerCatchup = 1,
	NotPredicting                  = 2,
	EPredictionCatchupState_MAX    = 3
};


// UserDefinedEnum Angelscript.ESlideCancelReason
enum class ESlideCancelReason : uint8_t
{
	FellOffLedge                   = 0,
	LostMomentum                   = 1,
	ValidationFailed               = 2,
	ESlideCancelReason_MAX         = 3
};


// UserDefinedEnum Angelscript.ELadderLocationIndicator
enum class ELadderLocationIndicator : uint8_t
{
	InRange                        = 0,
	Above                          = 1,
	Under                          = 2,
	ELadderLocationIndicator_MAX   = 3
};


// UserDefinedEnum Angelscript.EClimbingState
enum class EClimbingState : uint8_t
{
	NotClimbing                    = 0,
	Attaching                      = 1,
	Climbing                       = 2,
	TopDetaching                   = 3,
	EClimbingState_MAX             = 4
};


// UserDefinedEnum Angelscript.ELadderDetachVariations
enum class ELadderDetachVariations : uint8_t
{
	ReachedTop                     = 0,
	ReachedBottom                  = 1,
	JumpedOff                      = 2,
	LetGo                          = 3,
	ELadderDetachVariations_MAX    = 4
};


// UserDefinedEnum Angelscript.EDoorState
enum class EDoorState : uint8_t
{
	Closed                         = 0,
	Open                           = 1,
	Detached                       = 2,
	EDoorState_MAX                 = 3
};


// UserDefinedEnum Angelscript.EActorSpawnLocationPriority
enum class EActorSpawnLocationPriority : uint8_t
{
	Normal                         = 0,
	Prioritize                     = 1,
	DEBUG_Always                   = 2,
	EActorSpawnLocationPriority_MAX = 3
};


// UserDefinedEnum Angelscript.EGravityGunDropType
enum class EGravityGunDropType : uint8_t
{
	Launch                         = 0,
	Drop                           = 1,
	EGravityGunDropType_MAX        = 2
};


// UserDefinedEnum Angelscript.EPickupableCollisionProfile
enum class EPickupableCollisionProfile : uint8_t
{
	Default                        = 0,
	BeingGrabbed                   = 1,
	EPickupableCollisionProfile_MAX = 2
};


// UserDefinedEnum Angelscript.ESquadIntroType
enum class ESquadIntroType : uint8_t
{
	None                           = 0,
	PlayerSquadIntro               = 1,
	OtherSquadsIntro               = 2,
	Countdown                      = 3,
	PlayerSquadOutro               = 4,
	OtherSquadsOutro               = 5,
	TournamentWinner               = 6,
	PackSelection                  = 7,
	Drafting                       = 8,
	Tunnel                         = 9,
	PlayerSquadIntroWalk           = 10,
	PlayerSquadIntroRage           = 11,
	TournamentStatus               = 12,
	CasualWinner                   = 13,
	MapIntro                       = 14,
	ESquadIntroType_MAX            = 15
};


// UserDefinedEnum Angelscript.EDiscoveryItemType
enum class EDiscoveryItemType : uint8_t
{
	Weapon                         = 0,
	Gadget                         = 1,
	Skill                          = 2,
	EDiscoveryItemType_MAX         = 3
};


// UserDefinedEnum Angelscript.EItemGivenEquippedState
enum class EItemGivenEquippedState : uint8_t
{
	None                           = 0,
	Given                          = 1,
	Equipped                       = 2,
	EItemGivenEquippedState_MAX    = 3
};


// UserDefinedEnum Angelscript.EItemAmmoType
enum class EItemAmmoType : uint8_t
{
	None                           = 0,
	OnlyClip                       = 1,
	OnlyReserve                    = 2,
	BothClipAndReserve             = 3,
	EItemAmmoType_MAX              = 4
};


// UserDefinedEnum Angelscript.EItemComponentTickConfig
enum class EItemComponentTickConfig : uint8_t
{
	Off                            = 0,
	EquippedOwningClientOnly       = 1,
	EquippedServerOnly             = 2,
	EquippedServerAndOwningClientOnly = 3,
	EquippedClientsOnly            = 4,
	EItemComponentTickConfig_MAX   = 5
};


// UserDefinedEnum Angelscript.ECosmeticEventType
enum class ECosmeticEventType : uint8_t
{
	Local                          = 0,
	Predicted                      = 1,
	Server                         = 2,
	ECosmeticEventType_MAX         = 3
};


// UserDefinedEnum Angelscript.EDefibrillatorState
enum class EDefibrillatorState : uint8_t
{
	Uncharged                      = 0,
	Charging                       = 1,
	Charged                        = 2,
	EDefibrillatorState_MAX        = 3
};


// UserDefinedEnum Angelscript.EMeleeHitType
enum class EMeleeHitType : uint8_t
{
	ActorHit                       = 0,
	StaticMeshHit                  = 1,
	EnvironmentalHit               = 2,
	OnlyImpact                     = 3,
	Invalid                        = 4,
	EMeleeHitType_MAX              = 5
};


// UserDefinedEnum Angelscript.EWeaponActionState
enum class EWeaponActionState : uint8_t
{
	Idle                           = 0,
	MinDelay                       = 1,
	MinDelayFinished               = 2,
	ActiveAction                   = 3,
	EWeaponActionState_MAX         = 4
};


// UserDefinedEnum Angelscript.EMeleeCharge_FailToReachMinChargePolicy
enum class EMeleeCharge_FailToReachMinChargePolicy : uint8_t
{
	Cancel                         = 0,
	ForceToMin                     = 1,
	EMeleeCharge_MAX               = 2
};


// UserDefinedEnum Angelscript.EMeleeCharge_FullChargeReachedPolicy
enum class EMeleeCharge_FullChargeReachedPolicy : uint8_t
{
	Swing                          = 0,
	Cancel                         = 1,
	EMeleeCharge_MAX               = 2
};


// UserDefinedEnum Angelscript.ETurretState
enum class ETurretState : uint8_t
{
	Disabled                       = 0,
	Patrol                         = 1,
	Alerted                        = 2,
	Engaging                       = 3,
	ETurretState_MAX               = 4
};


// UserDefinedEnum Angelscript.ERiotShieldStates
enum class ERiotShieldStates : uint8_t
{
	UnEquipped                     = 0,
	Equipped                       = 1,
	Covering                       = 2,
	ERiotShieldStates_MAX          = 3
};


// UserDefinedEnum Angelscript.EThrowType
enum class EThrowType : uint8_t
{
	Overhand                       = 0,
	Underhand                      = 1,
	EThrowType_MAX                 = 2
};


// UserDefinedEnum Angelscript.EGooRotationMode
enum class EGooRotationMode : uint8_t
{
	Zero                           = 0,
	UseImpactNormalForYaw          = 1,
	UseSurfaceNormal               = 2,
	EGooRotationMode_MAX           = 3
};


// UserDefinedEnum Angelscript.EGooMode
enum class EGooMode : uint8_t
{
	Normal                         = 0,
	WallsAndPlatforms              = 1,
	SmartWalls                     = 2,
	EGooMode_MAX                   = 3
};


// UserDefinedEnum Angelscript.EGooSeedState
enum class EGooSeedState : uint8_t
{
	Init                           = 0,
	FoundWalls                     = 1,
	BuildingWalls                  = 2,
	RandomGrow                     = 3,
	EGooSeedState_MAX              = 4
};


// UserDefinedEnum Angelscript.EGooWallsAndPlatformsSeedState
enum class EGooWallsAndPlatformsSeedState : uint8_t
{
	Init                           = 0,
	BuildingWall                   = 1,
	BuildingPlatform               = 2,
	EGooWallsAndPlatformsSeedState_MAX = 3
};


// UserDefinedEnum Angelscript.EHitScanTraceMode
enum class EHitScanTraceMode : uint8_t
{
	Precise                        = 0,
	Lenient                        = 1,
	EHitScanTraceMode_MAX          = 2
};


// UserDefinedEnum Angelscript.EFireMode
enum class EFireMode : uint8_t
{
	Single                         = 0,
	Auto                           = 1,
	None                           = 2,
	Burst                          = 3,
	Charged                        = 4,
	EFireMode_MAX                  = 5
};


// UserDefinedEnum Angelscript.EWeaponAudioMode
enum class EWeaponAudioMode : uint8_t
{
	None                           = 0,
	Component                      = 1,
	Continuous                     = 2,
	EWeaponAudioMode_MAX           = 3
};


// UserDefinedEnum Angelscript.EPresentationStagePreviewState
enum class EPresentationStagePreviewState : uint8_t
{
	None                           = 0,
	Customization                  = 1,
	Item                           = 2,
	EmoteOrPose                    = 3,
	EPresentationStagePreviewState_MAX = 4
};


// UserDefinedEnum Angelscript.EPresentationStageScreenEvent
enum class EPresentationStageScreenEvent : uint8_t
{
	Neutral                        = 0,
	FinalsLogo                     = 1,
	CharacterCustomization         = 2,
	DeckBuilding                   = 3,
	PlayerSquadIntro               = 4,
	OtherSquadsIntro               = 5,
	Countdown                      = 6,
	PlayerSquadOutro               = 7,
	OtherSquadsOutro               = 8,
	PackSelection                  = 9,
	Drafting                       = 10,
	TournamentWinner               = 11,
	RewardFlow                     = 12,
	CharacterCustomizationBandolier = 13,
	CharacterCustomizationBodyType = 14,
	CharacterCustomizationClavicle = 15,
	CharacterCustomizationFace     = 16,
	CharacterCustomizationHands    = 17,
	CharacterCustomizationHeadwear = 18,
	CharacterCustomizationLowerBody = 19,
	CharacterCustomizationLumbar   = 20,
	CharacterCustomizationPoses    = 21,
	CharacterCustomizationShoes    = 22,
	CharacterCustomizationUpperBody = 23,
	CharacterCustomizationWrist    = 24,
	BattlePass                     = 25,
	Backstage                      = 26,
	ItemDetail                     = 27,
	Tunnel                         = 28,
	Store                          = 29,
	Play                           = 30,
	Leagues                        = 31,
	Career                         = 32,
	Contracts                      = 33,
	RewardUnlocked                 = 34,
	TournamentIntro                = 35,
	CasualWinner                   = 36,
	Collection                     = 37,
	EPresentationStageScreenEvent_MAX = 38
};


// UserDefinedEnum Angelscript.ETournamentFlowState
enum class ETournamentFlowState : uint8_t
{
	None                           = 0,
	PreQualifier                   = 1,
	PostQualifier                  = 2,
	PostQuarterFinal               = 3,
	PostSemiFinal                  = 4,
	ETournamentFlowState_MAX       = 5
};


// UserDefinedEnum Angelscript.EGamepadInputResponseCurve
enum class EGamepadInputResponseCurve : uint8_t
{
	Exponential                    = 0,
	Linear                         = 1,
	Sinusoidal                     = 2,
	EGamepadInputResponseCurve_MAX = 3
};


// UserDefinedEnum Angelscript.ENextValidSlotDirection
enum class ENextValidSlotDirection : uint8_t
{
	Higher                         = 0,
	Lower                          = 1,
	ENextValidSlotDirection_MAX    = 2
};


// UserDefinedEnum Angelscript.EDiscoveryItemCategory
enum class EDiscoveryItemCategory : uint8_t
{
	None                           = 0,
	RangedWeapon                   = 1,
	MeleeWeapon                    = 2,
	Offensive                      = 3,
	Defensive                      = 4,
	Utility                        = 5,
	Skill                          = 6,
	EDiscoveryItemCategory_MAX     = 7
};


// UserDefinedEnum Angelscript.EInventorySlot
enum class EInventorySlot : uint8_t
{
	Slot_1                         = 0,
	Slot_2                         = 1,
	Slot_3                         = 2,
	Slot_4                         = 3,
	Slot_Skill                     = 4,
	Slot_Unarmed                   = 5,
	NUM_Slots                      = 6,
	EInventorySlot_MAX             = 7
};


// UserDefinedEnum Angelscript.EItemEquipmentState
enum class EItemEquipmentState : uint8_t
{
	Equipped                       = 0,
	Equipping                      = 1,
	Unequipping                    = 2,
	UnEquipped                     = 3,
	EItemEquipmentState_MAX        = 4
};


// UserDefinedEnum Angelscript.ETargetHitType
enum class ETargetHitType : uint8_t
{
	None                           = 0,
	EnemyPawn                      = 1,
	EnemyPawnDowned                = 2,
	EnemyPawnKilled                = 3,
	FriendlyPawn                   = 4,
	Object                         = 5,
	ETargetHitType_MAX             = 6
};


// UserDefinedEnum Angelscript.EHitType
enum class EHitType : uint8_t
{
	None                           = 0,
	Object                         = 1,
	Pawn                           = 2,
	EHitType_MAX                   = 3
};


// UserDefinedEnum Angelscript.EHitBodyPart
enum class EHitBodyPart : uint8_t
{
	Body                           = 0,
	Head                           = 1,
	EHitBodyPart_MAX               = 2
};


// UserDefinedEnum Angelscript.EHitAlliance
enum class EHitAlliance : uint8_t
{
	None                           = 0,
	Friendly                       = 1,
	Enemy                          = 2,
	EHitAlliance_MAX               = 3
};


// UserDefinedEnum Angelscript.EItemRarity
enum class EItemRarity : uint8_t
{
	Common                         = 0,
	Rare                           = 1,
	Epic                           = 2,
	Legendary                      = 3,
	EItemRarity_MAX                = 4
};


// UserDefinedEnum Angelscript.ECharmCompanionState
enum class ECharmCompanionState : uint8_t
{
	None                           = 0,
	Idle                           = 1,
	Shooting                       = 2,
	StoppedShooting                = 3,
	Burning                        = 4,
	Happy                          = 5,
	Respawned                      = 6,
	Recovering                     = 7,
	Dead                           = 8,
	ECharmCompanionState_MAX       = 9
};


// UserDefinedEnum Angelscript.ELedgeGrabTaskStatus
enum class ELedgeGrabTaskStatus : uint8_t
{
	Enabled                        = 0,
	StoppedHoldingJump             = 1,
	LandedOnGround                 = 2,
	TriggeredLedgeGrab             = 3,
	TriggeredVault                 = 4,
	Disabled                       = 5,
	ELedgeGrabTaskStatus_MAX       = 6
};


// UserDefinedEnum Angelscript.EBucketType
enum class EBucketType : uint8_t
{
	Unknown                        = 0,
	CareerXP                       = 1,
	GameplayItemXP                 = 2,
	BattlepassLevel                = 3,
	EBucketType_MAX                = 4
};


// UserDefinedEnum Angelscript.EPersistenceRewardType
enum class EPersistenceRewardType : uint8_t
{
	Unknown                        = 0,
	Currency                       = 1,
	EPersistenceRewardType_MAX     = 2
};


// UserDefinedEnum Angelscript.EPlayerInitStepPersistenceStatus
enum class EPlayerInitStepPersistenceStatus : uint8_t
{
	FetchInventory                 = 0,
	AwaitInventory                 = 1,
	InitPersistence                = 2,
	EPlayerInitStepPersistenceStatus_MAX = 3
};


// UserDefinedEnum Angelscript.EOnlineConfigurationBucketType
enum class EOnlineConfigurationBucketType : uint8_t
{
	Career                         = 0,
	BattlePass                     = 1,
	Item                           = 2,
	EOnlineConfigurationBucketType_MAX = 3
};


// UserDefinedEnum Angelscript.EPersistenceInventorySetup
enum class EPersistenceInventorySetup : uint8_t
{
	None                           = 0,
	Real                           = 1,
	Fake                           = 2,
	EPersistenceInventorySetup_MAX = 3
};


// UserDefinedEnum Angelscript.EThingOrigin
enum class EThingOrigin : uint8_t
{
	DirectPurchase                 = 0,
	BattlePass                     = 1,
	ItemProgression                = 2,
	Quest                          = 3,
	Store                          = 4,
	EThingOrigin_MAX               = 5
};


// UserDefinedEnum Angelscript.ETurnDirection
enum class ETurnDirection : uint8_t
{
	Right                          = 0,
	Left                           = 1,
	ETurnDirection_MAX             = 2
};


// UserDefinedEnum Angelscript.ESteeringSmoothnessBranch
enum class ESteeringSmoothnessBranch : uint8_t
{
	IsOnLadder                     = 0,
	IsInAir                        = 1,
	IsInFirstPersonView            = 2,
	IsDrasticTurning               = 3,
	IsStillOrTurning               = 4,
	IsInRootWarp                   = 5,
	IsInSprintingSpam              = 6,
	IsSprinting                    = 7,
	Default                        = 8,
	ESteeringSmoothnessBranch_MAX  = 9
};


// UserDefinedEnum Angelscript.EStickyAngleBranch
enum class EStickyAngleBranch : uint8_t
{
	IsInFirstPersonView            = 0,
	IsMoving                       = 1,
	IsStill                        = 2,
	InRootWarp                     = 3,
	OnLadder                       = 4,
	Emote                          = 5,
	Default                        = 6,
	EStickyAngleBranch_MAX         = 7
};


// UserDefinedEnum Angelscript.ESteeringInfoBranch
enum class ESteeringInfoBranch : uint8_t
{
	Sprint                         = 0,
	InAir                          = 1,
	OnLadder                       = 2,
	Default                        = 3,
	ESteeringInfoBranch_MAX        = 4
};


// UserDefinedEnum Angelscript.ECharacterSize
enum class ECharacterSize : uint8_t
{
	Small                          = 0,
	Medium                         = 1,
	Large                          = 2,
	ECharacterSize_MAX             = 3
};


// UserDefinedEnum Angelscript.EPlayerAnimEvent
enum class EPlayerAnimEvent : uint8_t
{
	UsedItem                       = 0,
	ThrewCarriable                 = 1,
	QuickMelee                     = 2,
	Dash                           = 3,
	DoorBash                       = 4,
	ThrewGrappleHook               = 5,
	EPlayerAnimEvent_MAX           = 6
};


// UserDefinedEnum Angelscript.EPresentationPlayerAnimEvent
enum class EPresentationPlayerAnimEvent : uint8_t
{
	ChangedContestantPack          = 0,
	PreviewedCustomization         = 1,
	EquippedCustomization          = 2,
	ChangedPose                    = 3,
	ChangedAttitude                = 4,
	ChangedEmote                   = 5,
	TriggeredEmoticon              = 6,
	EPresentationPlayerAnimEvent_MAX = 7
};


// UserDefinedEnum Angelscript.EStrideWarpBranch
enum class EStrideWarpBranch : uint8_t
{
	None                           = 0,
	Walk                           = 1,
	Run                            = 2,
	Sprint                         = 3,
	CrouchWalk                     = 4,
	EStrideWarpBranch_MAX          = 5
};


// UserDefinedEnum Angelscript.EHandOverrideBlendMask
enum class EHandOverrideBlendMask : uint8_t
{
	Nothing                        = 0,
	BothHandsAndWeaponParts        = 1,
	LeftHandAndWeaponParts         = 2,
	RightHandAndWeaponParts        = 3,
	WeaponPartsOnly                = 4,
	BothHandsAndWeapon             = 5,
	EHandOverrideBlendMask_MAX     = 6
};


// UserDefinedEnum Angelscript.ESprayPlayerNameSource
enum class ESprayPlayerNameSource : uint8_t
{
	OwningPlayer                   = 0,
	LastKilled                     = 1,
	ESprayPlayerNameSource_MAX     = 2
};


// UserDefinedEnum Angelscript.EDiscoveryCustomTraceChannels
enum class EDiscoveryCustomTraceChannels : uint8_t
{
	Pingable                       = 0,
	AIVisibility                   = 1,
	ContextualActionCandidate      = 2,
	AudioObstruction               = 3,
	RadialBlock                    = 4,
	Vaultable                      = 5,
	GravityGloveOverlap            = 6,
	ImpreciseGun                   = 7,
	EDiscoveryCustomTraceChannels_MAX = 8
};


// UserDefinedEnum Angelscript.EJumbotronSpinnerLockState
enum class EJumbotronSpinnerLockState : uint8_t
{
	Unlocked                       = 0,
	Locked                         = 1,
	EJumbotronSpinnerLockState_MAX = 2
};


// UserDefinedEnum Angelscript.EAtomSystemContractWidgetStatus
enum class EAtomSystemContractWidgetStatus : uint8_t
{
	Idle                           = 0,
	Locked                         = 1,
	Completed                      = 2,
	EAtomSystemContractWidgetStatus_MAX = 3
};


// UserDefinedEnum Angelscript.EUAtomSystemItemStatsRowStyle
enum class EUAtomSystemItemStatsRowStyle : uint8_t
{
	ProgressBar                    = 0,
	Text                           = 1,
	EUAtomSystemItemStatsRowStyle_MAX = 2
};


// UserDefinedEnum Angelscript.EState
enum class EState : uint8_t
{
	Idle                           = 0,
	Locked                         = 1,
	Active                         = 2,
	Hover                          = 3,
	Hint                           = 4,
	HintLocked                     = 5,
	HudInventory                   = 6,
	EState_MAX                     = 7
};


// UserDefinedEnum Angelscript.EColor
enum class EColor : uint8_t
{
	Primary                        = 0,
	Secondary                      = 1,
	Neutral                        = 2,
	EColor_MAX                     = 3
};


// UserDefinedEnum Angelscript.EStyle
enum class EStyle : uint8_t
{
	Unassigned                     = 0,
	Key                            = 1,
	Icon                           = 2,
	EStyle_MAX                     = 3
};


// UserDefinedEnum Angelscript.EModalPrompt
enum class EModalPrompt : uint8_t
{
	Text                           = 0,
	TextDetails                    = 1,
	Purchase                       = 2,
	Report                         = 3,
	Promotion                      = 4,
	Progress                       = 5,
	EModalPrompt_MAX               = 6
};


// UserDefinedEnum Angelscript.EHintStyle
enum class EHintStyle : uint8_t
{
	Header                         = 0,
	Simple                         = 1,
	EHintStyle_MAX                 = 2
};


// UserDefinedEnum Angelscript.EFormattingStyle
enum class EFormattingStyle : uint8_t
{
	PlainNumbers                   = 0,
	Percentage                     = 1,
	EFormattingStyle_MAX           = 2
};


// UserDefinedEnum Angelscript.EAtomSystemOptionUpdateValue
enum class EAtomSystemOptionUpdateValue : uint8_t
{
	Next                           = 0,
	Previous                       = 1,
	EAtomSystemOptionUpdateValue_MAX = 2
};


// UserDefinedEnum Angelscript.EAtomSystemPaginationMarkerType
enum class EAtomSystemPaginationMarkerType : uint8_t
{
	Regular                        = 0,
	Sponsor                        = 1,
	EAtomSystemPaginationMarkerType_MAX = 2
};


// UserDefinedEnum Angelscript.EPlayerCardVoipStatus
enum class EPlayerCardVoipStatus : uint8_t
{
	Talking                        = 0,
	Silent                         = 1,
	Muted                          = 2,
	EPlayerCardVoipStatus_MAX      = 3
};


// UserDefinedEnum Angelscript.EPlayerProfileVoipStatus
enum class EPlayerProfileVoipStatus : uint8_t
{
	Talking                        = 0,
	Silent                         = 1,
	Muted                          = 2,
	EPlayerProfileVoipStatus_MAX   = 3
};


// UserDefinedEnum Angelscript.EAtomSystemTileItemState
enum class EAtomSystemTileItemState : uint8_t
{
	Default                        = 0,
	Locked                         = 1,
	Equipped                       = 2,
	LockedOffer                    = 3,
	UnlockedOffer                  = 4,
	Owned                          = 5,
	LockedOfferAlt                 = 6,
	UnlockedOfferAlt               = 7,
	OwnedAlt                       = 8,
	EAtomSystemTileItemState_MAX   = 9
};


// UserDefinedEnum Angelscript.EExitReasonType
enum class EExitReasonType : uint8_t
{
	NetworkConnectionLost          = 0,
	PendingConnectionFailed        = 1,
	ServerKick                     = 2,
	ConnectionTimeout              = 3,
	Logout                         = 4,
	OutdatedClient                 = 5,
	EExitReasonType_MAX            = 6
};


// UserDefinedEnum Angelscript.ELoginFailureReason
enum class ELoginFailureReason : uint8_t
{
	GenericFailure                 = 0,
	AccountSuspended               = 1,
	ELoginFailureReason_MAX        = 2
};


// UserDefinedEnum Angelscript.EServiceType
enum class EServiceType : uint8_t
{
	None                           = 0,
	Party                          = 1,
	Friends                        = 2,
	Manifest                       = 3,
	Inventory                      = 4,
	RoundStats                     = 5,
	RankRewards                    = 6,
	Ranks                          = 7,
	BattlePass                     = 8,
	SurveySettings                 = 9,
	Build                          = 10,
	Store                          = 11,
	Scenarios                      = 12,
	Announcements                  = 13,
	PersistentPlayerKeys           = 14,
	Achievements                   = 15,
	OnlineGameSettings             = 16,
	EServiceType_MAX               = 17
};


// UserDefinedEnum Angelscript.ESyncResult
enum class ESyncResult : uint8_t
{
	Success                        = 0,
	ManifestNotFound               = 1,
	ManifestFailedToDownload       = 2,
	ESyncResult_MAX                = 3
};


// UserDefinedEnum Angelscript.EAutofillConsentModalClosedResult
enum class EAutofillConsentModalClosedResult : uint8_t
{
	Back                           = 0,
	Agreed                         = 1,
	Disagreed                      = 2,
	EAutofillConsentModalClosedResult_MAX = 3
};


// UserDefinedEnum Angelscript.ECreateAccountModalClosedResult
enum class ECreateAccountModalClosedResult : uint8_t
{
	Back                           = 0,
	Success                        = 1,
	Failure                        = 2,
	ECreateAccountModalClosedResult_MAX = 3
};


// UserDefinedEnum Angelscript.ELinkAccountModalClosedResult
enum class ELinkAccountModalClosedResult : uint8_t
{
	Back                           = 0,
	Success                        = 1,
	Failure                        = 2,
	FailureUserSuspended           = 3,
	ELinkAccountModalClosedResult_MAX = 4
};


// UserDefinedEnum Angelscript.ESignInModalClosedResult
enum class ESignInModalClosedResult : uint8_t
{
	CreateAccount                  = 0,
	SignIn                         = 1,
	ESignInModalClosedResult_MAX   = 2
};


// UserDefinedEnum Angelscript.EUpdateAccountModalClosedResult
enum class EUpdateAccountModalClosedResult : uint8_t
{
	Success                        = 0,
	Failure                        = 1,
	EUpdateAccountModalClosedResult_MAX = 2
};


// UserDefinedEnum Angelscript.ECommunicationUIActionType
enum class ECommunicationUIActionType : uint8_t
{
	Ping                           = 0,
	Emote                          = 1,
	Expression                     = 2,
	ECommunicationUIActionType_MAX = 3
};


// UserDefinedEnum Angelscript.EEventLogRowType
enum class EEventLogRowType : uint8_t
{
	Reported                       = 0,
	Blocked                        = 1,
	VoiceChatJoin                  = 2,
	VoiceChatLeave                 = 3,
	Ping                           = 4,
	PingReply                      = 5,
	PartyJoin                      = 6,
	PartyInvitationSent            = 7,
	PartyInvitationDeclined        = 8,
	SanctionTournamentAbandon      = 9,
	PressKeyToJoinVoiceChat        = 10,
	PlayerConnected                = 11,
	PlayerDisconnected             = 12,
	PlayerReconnected              = 13,
	PlayerAbandoned                = 14,
	PlayerKicked                   = 15,
	EEventLogRowType_MAX           = 16
};


// UserDefinedEnum Angelscript.EFrontendItemActorPivotMode
enum class EFrontendItemActorPivotMode : uint8_t
{
	ItemPivot                      = 0,
	CharmSocket                    = 1,
	StickerSlot                    = 2,
	EFrontendItemActorPivotMode_MAX = 3
};


// UserDefinedEnum Angelscript.EContestantHoverState
enum class EContestantHoverState : uint8_t
{
	Unkown                         = 0,
	ShowDelay                      = 1,
	Visible                        = 2,
	HideDelay                      = 3,
	EContestantHoverState_MAX      = 4
};


// UserDefinedEnum Angelscript.ERichPresenceStatus
enum class ERichPresenceStatus : uint8_t
{
	None                           = 0,
	Status_MainMenu                = 1,
	Status_EditingContestant       = 2,
	Status_PlayingTournament       = 3,
	Status_PlayingQuickPlay        = 4,
	ERichPresenceStatus_MAX        = 5
};


// UserDefinedEnum Angelscript.EItemProgressionFilter
enum class EItemProgressionFilter : uint8_t
{
	Owned                          = 0,
	NotOwned                       = 1,
	EItemProgressionFilter_MAX     = 2
};


// UserDefinedEnum Angelscript.ESortableItemProgressionSortingKey
enum class ESortableItemProgressionSortingKey : uint8_t
{
	RelativeProgression            = 0,
	AbsoluteProgression            = 1,
	ESortableItemProgressionSortingKey_MAX = 2
};


// UserDefinedEnum Angelscript.ESortableItemProgressionSortingOrder
enum class ESortableItemProgressionSortingOrder : uint8_t
{
	Ascending                      = 0,
	Descending                     = 1,
	ESortableItemProgressionSortingOrder_MAX = 2
};


// UserDefinedEnum Angelscript.EMatchMakingNotificationState
enum class EMatchMakingNotificationState : uint8_t
{
	Maximized                      = 0,
	GameFound                      = 1,
	Joining                        = 2,
	EMatchMakingNotificationState_MAX = 3
};


// UserDefinedEnum Angelscript.EBattlepassUnlockRewardNotificationClosedReason
enum class EBattlepassUnlockRewardNotificationClosedReason : uint8_t
{
	Closed                         = 0,
	Completed                      = 1,
	Error                          = 2,
	EBattlepassUnlockRewardNotificationClosedReason_MAX = 3
};


// UserDefinedEnum Angelscript.EBattlepassPageStyle
enum class EBattlepassPageStyle : uint8_t
{
	Default                        = 0,
	Bonus                          = 1,
	EBattlepassPageStyle_MAX       = 2
};


// UserDefinedEnum Angelscript.EBattlepassRewardStyle
enum class EBattlepassRewardStyle : uint8_t
{
	Default                        = 0,
	Highlighted                    = 1,
	EBattlepassRewardStyle_MAX     = 2
};


// UserDefinedEnum Angelscript.EBattlepassCategory
enum class EBattlepassCategory : uint8_t
{
	Default                        = 0,
	Premium                        = 1,
	EBattlepassCategory_MAX        = 2
};


// UserDefinedEnum Angelscript.ECollectionItemUnlockRewardScreenDestination
enum class ECollectionItemUnlockRewardScreenDestination : uint8_t
{
	Back                           = 0,
	Overview                       = 1,
	ECollectionItemUnlockRewardScreenDestination_MAX = 2
};


// UserDefinedEnum Angelscript.ECollectionQuerySortingKey
enum class ECollectionQuerySortingKey : uint8_t
{
	Name                           = 0,
	Unlocked                       = 1,
	ECollectionQuerySortingKey_MAX = 2
};


// UserDefinedEnum Angelscript.ECollectionQuerySortingOrder
enum class ECollectionQuerySortingOrder : uint8_t
{
	Ascending                      = 0,
	Descending                     = 1,
	ECollectionQuerySortingOrder_MAX = 2
};


// UserDefinedEnum Angelscript.ECollectionQueryFilterCategory
enum class ECollectionQueryFilterCategory : uint8_t
{
	None                           = 0,
	Weapon                         = 1,
	Gadget                         = 2,
	Specialization                 = 3,
	Light                          = 4,
	Medium                         = 5,
	Heavy                          = 6,
	All                            = 7,
	ECollectionQueryFilterCategory_MAX = 8
};


// UserDefinedEnum Angelscript.ECollectionQueryFilterValue
enum class ECollectionQueryFilterValue : uint8_t
{
	TRUE                           = 0,
	FALSE                          = 1,
	Both                           = 2,
	ECollectionQueryFilterValue_MAX = 3
};


// UserDefinedEnum Angelscript.EGameModeOverviewState
enum class EGameModeOverviewState : uint8_t
{
	Quickplay                      = 0,
	Tournament                     = 1,
	RankedTournament               = 2,
	CashGrab                       = 3,
	None                           = 4,
	EGameModeOverviewState_MAX     = 5
};


// UserDefinedEnum Angelscript.ELeagueRewardTileState
enum class ELeagueRewardTileState : uint8_t
{
	Current                        = 0,
	Unlocked                       = 1,
	Locked                         = 2,
	ELeagueRewardTileState_MAX     = 3
};


// UserDefinedEnum Angelscript.EProgressionItemType
enum class EProgressionItemType : uint8_t
{
	CustomizationItem              = 0,
	WeaponSkin                     = 1,
	Currency                       = 2,
	InventoryItem                  = 3,
	Archetype                      = 4,
	Charm                          = 5,
	Sticker                        = 6,
	Unknown                        = 7,
	EProgressionItemType_MAX       = 8
};


// UserDefinedEnum Angelscript.ERewardFlowState
enum class ERewardFlowState : uint8_t
{
	ShowItemAcquisitionPromotion   = 0,
	ShowQuestXPGained              = 1,
	ShowRoundXPGained              = 2,
	ShowRankProgress               = 3,
	CountCareerXPGained            = 4,
	CountBPXPGained                = 5,
	ShowItemProgressionPromotion   = 6,
	ShowItemAcquisitionProgress    = 7,
	CountIAXPGained                = 8,
	ShowCareerRewards              = 9,
	ShowBPRewards                  = 10,
	ShowRandomRewards              = 11,
	ShowLeagueRewards              = 12,
	ShowArchetypeRewards           = 13,
	ShowItemProgressionRewards     = 14,
	ShowBattlepassPromotion        = 15,
	ShowOverview                   = 16,
	Finished                       = 17,
	ERewardFlowState_MAX           = 18
};


// UserDefinedEnum Angelscript.EStoreOfferIconVariant
enum class EStoreOfferIconVariant : uint8_t
{
	Small                          = 0,
	Large                          = 1,
	EStoreOfferIconVariant_MAX     = 2
};


// UserDefinedEnum Angelscript.EStorePurchaseNotificationClosedReason
enum class EStorePurchaseNotificationClosedReason : uint8_t
{
	Closed                         = 0,
	Completed                      = 1,
	Error                          = 2,
	EStorePurchaseNotificationClosedReason_MAX = 3
};


// UserDefinedEnum Angelscript.EStorePurchaseState
enum class EStorePurchaseState : uint8_t
{
	Idle                           = 0,
	Prevented                      = 1,
	Processing                     = 2,
	Succeeded                      = 3,
	Failed                         = 4,
	EStorePurchaseState_MAX        = 5
};


// UserDefinedEnum Angelscript.EUIStoreGetFocusableReason
enum class EUIStoreGetFocusableReason : uint8_t
{
	Generic                        = 0,
	PurchaseNotificationClosed     = 1,
	EUIStoreGetFocusableReason_MAX = 2
};


// UserDefinedEnum Angelscript.EPlayerInfoType
enum class EPlayerInfoType : uint8_t
{
	Self                           = 0,
	Friend                         = 1,
	PartyMember                    = 2,
	TeamMember                     = 3,
	OtherPlayer                    = 4,
	FriendRequest                  = 5,
	PartyInvite                    = 6,
	RecentPlayer                   = 7,
	EPlayerInfoType_MAX            = 8
};


// UserDefinedEnum Angelscript.EDiscoveryScreenInputMode
enum class EDiscoveryScreenInputMode : uint8_t
{
	GameInput                      = 0,
	UIInput                        = 1,
	UIInputLocked                  = 2,
	UIExclusiveInput               = 3,
	DontChange                     = 4,
	EDiscoveryScreenInputMode_MAX  = 5
};


// UserDefinedEnum Angelscript.EKillCamDeathReason
enum class EKillCamDeathReason : uint8_t
{
	Eliminated                     = 0,
	Suicide                        = 1,
	Hazard                         = 2,
	AFK                            = 3,
	EKillCamDeathReason_MAX        = 4
};


// UserDefinedEnum Angelscript.EItemMenuType
enum class EItemMenuType : uint8_t
{
	Item                           = 0,
	Skin                           = 1,
	Charm                          = 2,
	WeaponSticker                  = 3,
	Spray                          = 4,
	EItemMenuType_MAX              = 5
};


// UserDefinedEnum Angelscript.EFameAnimationType
enum class EFameAnimationType : uint8_t
{
	NoFameChange                   = 0,
	FameChange                     = 1,
	LeagueCelebration              = 2,
	LeagueLoss                     = 3,
	AtMaxRank                      = 4,
	EFameAnimationType_MAX         = 5
};


// UserDefinedEnum Angelscript.ECrossHairADSVisibility
enum class ECrossHairADSVisibility : uint8_t
{
	IgnoreAimDownScope             = 0,
	OnlyVisibleWhenAimDownScope    = 1,
	NotVisibleWhenAimDownScope     = 2,
	ECrossHairADSVisibility_MAX    = 3
};


// UserDefinedEnum Angelscript.ETagFilteredCrossHairMaterialMode
enum class ETagFilteredCrossHairMaterialMode : uint8_t
{
	Raw                            = 0,
	ThinCircleRadial               = 1,
	Cross                          = 2,
	Dot                            = 3,
	ETagFilteredCrossHairMaterialMode_MAX = 4
};


// UserDefinedEnum Angelscript.EHintShaderState
enum class EHintShaderState : uint8_t
{
	Attention                      = 0,
	Attach                         = 1,
	Enemy                          = 2,
	None                           = 3,
	EHintShaderState_MAX           = 4
};


// UserDefinedEnum Angelscript.ECashBoxCarrier
enum class ECashBoxCarrier : uint8_t
{
	None                           = 0,
	Friendly                       = 1,
	Enemy                          = 2,
	ECashBoxCarrier_MAX            = 3
};


// UserDefinedEnum Angelscript.EWorldIconProjectionArea
enum class EWorldIconProjectionArea : uint8_t
{
	CrosshairZone                  = 0,
	FocusZone                      = 1,
	OnScreen                       = 2,
	AtEdge                         = 3,
	EWorldIconProjectionArea_MAX   = 4
};


// UserDefinedEnum Angelscript.EHitMarkerMaterialType
enum class EHitMarkerMaterialType : uint8_t
{
	ECrosshair                     = 0,
	ECrosshairDashed               = 1,
	ECutDiamond                    = 2,
	EHitMarkerMaterialType_MAX     = 3
};


// UserDefinedEnum Angelscript.EHUDHitMarkerType
enum class EHUDHitMarkerType : uint8_t
{
	None                           = 0,
	Object                         = 1,
	Friendly                       = 2,
	EnemyHit                       = 3,
	EnemyHeadshotHit               = 4,
	EnemyDowned                    = 5,
	EnemyKilled                    = 6,
	EHUDHitMarkerType_MAX          = 7
};


// UserDefinedEnum Angelscript.EInstigatorTrackingStrategy
enum class EInstigatorTrackingStrategy : uint8_t
{
	None                           = 0,
	CharacterAlive                 = 1,
	ValidActor                     = 2,
	EInstigatorTrackingStrategy_MAX = 3
};


// UserDefinedEnum Angelscript.EReadyButtonState
enum class EReadyButtonState : uint8_t
{
	PressReady                     = 0,
	WaitingForOthers               = 1,
	Countdown                      = 2,
	EReadyButtonState_MAX          = 3
};


// UserDefinedEnum Angelscript.EShareResultButtonState
enum class EShareResultButtonState : uint8_t
{
	ShareResult                    = 0,
	ResultCopyed                   = 1,
	EShareResultButtonState_MAX    = 2
};


// UserDefinedEnum Angelscript.ESquadListDisplayMode
enum class ESquadListDisplayMode : uint8_t
{
	EveryoneButSelf                = 0,
	Filtered                       = 1,
	ESquadListDisplayMode_MAX      = 2
};


// UserDefinedEnum Angelscript.EKillLogInteraction
enum class EKillLogInteraction : uint8_t
{
	Kill                           = 0,
	Revive                         = 1,
	EKillLogInteraction_MAX        = 2
};


// UserDefinedEnum Angelscript.EKillLogDisplayMode
enum class EKillLogDisplayMode : uint8_t
{
	SquadRelevant                  = 0,
	All                            = 1,
	EKillLogDisplayMode_MAX        = 2
};


// UserDefinedEnum Angelscript.ECurrencyType
enum class ECurrencyType : uint8_t
{
	Unknown                        = 0,
	Soft                           = 1,
	Hard                           = 2,
	ItemAcquisition                = 3,
	ECurrencyType_MAX              = 4
};


// UserDefinedEnum Angelscript.EGameModeCategory
enum class EGameModeCategory : uint8_t
{
	Quickplay                      = 0,
	Tournament                     = 1,
	Practice                       = 2,
	Event                          = 3,
	EGameModeCategory_MAX          = 4
};


// UserDefinedEnum Angelscript.EItemStatDisplay
enum class EItemStatDisplay : uint8_t
{
	BarDisplay                     = 0,
	NumberDisplay                  = 1,
	TextDisplay                    = 2,
	EItemStatDisplay_MAX           = 3
};


// UserDefinedEnum Angelscript.EDamageLogPresentation
enum class EDamageLogPresentation : uint8_t
{
	Count                          = 0,
	Duration                       = 1,
	EDamageLogPresentation_MAX     = 2
};


// UserDefinedEnum Angelscript.EStoreOfferRarity
enum class EStoreOfferRarity : uint8_t
{
	Inherit                        = 0,
	Common                         = 1,
	Rare                           = 2,
	Epic                           = 3,
	Legendary                      = 4,
	EStoreOfferRarity_MAX          = 5
};


// UserDefinedEnum Angelscript.EIconLocation
enum class EIconLocation : uint8_t
{
	Left                           = 0,
	Right                          = 1,
	EIconLocation_MAX              = 2
};


// UserDefinedEnum Angelscript.EOptionCategories
enum class EOptionCategories : uint8_t
{
	Graphics                       = 0,
	Audio                          = 1,
	Controls                       = 2,
	Accessibility                  = 3,
	Gameplay                       = 4,
	None                           = 5,
	EOptionCategories_MAX          = 6
};


// UserDefinedEnum Angelscript.ETeamAffiliation
enum class ETeamAffiliation : uint8_t
{
	Friend                         = 0,
	Enemy                          = 1,
	Neutral                        = 2,
	ETeamAffiliation_MAX           = 3
};


// UserDefinedEnum Angelscript.EDecalRotation
enum class EDecalRotation : uint8_t
{
	None                           = 0,
	Random                         = 1,
	ByVelocity                     = 2,
	EDecalRotation_MAX             = 3
};


// UserDefinedEnum Angelscript.ELoopingEffectType
enum class ELoopingEffectType : uint8_t
{
	Niagara                        = 0,
	Mesh                           = 1,
	ELoopingEffectType_MAX         = 2
};


// UserDefinedEnum Angelscript.EInteractionAnimationType
enum class EInteractionAnimationType : uint8_t
{
	Attachment                     = 0,
	Loop                           = 1,
	Detachment                     = 2,
	EInteractionAnimationType_MAX  = 3
};


// UserDefinedEnum Angelscript.EInteractionValidationType
enum class EInteractionValidationType : uint8_t
{
	SideRight                      = 0,
	SideLeft                       = 1,
	Above                          = 2,
	Below                          = 3,
	EInteractionValidationType_MAX = 4
};


// UserDefinedEnum Angelscript.EAttachmentAlignmentType
enum class EAttachmentAlignmentType : uint8_t
{
	None                           = 0,
	LookAtMatrixComponentUp        = 1,
	ComponentAlignment             = 2,
	EAttachmentAlignmentType_MAX   = 3
};


// UserDefinedEnum Angelscript.EInteractionAction
enum class EInteractionAction : uint8_t
{
	InteractInitiated              = 0,
	InteractHoldRelease            = 1,
	InteractStopped                = 2,
	EInteractionAction_MAX         = 3
};


// UserDefinedEnum Angelscript.EInteractionPromptSpatialType
enum class EInteractionPromptSpatialType : uint8_t
{
	Auto                           = 0,
	BoundingBoxCenter              = 1,
	ComponentLocation              = 2,
	ActorOrigo                     = 3,
	ProjectClosestPointToPlayer    = 4,
	ClosestChildPosition           = 5,
	Custom                         = 6,
	ProjectClosestPointToPlayerZeroZY = 7,
	EInteractionPromptSpatialType_MAX = 8
};


// UserDefinedEnum Angelscript.EInteractionValidationResult
enum class EInteractionValidationResult : uint8_t
{
	Success                        = 0,
	Blocked                        = 1,
	Fail                           = 2,
	EInteractionValidationResult_MAX = 3
};


// UserDefinedEnum Angelscript.ETypeOfVault
enum class ETypeOfVault : uint8_t
{
	SmallVaultOnto                 = 0,
	SmallVaultOver                 = 1,
	VaultOnto                      = 2,
	VaultOver                      = 3,
	LedgeGrab                      = 4,
	ETypeOfVault_MAX               = 5
};


// UserDefinedEnum Angelscript.EUIAttachStrategy
enum class EUIAttachStrategy : uint8_t
{
	AttachToViewport               = 0,
	AttachToScreenWidget           = 1,
	EUIAttachStrategy_MAX          = 2
};


// UserDefinedEnum Angelscript.EUINavigationStateTransitionState
enum class EUINavigationStateTransitionState : uint8_t
{
	StateInactive                  = 0,
	TransitionIn                   = 1,
	StateActive                    = 2,
	TransitionOut                  = 3,
	EUINavigationStateTransitionState_MAX = 4
};


// UserDefinedEnum Angelscript.ESocketAttachmentSnapMethod
enum class ESocketAttachmentSnapMethod : uint8_t
{
	NoSnap                         = 0,
	SnapToGeometry                 = 1,
	SnapToNearestSocket            = 2,
	ESocketAttachmentSnapMethod_MAX = 3
};


// UserDefinedEnum Angelscript.EBallisticProjectileImpactCondition
enum class EBallisticProjectileImpactCondition : uint8_t
{
	DestroyOnImpact                = 0,
	EBallisticProjectileImpactCondition_MAX = 1
};


// UserDefinedEnum Angelscript.ECyclicTransformMovementType
enum class ECyclicTransformMovementType : uint8_t
{
	RotateAroundAxis               = 0,
	ECyclicTransformMovementType_MAX = 1
};


// UserDefinedEnum Angelscript.ECyclicTransformSpeedControlType
enum class ECyclicTransformSpeedControlType : uint8_t
{
	None                           = 0,
	ScaleWithHealth                = 1,
	ScaleWithHealthInversed        = 2,
	ECyclicTransformSpeedControlType_MAX = 3
};


// UserDefinedEnum Angelscript.EHitDirection
enum class EHitDirection : uint8_t
{
	Front                          = 0,
	Behind                         = 1,
	Left                           = 2,
	Right                          = 3,
	Any                            = 4,
	EHitDirection_MAX              = 5
};


// UserDefinedEnum Angelscript.EMoveDirection
enum class EMoveDirection : uint8_t
{
	None                           = 0,
	Forward                        = 1,
	Backward                       = 2,
	Left                           = 3,
	Right                          = 4,
	Any                            = 5,
	EMoveDirection_MAX             = 6
};


// UserDefinedEnum Angelscript.EBodyLocation
enum class EBodyLocation : uint8_t
{
	_DoNotUse_                     = 0,
	Head                           = 1,
	ChestOrBack                    = 2,
	StomachOrLowerBack             = 3,
	LeftArm                        = 4,
	RightArm                       = 5,
	LeftLeg                        = 6,
	RightLeg                       = 7,
	AnyBodyPart                    = 8,
	EBodyLocation_MAX              = 9
};


// UserDefinedEnum Angelscript.EDeathAssetCriteras
enum class EDeathAssetCriteras : uint8_t
{
	Default                        = 0,
	DisplayAll                     = 1,
	Stance                         = 2,
	LocoMode                       = 3,
	MoveDirection                  = 4,
	BodyLocation                   = 5,
	HitDirection                   = 6,
	WeaponTag                      = 7,
	DamageType                     = 8,
	MinDamage                      = 9,
	EDeathAssetCriteras_MAX        = 10
};


// UserDefinedEnum Angelscript.EDrasticTurnStatus
enum class EDrasticTurnStatus : uint8_t
{
	NotActive                      = 0,
	Active                         = 1,
	Verifying                      = 2,
	BecameActiveThisFrame          = 3,
	StoppedVerifyingThisFrame      = 4,
	StartedVerifyingThisFrame      = 5,
	AbortedThisFrame               = 6,
	EDrasticTurnStatus_MAX         = 7
};


// UserDefinedEnum Angelscript.EDrasticTurnTriggerType
enum class EDrasticTurnTriggerType : uint8_t
{
	None                           = 0,
	TriggeredByAcceleration        = 1,
	TriggeredBySpinning            = 2,
	EDrasticTurnTriggerType_MAX    = 3
};


// UserDefinedEnum Angelscript.ESlopeBlendMode
enum class ESlopeBlendMode : uint8_t
{
	Blend                          = 0,
	Absolute                       = 1,
	ESlopeBlendMode_MAX            = 2
};


// UserDefinedEnum Angelscript.ESlopeTravelDirection
enum class ESlopeTravelDirection : uint8_t
{
	_DoNotUse_                     = 0,
	Default                        = 1,
	StandingStill                  = 2,
	MovingUphill                   = 3,
	MovingDownhill                 = 4,
	MovingPerpendicular            = 5,
	ESlopeTravelDirection_MAX      = 6
};


// UserDefinedEnum Angelscript.EThirdPersonLeanContext
enum class EThirdPersonLeanContext : uint8_t
{
	Spam                           = 0,
	Start                          = 1,
	Stop                           = 2,
	DrasticTurn                    = 3,
	Default                        = 4,
	Crouch                         = 5,
	ADS                            = 6,
	Sprint                         = 7,
	EThirdPersonLeanContext_MAX    = 8
};


// UserDefinedEnum Angelscript.ESpawnPropCleanupBehavior
enum class ESpawnPropCleanupBehavior : uint8_t
{
	DestroyOnNotifyEnd             = 0,
	DetachAndPhysicallySimulateOnEnd = 1,
	ESpawnPropCleanupBehavior_MAX  = 2
};


// UserDefinedEnum Angelscript.EAmbienceLocationType
enum class EAmbienceLocationType : uint8_t
{
	Default                        = 0,
	Parameter                      = 1,
	Material                       = 2,
	Num_ENTRIES                    = 3,
	EAmbienceLocationType_MAX      = 4
};


// UserDefinedEnum Angelscript.EParameterNiagaraMappingType
enum class EParameterNiagaraMappingType : uint8_t
{
	FloatValue                     = 0,
	Location                       = 1,
	Direction                      = 2,
	IntValue                       = 3,
	BoolValue                      = 4,
	Num_ENTRIES                    = 5,
	EParameterNiagaraMappingType_MAX = 6
};


// UserDefinedEnum Angelscript.ERelevancyParameterType
enum class ERelevancyParameterType : uint8_t
{
	Parameter                      = 0,
	Material                       = 1,
	ERelevancyParameterType_MAX    = 2
};


// UserDefinedEnum Angelscript.EParameterAccumulationType
enum class EParameterAccumulationType : uint8_t
{
	Multiply                       = 0,
	Max                            = 1,
	Min                            = 2,
	Add                            = 3,
	Subtract                       = 4,
	EParameterAccumulationType_MAX = 5
};


// UserDefinedEnum Angelscript.EDialogueSMTagFilterMode
enum class EDialogueSMTagFilterMode : uint8_t
{
	All                            = 0,
	Any                            = 1,
	None                           = 2,
	EDialogueSMTagFilterMode_MAX   = 3
};


// UserDefinedEnum Angelscript.EDialogueSMValueFilterMode
enum class EDialogueSMValueFilterMode : uint8_t
{
	Less                           = 0,
	LessEquals                     = 1,
	Equals                         = 2,
	GreaterEquals                  = 3,
	Greater                        = 4,
	EDialogueSMValueFilterMode_MAX = 5
};


// UserDefinedEnum Angelscript.EDialogueSMDistanceReference
enum class EDialogueSMDistanceReference : uint8_t
{
	Listener                       = 0,
	LocalPlayer                    = 1,
	Instigator                     = 2,
	ReferenceLocation              = 3,
	Object                         = 4,
	EDialogueSMDistanceReference_MAX = 5
};


// UserDefinedEnum Angelscript.EDialogueCooldownScope
enum class EDialogueCooldownScope : uint8_t
{
	Global                         = 0,
	GlobalInstigator               = 1,
	Local                          = 2,
	LocalInstigator                = 3,
	EDialogueCooldownScope_MAX     = 4
};


// UserDefinedEnum Angelscript.EDialogueSMEventDistanceReference
enum class EDialogueSMEventDistanceReference : uint8_t
{
	Instigator                     = 0,
	ReferenceLocation              = 1,
	EDialogueSMEventDistanceReference_MAX = 2
};


// UserDefinedEnum Angelscript.EDialogueSMQueueState
enum class EDialogueSMQueueState : uint8_t
{
	Active                         = 0,
	Muted                          = 1,
	Disabled                       = 2,
	EDialogueSMQueueState_MAX      = 3
};


// UserDefinedEnum Angelscript.EDialogueLocationProperty
enum class EDialogueLocationProperty : uint8_t
{
	None                           = 0,
	North                          = 1,
	NorthEast                      = 2,
	East                           = 3,
	SouthEast                      = 4,
	South                          = 5,
	SouthWest                      = 6,
	West                           = 7,
	NorthWest                      = 8,
	Left                           = 9,
	Right                          = 10,
	Behind                         = 11,
	Down                           = 12,
	Up                             = 13,
	Close                          = 14,
	Far                            = 15,
	Indoor                         = 16,
	Outdoor                        = 17,
	PointOfInterest                = 18,
	EDialogueLocationProperty_MAX  = 19
};


// UserDefinedEnum Angelscript.EDialogueActorProperty
enum class EDialogueActorProperty : uint8_t
{
	None                           = 0,
	Alerted                        = 1,
	Dangerous                      = 2,
	LowHealth                      = 3,
	EDialogueActorProperty_MAX     = 4
};


// UserDefinedEnum Angelscript.EDialogueLogLevel
enum class EDialogueLogLevel : uint8_t
{
	Verbose                        = 0,
	Log                            = 1,
	Warning                        = 2,
	Error                          = 3,
	EDialogueLogLevel_MAX          = 4
};


// UserDefinedEnum Angelscript.EPhoneme
enum class EPhoneme : uint8_t
{
	AA                             = 0,
	AE                             = 1,
	AH                             = 2,
	AO                             = 3,
	AW                             = 4,
	AY                             = 5,
	B                              = 6,
	CH                             = 7,
	D                              = 8,
	DH                             = 9,
	EH                             = 10,
	ER                             = 11,
	EY                             = 12,
	F                              = 13,
	G                              = 14,
	HH                             = 15,
	IH                             = 16,
	IY                             = 17,
	JH                             = 18,
	K                              = 19,
	L                              = 20,
	M                              = 21,
	N                              = 22,
	NG                             = 23,
	OW                             = 24,
	OY                             = 25,
	P                              = 26,
	R                              = 27,
	S                              = 28,
	SH                             = 29,
	T                              = 30,
	TH                             = 31,
	UH                             = 32,
	UW                             = 33,
	V                              = 34,
	W                              = 35,
	Y                              = 36,
	Z                              = 37,
	ZH                             = 38,
	EPhoneme_MAX                   = 39
};


// UserDefinedEnum Angelscript.EMusicParameter
enum class EMusicParameter : uint8_t
{
	None                           = 0,
	NearestBossDistance            = 1,
	LocalPlayerIndooriness         = 2,
	FinalBossDistance              = 3,
	Mercy                          = 4,
	InCombat                       = 5,
	SquadIntroTime                 = 6,
	TimeLeftOfRound                = 7,
	EndProximity                   = 8,
	Count                          = 9,
	EMusicParameter_MAX            = 10
};


// UserDefinedEnum Angelscript.EMusicParameterAccumulationMode
enum class EMusicParameterAccumulationMode : uint8_t
{
	None                           = 0,
	Max                            = 1,
	Min                            = 2,
	Add                            = 3,
	Multiply                       = 4,
	EMusicParameterAccumulationMode_MAX = 5
};


// UserDefinedEnum Angelscript.EFootStepType
enum class EFootStepType : uint8_t
{
	Still                          = 0,
	Walk                           = 1,
	Run                            = 2,
	Sprint                         = 3,
	Land                           = 4,
	EFootStepType_MAX              = 5
};


// UserDefinedEnum Angelscript.EAudioFloatInterpolationType
enum class EAudioFloatInterpolationType : uint8_t
{
	MinJerk                        = 0,
	Lerp                           = 1,
	ConstantRate                   = 2,
	EAudioFloatInterpolationType_MAX = 3
};


// UserDefinedEnum Angelscript.ECameraModifierOperation
enum class ECameraModifierOperation : uint8_t
{
	Override                       = 0,
	Multiply                       = 1,
	Add                            = 2,
	None                           = 3,
	ECameraModifierOperation_MAX   = 4
};


// UserDefinedEnum Angelscript.ECameraProperty
enum class ECameraProperty : uint8_t
{
	None                           = 0,
	LagSpeed                       = 1,
	ArmLenght                      = 2,
	RightSideOffset                = 3,
	HeightOffset                   = 4,
	FieldOfView                    = 5,
	VerticalSmoothess              = 6,
	HorizontalSmoothness           = 7,
	FirstPerson                    = 8,
	ForwardOffset                  = 9,
	MAX_NUM                        = 10,
	ECameraProperty_MAX            = 11
};


// UserDefinedEnum Angelscript.EDebugCameraModifierMode
enum class EDebugCameraModifierMode : uint8_t
{
	Attached                       = 0,
	DetachedStatic                 = 1,
	DetachedLookAt                 = 2,
	EDebugCameraModifierMode_MAX   = 3
};


// UserDefinedEnum Angelscript.EEmbarkTimeOfDayOperationType
enum class EEmbarkTimeOfDayOperationType : uint8_t
{
	DoNotOverride                  = 0,
	OverrideAndFreeze              = 1,
	OverrideAndContinue            = 2,
	EEmbarkTimeOfDayOperationType_MAX = 3
};


// UserDefinedEnum Angelscript.ECodingStandardEnum
enum class ECodingStandardEnum : uint8_t
{
	ECodingStandardEnum_MAX        = 0
};


// UserDefinedEnum Angelscript.ETimeOfDayForcingMode
enum class ETimeOfDayForcingMode : uint8_t
{
	DoNotForce                     = 0,
	ForceTimeAndFreeze             = 1,
	ForceTimeAndAdvance            = 2,
	ETimeOfDayForcingMode_MAX      = 3
};


// UserDefinedEnum Angelscript.EFeatherInputType
enum class EFeatherInputType : uint8_t
{
	GameOnly                       = 0,
	GameAndUI                      = 1,
	UIOnly                         = 2,
	EFeatherInputType_MAX          = 3
};


// UserDefinedEnum Angelscript.ESortDirection
enum class ESortDirection : uint8_t
{
	Ascending                      = 0,
	Descending                     = 1,
	ESortDirection_MAX             = 2
};


// UserDefinedEnum Angelscript.EFeatherWindowTransformState
enum class EFeatherWindowTransformState : uint8_t
{
	NotBeingTransformed            = 0,
	IsBeingMoved                   = 1,
	IsBeingResized                 = 2,
	EFeatherWindowTransformState_MAX = 3
};


// UserDefinedEnum Angelscript.EActorFlags_BP
enum class EActorFlags_BP : uint8_t
{
	Eviction                       = 0,
	DespawnByRange                 = 1,
	EActorFlags_MAX                = 2
};


// UserDefinedEnum Angelscript.EActorFlags
enum class EActorFlags : uint8_t
{
	Eviction                       = 0,
	DespawnByRange                 = 1,
	Default                        = 2,
	EActorFlags_MAX                = 3
};


// UserDefinedEnum Angelscript.ESquadSortingType
enum class ESquadSortingType : uint8_t
{
	FillSquadFirst                 = 0,
	BalanceSquadsFirst             = 1,
	ESquadSortingType_MAX          = 2
};


// UserDefinedEnum Angelscript.EInitStepTriggerType
enum class EInitStepTriggerType : uint8_t
{
	Event                          = 0,
	Poll                           = 1,
	EInitStepTriggerType_MAX       = 2
};


// UserDefinedEnum Angelscript.EGameServerCompositeInitResult
enum class EGameServerCompositeInitResult : uint8_t
{
	NotYetReady                    = 0,
	Success                        = 1,
	Skip                           = 2,
	CriticalFailure                = 3,
	EGameServerCompositeInitResult_MAX = 4
};


// UserDefinedEnum Angelscript.EGameServerInitResult
enum class EGameServerInitResult : uint8_t
{
	NotYetReady                    = 0,
	Success                        = 1,
	CriticalFailure                = 2,
	EGameServerInitResult_MAX      = 3
};


// UserDefinedEnum Angelscript.EGameServerInitStepOnlineTweakablesState
enum class EGameServerInitStepOnlineTweakablesState : uint8_t
{
	SyncTweakables                 = 0,
	Max                            = 1,
	EGameServerInitStepOnlineTweakablesState_MAX = 2
};


// UserDefinedEnum Angelscript.EGameServerInitStepQueryVoiceChannelState
enum class EGameServerInitStepQueryVoiceChannelState : uint8_t
{
	ParseSquads                    = 0,
	QueryVoiceChannels             = 1,
	PendingVoiceChannels           = 2,
	Max                            = 3,
	EGameServerInitStepQueryVoiceChannelState_MAX = 4
};


// UserDefinedEnum Angelscript.EPlayerInitResult
enum class EPlayerInitResult : uint8_t
{
	NotYetReady                    = 0,
	Success                        = 1,
	CriticalFailure                = 2,
	EPlayerInitResult_MAX          = 3
};


// UserDefinedEnum Angelscript.EPlayerInitStatus
enum class EPlayerInitStatus : uint8_t
{
	NotYetStarted                  = 0,
	InProgress                     = 1,
	EPlayerInitStatus_MAX          = 2
};


// UserDefinedEnum Angelscript.EPlayerInitStepQueryVoiceChannelState
enum class EPlayerInitStepQueryVoiceChannelState : uint8_t
{
	QueryVoiceChannel              = 0,
	PendingVoiceChannel            = 1,
	ReplicateVoiceChannel          = 2,
	EPlayerInitStepQueryVoiceChannelState_MAX = 3
};


// UserDefinedEnum Angelscript.EGraphResult
enum class EGraphResult : uint8_t
{
	Unknown                        = 0,
	Win                            = 1,
	Defeat                         = 2,
	EGraphResult_MAX               = 3
};


// UserDefinedEnum Angelscript.EAttachmentAnimation
enum class EAttachmentAnimation : uint8_t
{
	None                           = 0,
	Zipline                        = 1,
	Hoverbike                      = 2,
	GenericVehicle                 = 3,
	Ladder                         = 4,
	EAttachmentAnimation_MAX       = 5
};


// UserDefinedEnum Angelscript.ECollisionEffectNetMode
enum class ECollisionEffectNetMode : uint8_t
{
	Auto                           = 0,
	Client                         = 1,
	Server                         = 2,
	ECollisionEffectNetMode_MAX    = 3
};


// UserDefinedEnum Angelscript.EDestructionProxyBind
enum class EDestructionProxyBind : uint8_t
{
	BindOwnerDestroyed             = 0,
	BindPartBroken                 = 1,
	BindConstructableOnDead        = 2,
	BindAll                        = 3,
	EDestructionProxyBind_MAX      = 4
};


// UserDefinedEnum Angelscript.EAutobotEnvironment
enum class EAutobotEnvironment : uint8_t
{
	IntegrationTest                = 0,
	Ingame                         = 1,
	EAutobotEnvironment_MAX        = 2
};


// UserDefinedEnum Angelscript.EMoveToCompletionReason
enum class EMoveToCompletionReason : uint8_t
{
	Overriden                      = 0,
	FoundNoPath                    = 1,
	Successfull                    = 2,
	GotStuck                       = 3,
	EMoveToCompletionReason_MAX    = 4
};


// UserDefinedEnum Angelscript.EMoveToPathingStrategy
enum class EMoveToPathingStrategy : uint8_t
{
	DoNotPath                      = 0,
	TryPathElseMoveWithout         = 1,
	FailIfNoPathFound              = 2,
	EMoveToPathingStrategy_MAX     = 3
};


// UserDefinedEnum Angelscript.EAimOrigin
enum class EAimOrigin : uint8_t
{
	ActorLocation                  = 0,
	ShootLocation                  = 1,
	ThrowLocation                  = 2,
	EAimOrigin_MAX                 = 3
};


// UserDefinedEnum Angelscript.EAutobotStateTransitionMethod
enum class EAutobotStateTransitionMethod : uint8_t
{
	Replace                        = 0,
	ReplaceSameElsePush            = 1,
	Push                           = 2,
	EAutobotStateTransitionMethod_MAX = 3
};


// UserDefinedEnum Angelscript.EAutobotUtilityResponseCurveType
enum class EAutobotUtilityResponseCurveType : uint8_t
{
	ExponentialPolynominal         = 0,
	Logistic                       = 1,
	Heaviside                      = 2,
	EAutobotUtilityResponseCurveType_MAX = 3
};


// UserDefinedEnum Angelscript.EAutobotUtilityActionGroupType
enum class EAutobotUtilityActionGroupType : uint8_t
{
	Group0                         = 0,
	Group1                         = 1,
	Group2                         = 2,
	Group3                         = 3,
	EAutobotUtilityActionGroupType_MAX = 4
};


// UserDefinedEnum Angelscript.EAutobotUtilitySystemTargetType
enum class EAutobotUtilitySystemTargetType : uint8_t
{
	Invalid                        = 0,
	Actor                          = 1,
	Object                         = 2,
	Shape                          = 3,
	AutobotTarget                  = 4,
	Vector                         = 5,
	EAutobotUtilitySystemTargetType_MAX = 6
};


// UserDefinedEnum Angelscript.EAutobotUtilityResult
enum class EAutobotUtilityResult : uint8_t
{
	Success                        = 0,
	Failure                        = 1,
	EAutobotUtilityResult_MAX      = 2
};


// UserDefinedEnum Angelscript.EAutobotUtilityActionStatus
enum class EAutobotUtilityActionStatus : uint8_t
{
	NotActive                      = 0,
	InProgress                     = 1,
	Failed                         = 2,
	Succeeded                      = 3,
	EAutobotUtilityActionStatus_MAX = 4
};


// UserDefinedEnum Angelscript.EButtonModifier
enum class EButtonModifier : uint8_t
{
	None                           = 0,
	Hold                           = 1,
	Drag                           = 2,
	EButtonModifier_MAX            = 3
};


// UserDefinedEnum Angelscript.EContextActionAvailability
enum class EContextActionAvailability : uint8_t
{
	Available                      = 0,
	Unavailable                    = 1,
	Blocked                        = 2,
	EContextActionAvailability_MAX = 3
};


// UserDefinedEnum Angelscript.EContextActionUsageMode
enum class EContextActionUsageMode : uint8_t
{
	None                           = 0,
	Progress                       = 1,
	Hold                           = 2,
	EContextActionUsageMode_MAX    = 3
};


// UserDefinedEnum Angelscript.EContextActionComparison
enum class EContextActionComparison : uint8_t
{
	None                           = 0,
	Upgrade                        = 1,
	Downgrade                      = 2,
	EContextActionComparison_MAX   = 3
};


// UserDefinedEnum Angelscript.EInputActionPressedBehavior
enum class EInputActionPressedBehavior : uint8_t
{
	ActivateAbility                = 0,
	ActivateAbilityOnHold          = 1,
	SendGameplayEventToActor       = 2,
	ToggleAbility                  = 3,
	ToggleAbilityWithCancelTag     = 4,
	None                           = 5,
	EInputActionPressedBehavior_MAX = 6
};


// UserDefinedEnum Angelscript.EInputActionReleaseBehavior
enum class EInputActionReleaseBehavior : uint8_t
{
	None                           = 0,
	CancelAbility                  = 1,
	EndAbility                     = 2,
	ActivateCancelGameplayTag      = 3,
	EInputActionReleaseBehavior_MAX = 4
};


// UserDefinedEnum Angelscript.EInputPressedActionBufferType
enum class EInputPressedActionBufferType : uint8_t
{
	None                           = 0,
	TryTriggerWithBufferTime       = 1,
	AlwaysRetriggerOnHold          = 2,
	AlwaysRetriggerOnHold_RetriggerBufferTimeOnRelease = 3,
	RetriggerOnHoldUntilSuccess    = 4,
	EInputPressedActionBufferType_MAX = 5
};


// UserDefinedEnum Angelscript.EInputReleasedActionBufferType
enum class EInputReleasedActionBufferType : uint8_t
{
	None                           = 0,
	TryTriggerWithBufferTime       = 1,
	TryTriggerWhenActiveWithBufferTime = 2,
	EInputReleasedActionBufferType_MAX = 3
};


// UserDefinedEnum Angelscript.EInputTagAbilitySetting
enum class EInputTagAbilitySetting : uint8_t
{
	Press                          = 0,
	Toggle                         = 1,
	EInputTagAbilitySetting_MAX    = 2
};


// UserDefinedEnum Angelscript.EInputType
enum class EInputType : uint8_t
{
	Keyboard                       = 0,
	KeyBoardAndMouse               = 1,
	Gamepad                        = 2,
	All                            = 3,
	EInputType_MAX                 = 4
};


// UserDefinedEnum Angelscript.EInputDirection
enum class EInputDirection : uint8_t
{
	None                           = 0,
	Forward                        = 1,
	Backward                       = 2,
	Left                           = 3,
	Right                          = 4,
	ForwardLeft                    = 5,
	ForwardRight                   = 6,
	BackwardLeft                   = 7,
	BackwardRight                  = 8,
	EInputDirection_MAX            = 9
};


// UserDefinedEnum Angelscript.ECharacterAxis
enum class ECharacterAxis : uint8_t
{
	MoveForward                    = 0,
	MoveRight                      = 1,
	TurnRate                       = 2,
	Turn                           = 3,
	LookUpRate                     = 4,
	LookUp                         = 5,
	ECharacterAxis_MAX             = 6
};


// UserDefinedEnum Angelscript.EPlayerAction
enum class EPlayerAction : uint8_t
{
	Click                          = 0,
	SelectMenu                     = 1,
	EPlayerAction_MAX              = 2
};


// UserDefinedEnum Angelscript.EItemAvailability
enum class EItemAvailability : uint8_t
{
	Available                      = 0,
	Unavailable                    = 1,
	EItemAvailability_MAX          = 2
};


// UserDefinedEnum Angelscript.EBattlepassType
enum class EBattlepassType : uint8_t
{
	Default                        = 0,
	Premium                        = 1,
	EBattlepassType_MAX            = 2
};


// UserDefinedEnum Angelscript.EQuestEventListenerType
enum class EQuestEventListenerType : uint8_t
{
	Unknown                        = 0,
	EnemyKilled                    = 1,
	EnemyKilledWhoIsStealingObjective = 2,
	EnemyKilledWhoIsCarryingTicket = 3,
	EnemyKilledWhoIsLastInSquad    = 4,
	EnemyKilledWithMeleeWeapon     = 5,
	EnemyKilledWithQuickMelee      = 6,
	EnemyKilledWithLastRoundInMagazine = 7,
	DamageEnemy                    = 8,
	DamageEnemyWithArchetype       = 9,
	DamageEnemyWithRangedWeapons   = 10,
	DamageEnemyWithMeleeWeapons    = 11,
	DamageEnemyWithMines           = 12,
	DamageEnemyWhileSliding        = 13,
	DamageEnemyWithGas             = 14,
	DamageEnemyWithFire            = 15,
	DamageEnemyInBackWhileCloaking = 16,
	DamageBuilding                 = 17,
	DestroyLadder                  = 18,
	DestroyBuildingPiece           = 19,
	DestroyEnemyZipline            = 20,
	AbsorbDamageWithShield         = 21,
	RestoreHealth                  = 22,
	DetectOpponent                 = 23,
	UseAllDashChargedWithoutTouchingGround = 24,
	ObjectiveSteal                 = 25,
	ObjectiveOpenVault             = 26,
	ObjectiveTransferCashBox       = 27,
	ObjectivePerformCashOut        = 28,
	ObjectiveCashMoneyInRound      = 29,
	ObjectivePing                  = 30,
	RoundPlay                      = 31,
	RoundPlayWithArchetype         = 32,
	CasualRoundPlay                = 33,
	RoundPlayWithoutElimination    = 34,
	RoundWin                       = 35,
	CasualRoundWin                 = 36,
	RoundWinWithoutElimination     = 37,
	BankIt_RoundPlayed             = 38,
	BankIt_RoundWin                = 39,
	TournamentWon                  = 40,
	TournamentWonInRow             = 41,
	DailyQuestCompleted            = 42,
	WeeklyQuestCompleted           = 43,
	EQuestEventListenerType_MAX    = 44
};


// UserDefinedEnum Angelscript.EQuestCadence
enum class EQuestCadence : uint8_t
{
	Unknown                        = 0,
	Daily                          = 1,
	Weekly                         = 2,
	Seasonal                       = 3,
	None                           = 4,
	EQuestCadence_MAX              = 5
};


// UserDefinedEnum Angelscript.EQuestCategory
enum class EQuestCategory : uint8_t
{
	Easy                           = 0,
	Hard                           = 1,
	Bonus                          = 2,
	Recurring                      = 3,
	EQuestCategory_MAX             = 4
};


// UserDefinedEnum Angelscript.EForceChange
enum class EForceChange : uint8_t
{
	Instant                        = 0,
	ConstantBegin                  = 1,
	ConstantEnd                    = 2,
	EForceChange_MAX               = 3
};


// UserDefinedEnum Angelscript.EForceCollectorInstigatorTrackingEvents
enum class EForceCollectorInstigatorTrackingEvents : uint8_t
{
	StartedTracking                = 0,
	StoppedTracking                = 1,
	EForceCollectorInstigatorTrackingEvents_MAX = 2
};


// UserDefinedEnum Angelscript.EForceMagnitude
enum class EForceMagnitude : uint8_t
{
	VerySmall                      = 0,
	Small                          = 1,
	Medium                         = 2,
	Heavy                          = 3,
	VeryHeavy                      = 4,
	None                           = 5,
	NUM_FORCEMAGNITUDES            = 6,
	EForceMagnitude_MAX            = 7
};


// UserDefinedEnum Angelscript.EObjectHistoryResult
enum class EObjectHistoryResult : uint8_t
{
	Fail_ObjectNotTracked          = 0,
	Fail_NoStateAvailable          = 1,
	Success_BestEffortState        = 2,
	Success_LerpableState          = 3,
	Success_PreciseState           = 4,
	EObjectHistoryResult_MAX       = 5
};


// UserDefinedEnum Angelscript.EPingIntent
enum class EPingIntent : uint8_t
{
	DefaultPing                    = 0,
	AutoPing                       = 1,
	RemovedPing                    = 2,
	AcceptPing                     = 3,
	RejectPing                     = 4,
	RefreshPing                    = 5,
	WillHealPing                   = 6,
	AttackPing                     = 7,
	DefendPing                     = 8,
	AmmoPing                       = 9,
	ThanksPing                     = 10,
	ItemPing                       = 11,
	NeedHealPing                   = 12,
	LocationPing                   = 13,
	DirectionPing                  = 14,
	ObjectivePing                  = 15,
	Warning                        = 16,
	None                           = 17,
	Hype                           = 18,
	RequestHelp                    = 19,
	RequestGroupUp                 = 20,
	Joining                        = 21,
	NotJoining                     = 22,
	Okay                           = 23,
	Hello                          = 24,
	Pin                            = 25,
	EPingIntent_MAX                = 26
};


// UserDefinedEnum Angelscript.EHoverDescriptionCategory
enum class EHoverDescriptionCategory : uint8_t
{
	Auto                           = 0,
	Enemy                          = 1,
	Loot                           = 2,
	Player                         = 3,
	Vehicle                        = 4,
	Unknown                        = 5,
	Item                           = 6,
	Location                       = 7,
	PointOfInterest                = 8,
	CraftingStation                = 9,
	Traversal                      = 10,
	EHoverDescriptionCategory_MAX  = 11
};


// UserDefinedEnum Angelscript.ERootMotionAnimMatchingType
enum class ERootMotionAnimMatchingType : uint8_t
{
	None                           = 0,
	VaultDistanceMatching          = 1,
	ERootMotionAnimMatchingType_MAX = 2
};


// UserDefinedEnum Angelscript.EForceApplicationObjectTypeHelper
enum class EForceApplicationObjectTypeHelper : uint8_t
{
	PlayersOnly                    = 0,
	Physics                        = 1,
	PhysicsAndPlayer               = 2,
	EForceApplicationObjectTypeHelper_MAX = 3
};


// UserDefinedEnum Angelscript.ESubsystemDomain
enum class ESubsystemDomain : uint8_t
{
	Undefined                      = 0,
	Pings                          = 1,
	Emotes                         = 2,
	Quickslot                      = 3,
	ItemUpgrading                  = 4,
	Callouts                       = 5,
	Sprays                         = 6,
	Communications                 = 7,
	ESubsystemDomain_MAX           = 8
};


// UserDefinedEnum Angelscript.ECustomTraceChannels
enum class ECustomTraceChannels : uint8_t
{
	AIVisibility                   = 0,
	ContextualActionCandidate      = 1,
	ECustomTraceChannels_MAX       = 2
};


// UserDefinedEnum Angelscript.ELocoMode
enum class ELocoMode : uint8_t
{
	Still                          = 0,
	Walking                        = 1,
	Running                        = 2,
	Sprinting                      = 3,
	ELocoMode_MAX                  = 4
};


// UserDefinedEnum Angelscript.ECharacterStance
enum class ECharacterStance : uint8_t
{
	Stand                          = 0,
	Crouch                         = 1,
	DBNO                           = 2,
	Slide                          = 3,
	InAir                          = 4,
	Ladder                         = 5,
	Uncontrolled                   = 6,
	ECharacterStance_MAX           = 7
};


// UserDefinedEnum Angelscript.EPostForcedMovementAction
enum class EPostForcedMovementAction : uint8_t
{
	None                           = 0,
	ResetToWorld                   = 1,
	AutoVault                      = 2,
	EPostForcedMovementAction_MAX  = 3
};


// UserDefinedEnum Angelscript.EBackendGameTransformationErrorCode
enum class EBackendGameTransformationErrorCode : uint8_t
{
	Default                        = 0,
	BackendInvalidData             = 1,
	GameMissingSupport             = 2,
	GameMissingUIMetaData          = 3,
	EBackendGameTransformationErrorCode_MAX = 4
};


// UserDefinedEnum Angelscript.EBackendGameTransformationDetailedInfo
enum class EBackendGameTransformationDetailedInfo : uint8_t
{
	PersistenceRewardNotSupported  = 0,
	GameMissingUIMetaData          = 1,
	GameMissingCharacterAssembly   = 2,
	GameMissingItemData            = 3,
	GameMissingTalentDataAsset     = 4,
	GameMissingPCC                 = 5,
	LoadoutItemMissing             = 6,
	StoreOfferMissingCostItem      = 7,
	StoreOfferMultipleCostItems    = 8,
	StoreOfferMissingProduct       = 9,
	StoreOfferMissingUIMetaData    = 10,
	StoreOfferInvalidCurrencyId    = 11,
	StoreOfferInvalidItemId        = 12,
	StoreOfferNoItems              = 13,
	StoreOfferMultipleWeaponSkins  = 14,
	StoreOfferCustomizationAndWeaponSkins = 15,
	StoreViewMissingUIMetaData     = 16,
	StoreViewLayoutMissingUIMetaData = 17,
	StoreViewInvalidAssetId        = 18,
	StoreViewMissingLayouts        = 19,
	StoreViewMissingOffers         = 20,
	StoreViewLayoutInvalidAssetId  = 21,
	StoreViewLayoutMissingOffers   = 22,
	EBackendGameTransformationDetailedInfo_MAX = 23
};


// UserDefinedEnum Angelscript.ECountingMethod
enum class ECountingMethod : uint8_t
{
	Countable                      = 0,
	MassCountable                  = 1,
	Uncountable                    = 2,
	ECountingMethod_MAX            = 3
};


// UserDefinedEnum Angelscript.EDevelopmentAvailability
enum class EDevelopmentAvailability : uint8_t
{
	EditorOnly                     = 0,
	DeveloperOnly                  = 1,
	UserFacing                     = 2,
	EDevelopmentAvailability_MAX   = 3
};


// UserDefinedEnum Angelscript.EEmbarkSkyType
enum class EEmbarkSkyType : uint8_t
{
	Day                            = 0,
	Night                          = 1,
	None                           = 2,
	EEmbarkSkyType_MAX             = 3
};


// UserDefinedEnum Angelscript.EDrivenSplineSnapMethod
enum class EDrivenSplineSnapMethod : uint8_t
{
	None                           = 0,
	SnapToActor                    = 1,
	SnapToSocket                   = 2,
	EDrivenSplineSnapMethod_MAX    = 3
};


// UserDefinedEnum Angelscript.ESplineSnapToGroundMethod
enum class ESplineSnapToGroundMethod : uint8_t
{
	NoSnap                         = 0,
	SnapAllButStartAndEnd          = 1,
	SnapAllPoints                  = 2,
	ESplineSnapToGroundMethod_MAX  = 3
};


// UserDefinedEnum Angelscript.ESquadStatus
enum class ESquadStatus : uint8_t
{
	Alive                          = 0,
	Defeated                       = 1,
	ESquadStatus_MAX               = 2
};


// UserDefinedEnum Angelscript.EActorToCheckMode
enum class EActorToCheckMode : uint8_t
{
	ActorRef                       = 0,
	FindActor                      = 1,
	EActorToCheckMode_MAX          = 2
};


// UserDefinedEnum Angelscript.EEmbarkScrollBarType
enum class EEmbarkScrollBarType : uint8_t
{
	Background                     = 0,
	Foreground                     = 1,
	BottomShadow                   = 2,
	LeftShadow                     = 3,
	RightShadow                    = 4,
	TopShadow                      = 5,
	EEmbarkScrollBarType_MAX       = 6
};


// UserDefinedEnum Angelscript.EUIColorblindMode
enum class EUIColorblindMode : uint8_t
{
	Default                        = 0,
	Deutranopia                    = 1,
	Tritanopia                     = 2,
	Protanopia                     = 3,
	EUIColorblindMode_MAX          = 4
};


// UserDefinedEnum Angelscript.EOutlineDrawMode
enum class EOutlineDrawMode : uint8_t
{
	Disabled                       = 0,
	Visible                        = 1,
	Always                         = 2,
	Obstructed                     = 3,
	EOutlineDrawMode_MAX           = 4
};


// UserDefinedEnum Angelscript.EOutlineGroup
enum class EOutlineGroup : uint8_t
{
	Disabled                       = 0,
	Highlighted                    = 1,
	RarityCommon                   = 2,
	RarityRare                     = 3,
	RarityEpic                     = 4,
	RarityLegendary                = 5,
	EnemyCore                      = 6,
	Outpost                        = 7,
	Player                         = 8,
	Critical                       = 9,
	LocalPlayer                    = 10,
	Sonar                          = 11,
	SonarEnemy                     = 12,
	NUM_GROUPS                     = 13,
	EOutlineGroup_MAX              = 14
};


// UserDefinedEnum Angelscript.EPartyStatus
enum class EPartyStatus : uint8_t
{
	None                           = 0,
	Member                         = 1,
	Leader                         = 2,
	EPartyStatus_MAX               = 3
};


// UserDefinedEnum Angelscript.EEdgeDrawStyle
enum class EEdgeDrawStyle : uint8_t
{
	BRACKETY                       = 0,
	SOLID_BORDER                   = 1,
	EEdgeDrawStyle_MAX             = 2
};


// UserDefinedEnum Angelscript.EGamepadPreset
enum class EGamepadPreset : uint8_t
{
	GadgetRadial                   = 0,
	EquipModifier                  = 1,
	DPadCycling                    = 2,
	DPadEquipping                  = 3,
	EGamepadPreset_MAX             = 4
};


// UserDefinedEnum Angelscript.EUIEmbarkInputActionNavigation
enum class EUIEmbarkInputActionNavigation : uint8_t
{
	Select                         = 0,
	Inspect                        = 1,
	Back                           = 2,
	Edit                           = 3,
	View                           = 4,
	Left                           = 5,
	Right                          = 6,
	TabLeft                        = 7,
	TabRight                       = 8,
	SpecialLeft                    = 9,
	SpecialRight                   = 10,
	Open                           = 11,
	Details                        = 12,
	TriggerLeft                    = 13,
	TriggerRight                   = 14,
	Skip                           = 15,
	Scoreboard                     = 16,
	Tab                            = 17,
	EUIEmbarkInputActionNavigation_MAX = 18
};


// UserDefinedEnum Angelscript.ECommonNavigationStrategy
enum class ECommonNavigationStrategy : uint8_t
{
	Push                           = 0,
	Override                       = 1,
	Unique                         = 2,
	Toggle                         = 3,
	Clear                          = 4,
	Skip                           = 5,
	ECommonNavigationStrategy_MAX  = 6
};


// UserDefinedEnum Angelscript.ENavigationStrategy
enum class ENavigationStrategy : uint8_t
{
	Push                           = 0,
	Unique                         = 1,
	Override                       = 2,
	OverrideIgnoreRoot             = 3,
	Skip                           = 4,
	Clear                          = 5,
	Back                           = 6,
	ENavigationStrategy_MAX        = 7
};


// UserDefinedEnum Angelscript.EEmbarkPaginatedScrollBoxNavigationDirection
enum class EEmbarkPaginatedScrollBoxNavigationDirection : uint8_t
{
	Direct                         = 0,
	FromNext                       = 1,
	FromPrevious                   = 2,
	EEmbarkPaginatedScrollBoxNavigationDirection_MAX = 3
};


// UserDefinedEnum Angelscript.ESubtitleSize
enum class ESubtitleSize : uint8_t
{
	Small                          = 0,
	Medium                         = 1,
	Large                          = 2,
	ESubtitleSize_MAX              = 3
};


// UserDefinedEnum Angelscript.ETwoPaneLayoutEdgeSnapMode
enum class ETwoPaneLayoutEdgeSnapMode : uint8_t
{
	NoEdgeSnap                     = 0,
	SnapToLeftSide                 = 1,
	SnapToRightSide                = 2,
	SnapToBothSides                = 3,
	ETwoPaneLayoutEdgeSnapMode_MAX = 4
};


// UserDefinedEnum Angelscript.EDialogResponse
enum class EDialogResponse : uint8_t
{
	None                           = 0,
	Ok                             = 1,
	Cancel                         = 2,
	EDialogResponse_MAX            = 3
};


// UserDefinedEnum Angelscript.EStagedEnableState
enum class EStagedEnableState : uint8_t
{
	Enabled                        = 0,
	EnabledThisFrame               = 1,
	Disabled                       = 2,
	DisabledThisFrame              = 3,
	EStagedEnableState_MAX         = 4
};


// UserDefinedEnum Angelscript.EGroundTraceDebugMode
enum class EGroundTraceDebugMode : uint8_t
{
	None                           = 0,
	Normal                         = 1,
	ExtraLong                      = 2,
	EGroundTraceDebugMode_MAX      = 3
};


// UserDefinedEnum Angelscript.EPlatformType
enum class EPlatformType : uint8_t
{
	PC                             = 0,
	Xbox                           = 1,
	Playstation                    = 2,
	EPlatformType_MAX              = 3
};


// UserDefinedEnum Angelscript.EVoiceChatChannelOption
enum class EVoiceChatChannelOption : uint8_t
{
	Party                          = 0,
	Squad                          = 1,
	EVoiceChatChannelOption_MAX    = 2
};


// UserDefinedEnum Angelscript.EVoicePlayerState
enum class EVoicePlayerState : uint8_t
{
	NOT_IN_CHANNEL                 = 0,
	Muted                          = 1,
	Silent                         = 2,
	Talking                        = 3,
	Blocked                        = 4,
	EVoicePlayerState_MAX          = 5
};


// UserDefinedEnum Angelscript.EVoiceModPreset
enum class EVoiceModPreset : uint8_t
{
	TwoByOne                       = 0,
	EightBit                       = 1,
	Baby                           = 2,
	Banana                         = 3,
	Bonny                          = 4,
	Boomer                         = 5,
	Bot                            = 6,
	Calitune                       = 7,
	CartoonMan                     = 8,
	CartoonWoman                   = 9,
	Cathedral                      = 10,
	Central                        = 11,
	CheapMic                       = 12,
	Chipmunk                       = 13,
	Clean                          = 14,
	Crazy                          = 15,
	CustomPitch                    = 16,
	Cute                           = 17,
	Dark                           = 18,
	DarkAngel                      = 19,
	Deep                           = 20,
	Double                         = 21,
	Drone                          = 22,
	Echo                           = 23,
	Engine                         = 24,
	Evil                           = 25,
	Evolver                        = 26,
	Fan                            = 27,
	Genius                         = 28,
	Hamsters                       = 29,
	Helium                         = 30,
	NTune                          = 31,
	NoFX                           = 32,
	Octaver                        = 33,
	Ogre                           = 34,
	Orbital                        = 35,
	PoliceBot                      = 36,
	Ruby                           = 37,
	SecondLife                     = 38,
	SpeechJammer                   = 39,
	Stranger                       = 40,
	Telephone                      = 41,
	TrapTune                       = 42,
	VeryDisco                      = 43,
	Vibrato                        = 44,
	VoiceEnhancer                  = 45,
	Vr                             = 46,
	WahWah                         = 47,
	EVoiceModPreset_MAX            = 48
};



//---------------------------------------------------------------------------
// Script Structs
//---------------------------------------------------------------------------

// ASStruct Angelscript.TimedSequenceEvent
// 0x0018
struct FTimedSequenceEvent
{
	double                                             Time;                                                     // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class USoundBase*                                  ForwardSound;                                             // 0x0008(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class USoundBase*                                  BackwardSound;                                            // 0x0010(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ASStruct Angelscript.SimpleAnimationSequenceTrack
// 0x0058
struct FSimpleAnimationSequenceTrack
{
	unsigned char                                      UnknownData00[0x4];                                       // 0x0000(0x0004) MISSED OFFSET
	struct FName                                       TrackForComponentName;                                    // 0x0004(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FName                                       TrackForComponentTag;                                     // 0x000C(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x0014(0x0004) MISSED OFFSET
	struct FEmbarkComponentSelection                   ComponentPicker;                                          // 0x0018(0x0020) (Edit, BlueprintVisible)
	class UCurveTranslateRotate*                       CurveTranslateRotate;                                     // 0x0038(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class USceneComponent*                             SceneComponent;                                           // 0x0040(0x0008) (BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData)
	float                                              StartTime;                                                // 0x0048(0x0004) (BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData)
	float                                              EndTime;                                                  // 0x004C(0x0004) (BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData)
	bool                                               bTrackIsAllowedToEvaluate;                                // 0x0050(0x0001) (BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData02[0x7];                                       // 0x0051(0x0007) MISSED OFFSET
};

// ASStruct Angelscript.ThirdAndFirstPersonAnimPair
// 0x0010
struct FThirdAndFirstPersonAnimPair
{
	class UAnimSequence*                               ThirdPersonAnimation;                                     // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UAnimSequence*                               FirstPersonAnimation;                                     // 0x0008(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ASStruct Angelscript.WarpingContext
// 0x0120
struct FWarpingContext
{
	class UWarpingAnimationContainer*                  WarpingAnimationContainer;                                // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FVector                                     WorldAlignPosition;                                       // 0x0008(0x0018) (ZeroConstructor, Transient, IsPlainOldData)
	struct FQuat                                       WorldAlignRotation;                                       // 0x0020(0x0020) (Transient, IsPlainOldData)
	struct FVector                                     WorldSourcePosition;                                      // 0x0040(0x0018) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0058(0x0008) MISSED OFFSET
	struct FQuat                                       WorldSourceRotation;                                      // 0x0060(0x0020) (Transient, IsPlainOldData)
	struct FVector                                     LocalAlignPosition;                                       // 0x0080(0x0018) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData01[0x8];                                       // 0x0098(0x0008) MISSED OFFSET
	struct FQuat                                       LocalAlignRotation;                                       // 0x00A0(0x0020) (Transient, IsPlainOldData)
	struct FVector                                     LocalSourcePosition;                                      // 0x00C0(0x0018) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData02[0x8];                                       // 0x00D8(0x0008) MISSED OFFSET
	struct FQuat                                       LocalSourceRotation;                                      // 0x00E0(0x0020) (Transient, IsPlainOldData)
	double                                             TimeToStartMontageAt;                                     // 0x0100(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	double                                             WarpAnimationStartGameTime;                               // 0x0108(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	double                                             WarpAnimationEndGameTime;                                 // 0x0110(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class USceneComponent*                             AlignToComponent;                                         // 0x0118(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
};

// ASStruct Angelscript.WeaponLagData
// 0x0028
struct FWeaponLagData
{
	double                                             StateEffect;                                              // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	double                                             VelocityPumpEffect;                                       // 0x0008(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	double                                             Smoothness;                                               // 0x0010(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	double                                             MaxInputDelta;                                            // 0x0018(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	double                                             InputDeltaDeadZoneSize;                                   // 0x0020(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ASStruct Angelscript.WeaponLagSettings
// 0x00F8
struct FWeaponLagSettings
{
	struct FWeaponLagData                              WeaponLagYawDefault;                                      // 0x0000(0x0028) (Edit, BlueprintVisible)
	struct FWeaponLagData                              WeaponLagPitchDefault;                                    // 0x0028(0x0028) (Edit, BlueprintVisible)
	struct FWeaponLagData                              WeaponLagRollDefault;                                     // 0x0050(0x0028) (Edit, BlueprintVisible)
	struct FWeaponLagData                              WeaponLagYawZoom;                                         // 0x0078(0x0028) (Edit, BlueprintVisible)
	struct FWeaponLagData                              WeaponLagPitchZoom;                                       // 0x00A0(0x0028) (Edit, BlueprintVisible)
	struct FWeaponLagData                              WeaponLagRollZoom;                                        // 0x00C8(0x0028) (Edit, BlueprintVisible)
	double                                             WeaponLagZoomTransitionSmoothness;                        // 0x00F0(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ASStruct Angelscript.WeaponLagState
// 0x0300
struct FWeaponLagState
{
	struct FMinJerk                                    PitchLagMinJerk;                                          // 0x0000(0x00D0) (Transient)
	struct FMinJerk                                    YawLagMinJerk;                                            // 0x00D0(0x00D0) (Transient)
	struct FMinJerk                                    RollLagMinJerk;                                           // 0x01A0(0x00D0) (Transient)
	struct FDoubleExactDamperVec                       LagPivotDED;                                              // 0x0270(0x0078) (Transient)
	struct FVector                                     LatestRotation;                                           // 0x02E8(0x0018) (ZeroConstructor, Transient, IsPlainOldData)
};

// ASStruct Angelscript.WeaponLeanTarget
// 0x0018
struct FWeaponLeanTarget
{
	double                                             FrontBackTarget;                                          // 0x0000(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	double                                             SidesTarget;                                              // 0x0008(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	double                                             VerticalDipTarget;                                        // 0x0010(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
};

// ASStruct Angelscript.WeaponLeanData
// 0x0018
struct FWeaponLeanData
{
	double                                             Smoothness;                                               // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	double                                             StateEffect;                                              // 0x0008(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	double                                             VelocityPumpEffect;                                       // 0x0010(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ASStruct Angelscript.WeaponLeanSettings
// 0x0090
struct FWeaponLeanSettings
{
	struct FWeaponLeanData                             LeanLocSides;                                             // 0x0000(0x0018) (Edit, BlueprintVisible)
	struct FWeaponLeanData                             LeanLocFrontBack;                                         // 0x0018(0x0018) (Edit, BlueprintVisible)
	struct FWeaponLeanData                             LeanLocVerticalDip;                                       // 0x0030(0x0018) (Edit, BlueprintVisible)
	struct FWeaponLeanData                             LeanRotSidesRoll;                                         // 0x0048(0x0018) (Edit, BlueprintVisible)
	struct FWeaponLeanData                             LeanRotSidesYaw;                                          // 0x0060(0x0018) (Edit, BlueprintVisible)
	struct FWeaponLeanData                             LeanRotFrontBack;                                         // 0x0078(0x0018) (Edit, BlueprintVisible)
};

// ASStruct Angelscript.WeaponLeanState
// 0x0510
struct FWeaponLeanState
{
	struct FMinJerk                                    FrontBackLocMinJerk;                                      // 0x0000(0x00D0) (Transient)
	struct FMinJerk                                    SidesLocMinJerk;                                          // 0x00D0(0x00D0) (Transient)
	struct FMinJerk                                    VerticalDipLocMinJerk;                                    // 0x01A0(0x00D0) (Transient)
	struct FMinJerk                                    FrontBackRotMinJerk;                                      // 0x0270(0x00D0) (Transient)
	struct FMinJerk                                    SidesRotRollMinJerk;                                      // 0x0340(0x00D0) (Transient)
	struct FMinJerk                                    SidesRotYawMinJerk;                                       // 0x0410(0x00D0) (Transient)
	struct FVector                                     LatestLocationOffset;                                     // 0x04E0(0x0018) (ZeroConstructor, Transient, IsPlainOldData)
	struct FVector                                     LatestRotationOffset;                                     // 0x04F8(0x0018) (ZeroConstructor, Transient, IsPlainOldData)
};

// ASStruct Angelscript.Footstep
// 0x0068
struct FFootstep
{
	class UEffectDataAsset*                            FootstepEffects;                                          // 0x0000(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FName                                       HeelSocket;                                               // 0x0008(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FName                                       ToeSocket;                                                // 0x0010(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USkeletalMeshComponent*                      SkeletalMeshComponent;                                    // 0x0018(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class UCharacterMovementComponent*                 MovementComponent;                                        // 0x0020(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	bool                                               bIsInitialized;                                           // 0x0028(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0029(0x0007) MISSED OFFSET
	struct FVector                                     FootLocation;                                             // 0x0030(0x0018) (ZeroConstructor, Transient, IsPlainOldData)
	struct FVector                                     FootDirection;                                            // 0x0048(0x0018) (ZeroConstructor, Transient, IsPlainOldData)
	bool                                               bWasPlanted;                                              // 0x0060(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0061(0x0007) MISSED OFFSET
};

// ASStruct Angelscript.FootstepOverlaySettings
// 0x0010
struct FFootstepOverlaySettings
{
	class USoundWaveCollection*                        SoundWaveCollection;                                      // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	double                                             Volume;                                                   // 0x0008(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ASStruct Angelscript.FootstepMaterialOverlay
// 0x0060
struct FFootstepMaterialOverlay
{
	struct FFootstepOverlaySettings                    DefaultSound;                                             // 0x0000(0x0010) (Edit, BlueprintVisible)
	TMap<TEnumAsByte<EPhysicalSurface>, struct FFootstepOverlaySettings> MaterialSounds;                                           // 0x0010(0x0050) (Edit, BlueprintVisible)
};

// ASStruct Angelscript.SurfaceEffect
// 0x0070
struct FSurfaceEffect
{
	class UEffectDataAsset*                            SurfaceEffects;                                           // 0x0000(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FName                                       AttachSocket;                                             // 0x0008(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FVector2D                                   InSpeedRange;                                             // 0x0010(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	double                                             MaxDistance;                                              // 0x0020(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	double                                             VolumeMultiplier;                                         // 0x0028(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	double                                             PitchMultiplier;                                          // 0x0030(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVector2D                                   SurfaceSoundNormalizedRange;                              // 0x0038(0x0010) (ZeroConstructor, Transient, IsPlainOldData)
	TEnumAsByte<EPhysicalSurface>                      PreviousSurfaceType;                                      // 0x0048(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	bool                                               bHadContact;                                              // 0x0049(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x6];                                       // 0x004A(0x0006) MISSED OFFSET
	struct FEmbarkFXHandle                             SpawnedSurfaceEffect;                                     // 0x0050(0x0008) (Transient)
	TArray<TEnumAsByte<EPhysicalSurface>>              ValidSurfaceTypes;                                        // 0x0058(0x0010) (Transient)
	bool                                               bHasDefaultMapping;                                       // 0x0068(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	int8_t                                             InitializationLevel;                                      // 0x0069(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	bool                                               bWasInStairs;                                             // 0x006A(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData01[0x5];                                       // 0x006B(0x0005) MISSED OFFSET
};

// ASStruct Angelscript.SimpleFootstep
// 0x00B8
struct FSimpleFootstep
{
	class UEffectDataAsset*                            FootstepEffects;                                          // 0x0000(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FName                                       HeelSocket;                                               // 0x0008(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FName                                       ToeSocket;                                                // 0x0010(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USkeletalMeshComponent*                      SkeletalMeshComponent;                                    // 0x0018(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	bool                                               bIsInitialized;                                           // 0x0020(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0021(0x0007) MISSED OFFSET
	struct FVector                                     FootLocation;                                             // 0x0028(0x0018) (ZeroConstructor, Transient, IsPlainOldData)
	struct FVector                                     FootDirection;                                            // 0x0040(0x0018) (ZeroConstructor, Transient, IsPlainOldData)
	double                                             RotationSpeed;                                            // 0x0058(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	bool                                               bWasPlanted;                                              // 0x0060(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0061(0x0007) MISSED OFFSET
	double                                             FootHeightPlantThreshold;                                 // 0x0068(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	struct FVector                                     FootVelocity;                                             // 0x0070(0x0018) (ZeroConstructor, Transient, IsPlainOldData)
	struct FVector                                     PreviousFootLocation;                                     // 0x0088(0x0018) (ZeroConstructor, Transient, IsPlainOldData)
	struct FVector                                     PreviousFootDirection;                                    // 0x00A0(0x0018) (ZeroConstructor, Transient, IsPlainOldData)
};

// ASStruct Angelscript.AudioPassBy
// 0x0078
struct FAudioPassBy
{
	class USoundBase*                                  PassBySound;                                              // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bMoveSoundWithComponent;                                  // 0x0008(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0009(0x0007) MISSED OFFSET
	double                                             TimeToAudioPeak;                                          // 0x0010(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	double                                             DefaultPitch;                                             // 0x0018(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	double                                             DefaultPitchDistance;                                     // 0x0020(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	double                                             DefaultPitchSpeed;                                        // 0x0028(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FVector2D                                   PitchRange;                                               // 0x0030(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bUseStartOffsetIfDetectedLate;                            // 0x0040(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bShouldMoveToTriggerPassby;                               // 0x0041(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x6];                                       // 0x0042(0x0006) MISSED OFFSET
	struct FVector                                     PreviousListenerPosition;                                 // 0x0048(0x0018) (ZeroConstructor, Transient, IsPlainOldData)
	struct FEmbarkFXHandle                             SpawnedPassBySound;                                       // 0x0060(0x0008) (Transient)
	class UWorld*                                      World;                                                    // 0x0068(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	float                                              TimeOfActivation;                                         // 0x0070(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	bool                                               bIsLocalPlayerInstigator;                                 // 0x0074(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData02[0x3];                                       // 0x0075(0x0003) MISSED OFFSET
};

// ASStruct Angelscript.AudioFloatInterpolator
// 0x0050
struct FAudioFloatInterpolator
{
	unsigned char                                      UnknownData00[0x8];                                       // 0x0000(0x0008) MISSED OFFSET
	double                                             InterpolationTime;                                        // 0x0008(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	double                                             AttackTime;                                               // 0x0010(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	double                                             ReleaseTime;                                              // 0x0018(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	double                                             AttackRate;                                               // 0x0020(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	double                                             ReleaseRate;                                              // 0x0028(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	double                                             InterpolatedValue;                                        // 0x0030(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	bool                                               bHaveInterpolatedValue;                                   // 0x0038(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0039(0x0007) MISSED OFFSET
	double                                             Speed;                                                    // 0x0040(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	double                                             Accel;                                                    // 0x0048(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
};

// ASStruct Angelscript.AsyncClientGroundTrace
// 0x0138
struct FAsyncClientGroundTrace
{
	uint64_t                                           AsyncTraceHandle;                                         // 0x0000(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	int64_t                                            LastTraceFrame;                                           // 0x0008(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	bool                                               bIsTracehandleValid;                                      // 0x0010(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	bool                                               bSetup;                                                   // 0x0011(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x6];                                       // 0x0012(0x0006) MISSED OFFSET
	double                                             MinDistanceBetweenTracesSquared;                          // 0x0018(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	struct FVector                                     LastLinetraceStart;                                       // 0x0020(0x0018) (ZeroConstructor, Transient, IsPlainOldData)
	bool                                               bIsOnGround;                                              // 0x0038(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	bool                                               bEnabled;                                                 // 0x0039(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bTraceComplex;                                            // 0x003A(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x5];                                       // 0x003B(0x0005) MISSED OFFSET
	double                                             LinetraceLength;                                          // 0x0040(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	double                                             MinMoveDistanceForNewLinetrace;                           // 0x0048(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FHitResult                                  HitResult;                                                // 0x0050(0x00E8) (Transient, IsPlainOldData)
};

// ASStruct Angelscript.ProjectedCircle
// 0x0020
struct FProjectedCircle
{
	struct FVector                                     Center;                                                   // 0x0000(0x0018) (ZeroConstructor, Transient, IsPlainOldData)
	double                                             Radius;                                                   // 0x0018(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
};

// ASStruct Angelscript.ProjectedBubbleOfTarget
// 0x0028
struct FProjectedBubbleOfTarget
{
	class AActor*                                      Actor;                                                    // 0x0000(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	struct FProjectedCircle                            Circle;                                                   // 0x0008(0x0020) (Transient)
};

// ASStruct Angelscript.TrackedTarget
// 0x0038
struct FTrackedTarget
{
	struct FComponentOrStyle                           Target;                                                   // 0x0000(0x0018) (Transient)
	struct FVector                                     TargetWorldPos;                                           // 0x0018(0x0018) (ZeroConstructor, Transient, IsPlainOldData)
	double                                             TargetProjectedDistanceToCenter;                          // 0x0030(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
};

// ASStruct Angelscript.AimAssistConfig
// 0x0060
struct FAimAssistConfig
{
	bool                                               bIsFrictionEnabled;                                       // 0x0000(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0001(0x0007) MISSED OFFSET
	double                                             FrictionCircleAngle;                                      // 0x0008(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	double                                             FrictionSensetivityMultiplier;                            // 0x0010(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bIsMagnetismEnabled;                                      // 0x0018(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0019(0x0007) MISSED OFFSET
	double                                             MagnetismCircleBoundaryAngle;                             // 0x0020(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	double                                             MagnetismCircleEngagementAngle;                           // 0x0028(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bIsTrackingEnabled;                                       // 0x0030(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x7];                                       // 0x0031(0x0007) MISSED OFFSET
	double                                             TrackingCircleAngle;                                      // 0x0038(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	double                                             TrackingSpeedInDegrees;                                   // 0x0040(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	double                                             TrackingMovementThreshold;                                // 0x0048(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	double                                             TrackingCompensationPercent;                              // 0x0050(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	double                                             MaxDistance;                                              // 0x0058(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ASStruct Angelscript.AimAssistManager
// 0x0108
struct FAimAssistManager
{
	struct FAimAssistConfig                            Config;                                                   // 0x0000(0x0060) (Transient)
	double                                             ProjectionPlaneDistance;                                  // 0x0060(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class AEmbarkCharacterBase*                        Pawn;                                                     // 0x0068(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class APlayerController*                           Controller;                                               // 0x0070(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class UCameraComponent*                            Camera;                                                   // 0x0078(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	struct FRotator                                    CachedInputAimRotation;                                   // 0x0080(0x0018) (ZeroConstructor, Transient, IsPlainOldData)
	bool                                               bIsFrictionActive;                                        // 0x0098(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0099(0x0007) MISSED OFFSET
	double                                             OldInputYawScale;                                         // 0x00A0(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	double                                             OldInputPitchScale;                                       // 0x00A8(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	struct FTrackedTarget                              LastTrackedTarget;                                        // 0x00B0(0x0038) (Transient)
	struct FVector                                     CurrentTrackedDirection;                                  // 0x00E8(0x0018) (ZeroConstructor, Transient, IsPlainOldData)
	bool                                               bCurrentlyTracking;                                       // 0x0100(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0101(0x0007) MISSED OFFSET
};

// ASStruct Angelscript.RecoilProfile
// 0x0158
struct FRecoilProfile
{
	struct FRuntimeFloatCurve                          RecoilCurveYaw;                                           // 0x0000(0x0088) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	struct FVector2D                                   YawProceduralRange;                                       // 0x0088(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FRuntimeFloatCurve                          RecoilCurvePitch;                                         // 0x0098(0x0088) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	struct FVector2D                                   PitchProceduralRange;                                     // 0x0120(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	double                                             ProceduralSwingSpeed;                                     // 0x0130(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	double                                             RecoverySpeed;                                            // 0x0138(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	double                                             AdsGainMultiplier;                                        // 0x0140(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	double                                             LerpSpeed;                                                // 0x0148(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	int                                                SampleCount;                                              // 0x0150(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0154(0x0004) MISSED OFFSET
};

// ASStruct Angelscript.RecoilManager
// 0x0248
struct FRecoilManager
{
	struct FRecoilProfile                              InternalRecoilProfile;                                    // 0x0000(0x0158) (Transient)
	class APawn*                                       OwnerPawn;                                                // 0x0158(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class URecoilProfileDataAsset*                     DefaultRecoilProfileData;                                 // 0x0160(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class URecoilProfileDataAsset*                     RecoilProfileData;                                        // 0x0168(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	double                                             RecoilDecayTimer;                                         // 0x0170(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	double                                             CurrentRecoilPitch;                                       // 0x0178(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	double                                             LerpedRecoilPitch;                                        // 0x0180(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	double                                             CurrentRecoilYaw;                                         // 0x0188(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	double                                             LerpedRecoilYaw;                                          // 0x0190(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	struct FRotator                                    LastRecoilOutput;                                         // 0x0198(0x0018) (ZeroConstructor, Transient, IsPlainOldData)
	double                                             LerpSpeed;                                                // 0x01B0(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	double                                             InternalAdsGainMultiplier;                                // 0x01B8(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	double                                             PitchCurveCurrentTime;                                    // 0x01C0(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	double                                             PitchCurveMinTime;                                        // 0x01C8(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	double                                             PitchCurveMaxTime;                                        // 0x01D0(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	double                                             PitchCurveSampleIncrementSize;                            // 0x01D8(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	double                                             YawCurveCurrentTime;                                      // 0x01E0(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	double                                             YawCurveMinTime;                                          // 0x01E8(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	double                                             YawCurveMaxTime;                                          // 0x01F0(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	double                                             YawCurveSampleIncrementSize;                              // 0x01F8(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	double                                             TotalCompensationPitch;                                   // 0x0200(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	double                                             TotalCompensationYaw;                                     // 0x0208(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	double                                             LastAddedRecoilPitch;                                     // 0x0210(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	double                                             LastAddedRecoilYaw;                                       // 0x0218(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	double                                             LastAddedRecoilTimestamp;                                 // 0x0220(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	bool                                               bProceduralRecoilEnabled;                                 // 0x0228(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0229(0x0007) MISSED OFFSET
	double                                             WhereIsYawOnTheSineCurve;                                 // 0x0230(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	double                                             WhereIsPitchOnTheSineCurve;                               // 0x0238(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	double                                             ProceduralSampleIncrement;                                // 0x0240(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
};

// ASStruct Angelscript.FloatBlendStruct
// 0x0018
struct FFloatBlendStruct
{
	double                                             Current;                                                  // 0x0000(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	double                                             From;                                                     // 0x0008(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	double                                             To;                                                       // 0x0010(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
};

// ASStruct Angelscript.DispersionBaseState
// 0x00C8
struct FDispersionBaseState
{
	struct FRuntimeFloatCurve                          BlendCurve;                                               // 0x0000(0x0088) (Transient)
	struct FFloatBlendStruct                           Amount;                                                   // 0x0088(0x0018) (Transient)
	struct FFloatBlendStruct                           FireDispersionMultiplier;                                 // 0x00A0(0x0018) (Transient)
	double                                             Time;                                                     // 0x00B8(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x8];                                       // 0x00C0(0x0008) MISSED OFFSET
};

// ASStruct Angelscript.DispersionManager
// 0x0498
struct FDispersionManager
{
	class AEmbarkCharacterBase*                        Player;                                                   // 0x0000(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	struct FRuntimeFloatCurve                          CrouchingBlendCurve;                                      // 0x0008(0x0088) (Edit, BlueprintVisible, BlueprintReadOnly)
	struct FRuntimeFloatCurve                          StandingBlendCurve;                                       // 0x0090(0x0088) (Edit, BlueprintVisible, BlueprintReadOnly)
	struct FRuntimeFloatCurve                          MovingBlendCurve;                                         // 0x0118(0x0088) (Edit, BlueprintVisible, BlueprintReadOnly)
	struct FRuntimeFloatCurve                          SprintingBlendCurve;                                      // 0x01A0(0x0088) (Edit, BlueprintVisible, BlueprintReadOnly)
	struct FRuntimeFloatCurve                          UncontrollableBlendCurve;                                 // 0x0228(0x0088) (Edit, BlueprintVisible, BlueprintReadOnly)
	class UDispersionStateDataAsset*                   DispersionBase;                                           // 0x02B0(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UDispersionStateDataAsset*                   WeaponDispersionBase;                                     // 0x02B8(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	struct FDispersionBaseState                        DesiredDispersionBase;                                    // 0x02C0(0x00C8) (Transient)
	double                                             DispersionValue;                                          // 0x0388(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	struct FRuntimeFloatCurve                          ZoomDispersionBlendCurve;                                 // 0x0390(0x0088) (Edit, BlueprintVisible, BlueprintReadOnly)
	double                                             ZoomDispersionTime;                                       // 0x0418(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	struct FFloatBlendStruct                           ZoomBlend;                                                // 0x0420(0x0018) (Transient)
	double                                             TIME_BEFORE_STARTING_DECAY;                               // 0x0438(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	double                                             FireTimer;                                                // 0x0440(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	double                                             LastFiredTimestamp;                                       // 0x0448(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	double                                             FireDispersionTotal;                                      // 0x0450(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	bool                                               bHasInitialized;                                          // 0x0458(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0459(0x0007) MISSED OFFSET
	double                                             InternalModsMultiplier;                                   // 0x0460(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	double                                             FireGainSampleIncrement;                                  // 0x0468(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	double                                             FireGainSampleCurrent;                                    // 0x0470(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	double                                             InternalRecoverySpeed;                                    // 0x0478(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	double                                             DispersionPopAmount;                                      // 0x0480(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	double                                             DispersionPopTimer;                                       // 0x0488(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	bool                                               bCurrentZoomEnabled;                                      // 0x0490(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0491(0x0007) MISSED OFFSET
};

// ASStruct Angelscript.CameraPropertyModifier
// 0x0010
struct FCameraPropertyModifier
{
	unsigned char                                      UnknownData00[0x8];                                       // 0x0000(0x0008) MISSED OFFSET
	double                                             Value;                                                    // 0x0008(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
};

// ASStruct Angelscript.CameraModifierValuesCollection
// 0x0078
struct FCameraModifierValuesCollection
{
	TArray<double>                                     PropertyModifiers;                                        // 0x0000(0x0010) (Transient)
	TArray<bool>                                       PropertyModifiersValidIndexes;                            // 0x0010(0x0010) (Transient)
	TArray<double>                                     PropertyModifiersWeights;                                 // 0x0020(0x0010) (Transient)
	struct FVector                                     CameraAnimationCurveTranslation;                          // 0x0030(0x0018) (ZeroConstructor, Transient, IsPlainOldData)
	struct FVector                                     CameraAnimationCurveRotation;                             // 0x0048(0x0018) (ZeroConstructor, Transient, IsPlainOldData)
	double                                             CameraAnimationWeight;                                    // 0x0060(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	double                                             AdditiveFOVModifier;                                      // 0x0068(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	double                                             FOVModifierWeight;                                        // 0x0070(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
};

// ASStruct Angelscript.CameraStateLayer
// 0x0028
struct FCameraStateLayer
{
	class UCameraStateMachineInstance*                 Instance;                                                 // 0x0000(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class UCameraStateSettings*                        StateSettings;                                            // 0x0008(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UClass*                                      StateMachine;                                             // 0x0010(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0018(0x0004) MISSED OFFSET
	struct FName                                       WeightDriver;                                             // 0x001C(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x0024(0x0004) MISSED OFFSET
};

// ASStruct Angelscript.BlendingCameraStates
// 0x00B8
struct FBlendingCameraStates
{
	class UCameraStateNodeInstance*                    From;                                                     // 0x0000(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class UCameraStateNodeInstance*                    To;                                                       // 0x0008(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	struct FRuntimeFloatCurve                          BlendCurve;                                               // 0x0010(0x0088) (Transient)
	double                                             BlendDuration;                                            // 0x0098(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	double                                             CurrentTime;                                              // 0x00A0(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	double                                             FromCurrentTimeCopy;                                      // 0x00A8(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	double                                             ToCurrentTimeCopy;                                        // 0x00B0(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
};

// ASStruct Angelscript.CrosshairPositions
// 0x0010
struct FCrosshairPositions
{
	double                                             DeltaCombo;                                               // 0x0000(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	double                                             PrevYaw;                                                  // 0x0008(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
};

// ASStruct Angelscript.DispersionBaseMode
// 0x0018
struct FDispersionBaseMode
{
	double                                             FireDispersionMultiplier;                                 // 0x0000(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	double                                             Dispersion;                                               // 0x0008(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0010(0x0008) MISSED OFFSET
};

// ASStruct Angelscript.DispersionBaseStateSettings
// 0x01E8
struct FDispersionBaseStateSettings
{
	struct FDispersionBaseMode                         Crouching;                                                // 0x0000(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly)
	struct FDispersionBaseMode                         CrouchMoving;                                             // 0x0018(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly)
	struct FDispersionBaseMode                         Standing;                                                 // 0x0030(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly)
	struct FDispersionBaseMode                         StandMoving;                                              // 0x0048(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly)
	struct FDispersionBaseMode                         Sprinting;                                                // 0x0060(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly)
	struct FDispersionBaseMode                         Uncontrollable;                                           // 0x0078(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly)
	struct FRuntimeFloatCurve                          FireDispersionGainPattern;                                // 0x0090(0x0088) (Edit, BlueprintVisible, BlueprintReadOnly)
	int                                                SampleCount;                                              // 0x0118(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x011C(0x0004) MISSED OFFSET
	double                                             FireDispersionMax;                                        // 0x0120(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	double                                             MaxDispersion;                                            // 0x0128(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	double                                             MinDispersion;                                            // 0x0130(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bUseDispersionSampleCurve;                                // 0x0138(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0139(0x0007) MISSED OFFSET
	struct FRuntimeFloatCurve                          DispersionSampleCurve;                                    // 0x0140(0x0088) (Edit, BlueprintVisible, BlueprintReadOnly)
	double                                             RecoverySpeed;                                            // 0x01C8(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	double                                             ZoomDispersionScale;                                      // 0x01D0(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	double                                             DispersionPopMax;                                         // 0x01D8(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	double                                             PopRecoverySpeed;                                         // 0x01E0(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
};

// ASStruct Angelscript.CameraModifierStruct
// 0x0070
struct FCameraModifierStruct
{
	double                                             LagSpeed;                                                 // 0x0000(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	double                                             ArmLength;                                                // 0x0008(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	double                                             RightSideOffset;                                          // 0x0010(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	double                                             HeightOffset;                                             // 0x0018(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	double                                             ForwardOffset;                                            // 0x0020(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	double                                             FieldOfView;                                              // 0x0028(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCurveFloat*                                 BlendInCurve;                                             // 0x0030(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCurveTranslateRotate*                       CameraAnimationTrack;                                     // 0x0038(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	double                                             VerticalSmoothess;                                        // 0x0040(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	double                                             HorizontalSmoothness;                                     // 0x0048(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	double                                             FirstPerson;                                              // 0x0050(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bFirstPerson;                                             // 0x0058(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0059(0x0007) MISSED OFFSET
	double                                             Time;                                                     // 0x0060(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	double                                             Alpha;                                                    // 0x0068(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
};

// ASStruct Angelscript.ZoomingConfig
// 0x0090
struct FZoomingConfig
{
	double                                             ZoomingTime;                                              // 0x0000(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	struct FRuntimeFloatCurve                          OverrideZoomingCurve;                                     // 0x0008(0x0088) (Transient)
};

// ASStruct Angelscript.ZoomingState
// 0x0018
struct FZoomingState
{
	bool                                               bIsZooming;                                               // 0x0000(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0001(0x0007) MISSED OFFSET
	double                                             LinearAlpha;                                              // 0x0008(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, RepSkip, RepNotify, Interp, NonTransactional, EditorOnly, NoDestructor, AutoWeak, ContainsInstancedReference, AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, Protected, BlueprintCallable, BlueprintAuthorityOnly, TextExportTransient, NonPIEDuplicateTransient, ExposeOnSpawn, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected, NativeAccessSpecifierPrivate)
	double                                             Alpha;                                                    // 0x0010(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, RepSkip, RepNotify, Interp, NonTransactional, EditorOnly, NoDestructor, AutoWeak, ContainsInstancedReference, AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, Protected, BlueprintCallable, BlueprintAuthorityOnly, TextExportTransient, NonPIEDuplicateTransient, ExposeOnSpawn, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected, NativeAccessSpecifierPrivate)
};

// ASStruct Angelscript.ActorDissolvePropreties
// 0x0048
struct FActorDissolvePropreties
{
	class UPrimitiveComponent*                         MeshToDissolve;                                           // 0x0000(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	struct FVector                                     RelativeDissolveStartLocation;                            // 0x0008(0x0018) (ZeroConstructor, Transient, IsPlainOldData)
	double                                             DissolveRatioPerSecond;                                   // 0x0020(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	double                                             DissolveRadius;                                           // 0x0028(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	double                                             DissolveInitialScale;                                     // 0x0030(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	struct FScriptDelegate                             OnDissolveCompleteDelegate;                               // 0x0038(0x0010) (ZeroConstructor, Transient)
};

// ASStruct Angelscript.DissolveRatioData
// 0x0018
struct FDissolveRatioData
{
	double                                             Ratio;                                                    // 0x0000(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	struct FScriptDelegate                             RatioReachedDelegate;                                     // 0x0008(0x0010) (ZeroConstructor, Transient)
};

// ASStruct Angelscript.ActiveDissolveData
// 0x0060
struct FActiveDissolveData
{
	struct FActorDissolvePropreties                    DissolveProperties;                                       // 0x0000(0x0048) (Transient)
	TArray<struct FDissolveRatioData>                  RatioParams;                                              // 0x0048(0x0010) (Transient)
	double                                             DissolvedRatio;                                           // 0x0058(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
};

// ASStruct Angelscript.QueuedDamage
// 0x0048
struct FQueuedDamage
{
	struct FGameplayAbilityTargetDataHandle            Handle;                                                   // 0x0000(0x0028) (Transient)
	struct FGameplayEffectSpecHandle                   SpecHandle;                                               // 0x0028(0x0010) (Transient)
	TArray<int>                                        IndexToApply;                                             // 0x0038(0x0010) (Transient)
};

// ASStruct Angelscript.PowerConnectionChangeData
// 0x0018
struct FPowerConnectionChangeData
{
	struct FScriptDelegate                             Delegate;                                                 // 0x0000(0x0010) (ZeroConstructor, Transient)
	bool                                               bNewState;                                                // 0x0010(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	bool                                               bFromEnvironmentalCondition;                              // 0x0011(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x6];                                       // 0x0012(0x0006) MISSED OFFSET
};

// ASStruct Angelscript.BreakEventDamageInfo
// 0x00B8
struct FBreakEventDamageInfo
{
	class AActor*                                      BrokenActor;                                              // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UPrimitiveComponent*                         BrokenComponent;                                          // 0x0008(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FName                                       BrokenBone;                                               // 0x0010(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class AActor*                                      BreakSourceActor;                                         // 0x0018(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FVector                                     Location;                                                 // 0x0020(0x0018) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TEnumAsByte<EDSMDamageType>                        BreakReason;                                              // 0x0038(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0039(0x0007) MISSED OFFSET
	struct FVector                                     Origin;                                                   // 0x0040(0x0018) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FVector                                     ImpactPoint;                                              // 0x0058(0x0018) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FVector                                     Direction;                                                // 0x0070(0x0018) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FVector                                     CrumbleDirection;                                         // 0x0088(0x0018) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FVector                                     BoneBounds;                                               // 0x00A0(0x0018) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ASStruct Angelscript.HoverInfo
// 0x0060
struct FHoverInfo
{
	bool                                               bIsVisible;                                               // 0x0000(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0001(0x0007) MISSED OFFSET
	struct FText                                       Text;                                                     // 0x0008(0x0018) (Edit, BlueprintVisible)
	struct FText                                       Details;                                                  // 0x0020(0x0018) (Edit, BlueprintVisible)
	struct FLinearColor                                Color;                                                    // 0x0038(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FText                                       DisabledText;                                             // 0x0048(0x0018) (Edit, BlueprintVisible)
};

// ASStruct Angelscript.LoopingEffectsProperties
// 0x00C8
struct FLoopingEffectsProperties
{
	unsigned char                                      UnknownData00[0x8];                                       // 0x0000(0x0008) MISSED OFFSET
	unsigned char                                      UnknownData01[0x28];                                      // 0x0000(0x0028) UNKNOWN PROPERTY: EffectReference
	unsigned char                                      UnknownData02[0x28];                                      // 0x0030(0x0028) UNKNOWN PROPERTY: MeshReference
	unsigned char                                      UnknownData03[0x28];                                      // 0x0058(0x0028) UNKNOWN PROPERTY: MeshMaterialReference
	struct FVector                                     Offset;                                                   // 0x0080(0x0018) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              ChanceToSpawn;                                            // 0x0098(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              DelayDeactivationAfterBreak;                              // 0x009C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FEmbarkFXHandle                             NiagaraHandle;                                            // 0x00A0(0x0008) (Transient)
	class UNiagaraSystem*                              ResolvedNiagara;                                          // 0x00A8(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class UStaticMeshComponent*                        MeshHandle;                                               // 0x00B0(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class UStaticMesh*                                 ResolvedMesh;                                             // 0x00B8(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class UMaterialInstance*                           ResolvedMaterial;                                         // 0x00C0(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
};

// ASStruct Angelscript.DiscoveryZiplineSeatExtraState
// 0x0270
struct FDiscoveryZiplineSeatExtraState
{
	struct FMinJerkVec                                 LocationOffset;                                           // 0x0000(0x0270) (Transient)
};

// ASStruct Angelscript.ZiplineAttemptDetachInteractionData
// 0x0018
struct FZiplineAttemptDetachInteractionData
{
	int                                                CableID;                                                  // 0x0000(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0004(0x0004) MISSED OFFSET
	class UZiplineProxyComponent*                      InteractionProxy;                                         // 0x0008(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData01[0x8];                                       // 0x0010(0x0008) MISSED OFFSET
};

// ASStruct Angelscript.ZiplineInteractionData
// 0x0020
struct FZiplineInteractionData
{
	class UZiplineProxyComponent*                      InteractionProxy;                                         // 0x0000(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	struct FVector                                     InteractionDir;                                           // 0x0008(0x0018) (ZeroConstructor, Transient, IsPlainOldData)
};

// ASStruct Angelscript.ZiplineAttemptAttachInteractionData
// 0x0028
struct FZiplineAttemptAttachInteractionData
{
	int                                                CableID;                                                  // 0x0000(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0004(0x0004) MISSED OFFSET
	struct FZiplineInteractionData                     InteractionData;                                          // 0x0008(0x0020) (Transient)
};

// ASStruct Angelscript.CollisionEffectHandler
// 0x00D0
struct FCollisionEffectHandler
{
	struct FGameplayTag                                CollisionGamePlayCue;                                     // 0x0000(0x0008) (Edit, BlueprintVisible)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0008(0x0008) MISSED OFFSET
	struct FScriptDelegate                             CollisionEffectLookupDelegate;                            // 0x0010(0x0010) (ZeroConstructor, Transient)
	double                                             MinNormalImpulseByMassForGC;                              // 0x0020(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	double                                             CollisionCooldownTime;                                    // 0x0028(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	double                                             CoolDownOverrideFactor;                                   // 0x0030(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	double                                             MinMoveDistanceSqrForNewGC;                               // 0x0038(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	double                                             DotPreviousRotationMax;                                   // 0x0040(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	double                                             PreviousCollisionNormalImpulse;                           // 0x0048(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	double                                             PreviousCollisionTime;                                    // 0x0050(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	TMap<struct FName, struct FTransform>              PreviousTransforms;                                       // 0x0058(0x0050) (Transient)
	class UEmbarkAbilitySystemComponent*               ASC;                                                      // 0x00A8(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	bool                                               bInitialized;                                             // 0x00B0(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x00B1(0x0007) MISSED OFFSET
	class AActor*                                      Owner;                                                    // 0x00B8(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class ASlimCollisionGameplayCueReplicatorSystem*   SlimCollisionReplicator;                                  // 0x00C0(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	bool                                               bOnlyHasServerSideCollisions;                             // 0x00C8(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	bool                                               bTreatAsPhysicsSimulated;                                 // 0x00C9(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData02[0x6];                                       // 0x00CA(0x0006) MISSED OFFSET
};

// ASStruct Angelscript.LoopingEffectsExtraProperties
// 0x0008
struct FLoopingEffectsExtraProperties
{
	bool                                               bStopOnAnyBreak;                                          // 0x0000(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0001(0x0003) MISSED OFFSET
	float                                              DisableRadius;                                            // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
};

// ASStruct Angelscript.RegionData
// 0x0018
struct FRegionData
{
	struct FText                                       RegionName;                                               // 0x0000(0x0018) (Edit, BlueprintVisible)
};

// ASStruct Angelscript.SequenceReferences
// 0x0010
struct FSequenceReferences
{
	class ALevelSequenceActor*                         SequenceActor;                                            // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	double                                             SequenceDuration;                                         // 0x0008(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ASStruct Angelscript.ZiplineSeatState
// 0x0040
struct FZiplineSeatState
{
	struct FVector                                     Location;                                                 // 0x0000(0x0018) (ZeroConstructor, Transient, IsPlainOldData)
	struct FVector                                     Velocity;                                                 // 0x0018(0x0018) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0030(0x0008) MISSED OFFSET
	double                                             AttachTimeStamp;                                          // 0x0038(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
};

// ASStruct Angelscript.ZiplineDeltaMove
// 0x0030
struct FZiplineDeltaMove
{
	struct FVector                                     DeltaMove;                                                // 0x0000(0x0018) (ZeroConstructor, Transient, IsPlainOldData)
	struct FVector                                     Velocity;                                                 // 0x0018(0x0018) (ZeroConstructor, Transient, IsPlainOldData)
};

// ASStruct Angelscript.ZiplineDetachMove
// 0x0020
struct FZiplineDetachMove
{
	struct FVector                                     Velocity;                                                 // 0x0000(0x0018) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0018(0x0008) MISSED OFFSET
};

// ASStruct Angelscript.ZiplinePassengerAttachData
// 0x0008
struct FZiplinePassengerAttachData
{
	int                                                PassengerCable;                                           // 0x0000(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0004(0x0004) MISSED OFFSET
};

// ASStruct Angelscript.ZiplineCableRegistration
// 0x0028
struct FZiplineCableRegistration
{
	int                                                SystemId;                                                 // 0x0000(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0004(0x0004) MISSED OFFSET
	struct FScriptDelegate                             QueueAttachPassengerDelegate;                             // 0x0008(0x0010) (ZeroConstructor, Transient)
	struct FScriptDelegate                             QueueDetachAllPassengersDelegate;                         // 0x0018(0x0010) (ZeroConstructor, Transient)
};

// ASStruct Angelscript.DamageInstance
// 0x0010
struct FDamageInstance
{
	uint16_t                                           Amount;                                                   // 0x0000(0x0002) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x2];                                       // 0x0002(0x0002) MISSED OFFSET
	struct FGameplayTag                                DamageType;                                               // 0x0004(0x0008) (Edit, BlueprintVisible)
	unsigned char                                      UnknownData01[0x4];                                       // 0x000C(0x0004) MISSED OFFSET
};

// ASStruct Angelscript.DamageExecution
// 0x0038
struct FDamageExecution
{
	class UClass*                                      TargetType;                                               // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TArray<struct FDamageInstance>                     DamageInstances;                                          // 0x0008(0x0010) (Edit, BlueprintVisible)
	struct FGameplayTagContainer                       DamageSourceTags;                                         // 0x0018(0x0020) (Edit, BlueprintVisible)
};

// ASStruct Angelscript.DiscoveryDamageTakenData
// 0x0238
struct FDiscoveryDamageTakenData
{
	float                                              TotalRawDamage;                                           // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              TotalDamageDealt;                                         // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              PhysicalDamageDealt;                                      // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              CurrentHealth;                                            // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              PreviousHealth;                                           // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              MaxHealth;                                                // 0x0014(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FVector                                     AttackOrigin;                                             // 0x0018(0x0018) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bHasAttackOrigin;                                         // 0x0030(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0031(0x0007) MISSED OFFSET
	struct FVector                                     ImpactLocation;                                           // 0x0038(0x0018) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FVector                                     ImpactNormal;                                             // 0x0050(0x0018) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FName                                       AffectedBoneName;                                         // 0x0068(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FHitResult                                  Hit;                                                      // 0x0070(0x00E8) (Edit, BlueprintVisible, IsPlainOldData)
	class AActor*                                      Victim;                                                   // 0x0158(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class APlayerState*                                VictimPlayerState;                                        // 0x0160(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FGameplayTagContainer                       TagsAdded;                                                // 0x0168(0x0020) (Edit, BlueprintVisible)
	class UObject*                                     OriginatorObject;                                         // 0x0188(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FInstigator                                 InstigatorData;                                           // 0x0190(0x0048) (Edit, BlueprintVisible)
	struct FGameplayTagContainer                       AdditionalSourceTags;                                     // 0x01D8(0x0020) (Edit, BlueprintVisible)
	struct FDamageExecution                            DamageExecution;                                          // 0x01F8(0x0038) (Transient)
	unsigned char                                      UnknownData01[0x8];                                       // 0x0230(0x0008) MISSED OFFSET
};

// ASStruct Angelscript.ArenaToolkitZiplineAnchorReference
// 0x0070
struct FArenaToolkitZiplineAnchorReference
{
	class AArenaToolkitZiplineAnchor*                  ActorReference;                                           // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0008(0x0008) MISSED OFFSET
	struct FTransform                                  CachedTransform;                                          // 0x0010(0x0060) (Edit, BlueprintVisible, EditConst, IsPlainOldData)
};

// ASStruct Angelscript.ArenaToolkitZiplineExitPoint
// 0x00F0
struct FArenaToolkitZiplineExitPoint
{
	struct FTransform                                  Transform;                                                // 0x0000(0x0060) (Edit, BlueprintVisible, IsPlainOldData)
	double                                             Radius;                                                   // 0x0060(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	double                                             PassengerVelocityToKeep;                                  // 0x0068(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UPrimitiveComponent*                         SupportingComponent;                                      // 0x0070(0x0008) (Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData)
	struct FName                                       SupportingBone;                                           // 0x0078(0x0008) (Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData)
	struct FTransform                                  RelativeTransform;                                        // 0x0080(0x0060) (Edit, BlueprintVisible, EditConst, IsPlainOldData)
	bool                                               bIsWorldExitPoint;                                        // 0x00E0(0x0001) (Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData00[0xF];                                       // 0x00E1(0x000F) MISSED OFFSET
};

// ASStruct Angelscript.ProjectionMeshSettings
// 0x0010
struct FProjectionMeshSettings
{
	class AStaticMeshActor*                            BaseMesh;                                                 // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UMaterialInstance*                           ProjectionShader;                                         // 0x0008(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ASStruct Angelscript.HitTriggerConditions
// 0x0010
struct FHitTriggerConditions
{
	bool                                               bTakeHitTriggers;                                         // 0x0000(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0001(0x0007) MISSED OFFSET
	double                                             HitImpulseMagnitudeLowerLimit;                            // 0x0008(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
};

// ASStruct Angelscript.DamageTriggerConditions
// 0x0018
struct FDamageTriggerConditions
{
	bool                                               bTakeDamageTriggers;                                      // 0x0000(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0001(0x0007) MISSED OFFSET
	double                                             DamageMinimumToTrigger;                                   // 0x0008(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	double                                             HealthPercentageThresholdToTrigger;                       // 0x0010(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
};

// ASStruct Angelscript.BallisticMovementHandle
// 0x0008
struct FBallisticMovementHandle
{
	uint32_t                                           MovestateIndex;                                           // 0x0000(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0004(0x0004) MISSED OFFSET
};

// ASStruct Angelscript.ProjectileFXTrailSystem
// 0x00D0
struct FProjectileFXTrailSystem
{
	class UNiagaraSystem*                              CreatedNiagaraSystem;                                     // 0x0000(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class UNiagaraComponent*                           NiagaraComponent;                                         // 0x0008(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	TArray<bool>                                       ProjectileActiveStates;                                   // 0x0010(0x0010) (Transient)
	TArray<bool>                                       ProjectileShouldSpawnTrail;                               // 0x0020(0x0010) (Transient)
	TArray<struct FBallisticMovementHandle>            ProjectileHandles;                                        // 0x0030(0x0010) (Transient)
	TArray<struct FVector>                             ProjectilePositions;                                      // 0x0040(0x0010) (Transient)
	TArray<bool>                                       ProjectileTryToPlayFlyby;                                 // 0x0050(0x0010) (Transient)
	TArray<double>                                     ProjectileDeathTimeStamps;                                // 0x0060(0x0010) (Transient)
	bool                                               bPendingVisualSpawnActive;                                // 0x0070(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0071(0x0007) MISSED OFFSET
	struct FVector                                     SpawnPosition;                                            // 0x0078(0x0018) (ZeroConstructor, Transient, IsPlainOldData)
	bool                                               bIsActive;                                                // 0x0090(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0091(0x0007) MISSED OFFSET
	double                                             TrailParticleLifeTime;                                    // 0x0098(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	double                                             LastTrailSpawnAttemptTimeStamp;                           // 0x00A0(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	int                                                OnlySpawnProjectileTrailsEveryNBullets;                   // 0x00A8(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	int                                                CurrentSparseTrailSpawnCount;                             // 0x00AC(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	double                                             SparseBulletTrailCooldown;                                // 0x00B0(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class USoundBase*                                  FlybySound;                                               // 0x00B8(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	double                                             FlyBySoundDistanceThreshold;                              // 0x00C0(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	bool                                               bPlayFlyBySound;                                          // 0x00C8(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData02[0x7];                                       // 0x00C9(0x0007) MISSED OFFSET
};

// ASStruct Angelscript.BallisticFXTrailSystemHandle
// 0x0008
struct FBallisticFXTrailSystemHandle
{
	int                                                InstigatorIndex;                                          // 0x0000(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0004(0x0004) MISSED OFFSET
};

// ASStruct Angelscript.BallisticMovementHitResult
// 0x0118
struct FBallisticMovementHitResult
{
	struct FBallisticMovementHandle                    MovementHandle;                                           // 0x0000(0x0008) (Transient)
	struct FHitResult                                  HitResult;                                                // 0x0008(0x00E8) (Transient, IsPlainOldData)
	struct FVector                                     Velocity;                                                 // 0x00F0(0x0018) (ZeroConstructor, Transient, IsPlainOldData)
	double                                             ProjectileRadius;                                         // 0x0108(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	double                                             ProjectileMass;                                           // 0x0110(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
};

// ASStruct Angelscript.BallisticImpactEffectSpawnParams
// 0x0130
struct FBallisticImpactEffectSpawnParams
{
	class UObject*                                     Caller;                                                   // 0x0000(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class UEffectDataAsset*                            ImpactEffect;                                             // 0x0008(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	bool                                               bIsLocalPlayerInstigator;                                 // 0x0010(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0011(0x0007) MISSED OFFSET
	struct FBallisticMovementHitResult                 MovementHit;                                              // 0x0018(0x0118) (Transient)
};

// ASStruct Angelscript.BallisticEffectSystem
// 0x0030
struct FBallisticEffectSystem
{
	TArray<class AActor*>                              RegisteredProjectileTrailOwners;                          // 0x0000(0x0010) (Transient)
	TArray<struct FProjectileFXTrailSystem>            SpawnedTrailSystems;                                      // 0x0010(0x0010) (Transient)
	TArray<struct FBallisticImpactEffectSpawnParams>   PendingImpactEffectSpawns;                                // 0x0020(0x0010) (Transient)
};

// ASStruct Angelscript.BallisticProjectileData
// 0x0090
struct FBallisticProjectileData
{
	struct FInstigator                                 InstigatorData;                                           // 0x0000(0x0048) (Transient)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0048(0x0008) MISSED OFFSET
	class UHitScanProjectilePropertiesDataAsset*       ProjectileProperties;                                     // 0x0050(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	struct FVector                                     InitialOrigin;                                            // 0x0058(0x0018) (ZeroConstructor, Transient, IsPlainOldData)
	struct FVector                                     InitialDirection;                                         // 0x0070(0x0018) (ZeroConstructor, Transient, IsPlainOldData)
	bool                                               bClaimed;                                                 // 0x0088(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0089(0x0007) MISSED OFFSET
};

// ASStruct Angelscript.BallisticFXHandle
// 0x0010
struct FBallisticFXHandle
{
	struct FBallisticFXTrailSystemHandle               TrailSystemHandle;                                        // 0x0000(0x0008) (Transient)
	uint32_t                                           ProjectileId;                                             // 0x0008(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x000C(0x0004) MISSED OFFSET
};

// ASStruct Angelscript.BallisticProjectile
// 0x00A8
struct FBallisticProjectile
{
	struct FBallisticMovementHandle                    MovementHandle;                                           // 0x0000(0x0008) (Transient)
	struct FBallisticProjectileData                    ProjectileData;                                           // 0x0008(0x0090) (Transient)
	struct FBallisticFXHandle                          FXHandle_Client;                                          // 0x0098(0x0010) (Transient)
};

// ASStruct Angelscript.BallisticProjectileHandle
// 0x0008
struct FBallisticProjectileHandle
{
	uint16_t                                           LocalSystemID;                                            // 0x0000(0x0002) (ZeroConstructor, Transient, IsPlainOldData)
	uint16_t                                           HandleID;                                                 // 0x0002(0x0002) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0004(0x0004) MISSED OFFSET
};

// ASStruct Angelscript.QuantizedDirectionInt8
// 0x0018
struct FQuantizedDirectionInt8
{
	int8_t                                             Pitch;                                                    // 0x0000(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	int8_t                                             Yaw;                                                      // 0x0001(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x6];                                       // 0x0002(0x0006) MISSED OFFSET
	double                                             MinRange;                                                 // 0x0008(0x0008) (Edit, ZeroConstructor, IsPlainOldData, RepSkip, RepNotify, Interp, NonTransactional, EditorOnly, NoDestructor, AutoWeak, ContainsInstancedReference, AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, Protected, BlueprintCallable, BlueprintAuthorityOnly, TextExportTransient, NonPIEDuplicateTransient, ExposeOnSpawn, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected, NativeAccessSpecifierPrivate)
	double                                             MaxRange;                                                 // 0x0010(0x0008) (Edit, ZeroConstructor, IsPlainOldData, RepSkip, RepNotify, Interp, NonTransactional, EditorOnly, NoDestructor, AutoWeak, ContainsInstancedReference, AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, Protected, BlueprintCallable, BlueprintAuthorityOnly, TextExportTransient, NonPIEDuplicateTransient, ExposeOnSpawn, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected, NativeAccessSpecifierPrivate)
};

// ASStruct Angelscript.BallisticHitResult
// 0x0080
struct FBallisticHitResult
{
	class AActor*                                      HitActor;                                                 // 0x0000(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class UPrimitiveComponent*                         HitComponent;                                             // 0x0008(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	int16_t                                            BoneIndex;                                                // 0x0010(0x0002) (ZeroConstructor, Transient, IsPlainOldData)
	uint16_t                                           ClientHandleID;                                           // 0x0012(0x0002) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0014(0x0004) MISSED OFFSET
	struct FVector_NetQuantize                         ClientHitActorLocation;                                   // 0x0018(0x0018) (Transient)
	struct FVector_NetQuantize                         ClientHitActor_PelvisLocation;                            // 0x0030(0x0018) (Transient)
	struct FVector_NetQuantize                         ImpactPoint;                                              // 0x0048(0x0018) (Transient)
	struct FQuantizedDirectionInt8                     ImpactNormal;                                             // 0x0060(0x0018) (Transient)
	bool                                               bClientHitActorCrouching;                                 // 0x0078(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	bool                                               bBlockingHit;                                             // 0x0079(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData01[0x6];                                       // 0x007A(0x0006) MISSED OFFSET
};

// ASStruct Angelscript.BallisticHitResultsParam
// 0x0010
struct FBallisticHitResultsParam
{
	TArray<struct FBallisticHitResult>                 BallisticHitResults;                                      // 0x0000(0x0010) (Transient)
};

// ASStruct Angelscript.BallisticClientProxySpawnRequest
// 0x0040
struct FBallisticClientProxySpawnRequest
{
	class AActor*                                      Instigator;                                               // 0x0000(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class AActor*                                      Causer;                                                   // 0x0008(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class UHitScanProjectilePropertiesDataAsset*       ProjectileProperties;                                     // 0x0010(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	struct FVector_NetQuantize                         Origin;                                                   // 0x0018(0x0018) (Transient)
	TArray<struct FVector_NetQuantizeNormal>           Directions;                                               // 0x0030(0x0010) (Transient)
};

// ASStruct Angelscript.BallisticClientProxySpawnRequestParams
// 0x0010
struct FBallisticClientProxySpawnRequestParams
{
	TArray<struct FBallisticClientProxySpawnRequest>   SpawnRequests;                                            // 0x0000(0x0010) (Transient)
};

// ASStruct Angelscript.BallisticOriginAndDirections
// 0x0028
struct FBallisticOriginAndDirections
{
	struct FVector                                     Origin;                                                   // 0x0000(0x0018) (ZeroConstructor, Transient, IsPlainOldData)
	TArray<struct FVector>                             Directions;                                               // 0x0018(0x0010) (Transient)
};

// ASStruct Angelscript.BallisticSpawnRequestParams
// 0x0090
struct FBallisticSpawnRequestParams
{
	unsigned char                                      UnknownData00[0x8];                                       // 0x0000(0x0008) MISSED OFFSET
	struct FInstigator                                 InstigatorData;                                           // 0x0008(0x0048) (Transient)
	TArray<uint16_t>                                   HandleIDsToUse;                                           // 0x0050(0x0010) (Transient)
	class UHitScanProjectilePropertiesDataAsset*       ProjectileProperties;                                     // 0x0060(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	struct FBallisticOriginAndDirections               OriginAndDirections;                                      // 0x0068(0x0028) (Transient)
};

// ASStruct Angelscript.BallisticQueuedClientHit
// 0x0018
struct FBallisticQueuedClientHit
{
	struct FBallisticHitResultsParam                   HitParams;                                                // 0x0000(0x0010) (Transient)
	class AActor*                                      InstigatingActor;                                         // 0x0010(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
};

// ASStruct Angelscript.BallisticServerHitResult
// 0x0178
struct FBallisticServerHitResult
{
	struct FHitResult                                  HitResult;                                                // 0x0000(0x00E8) (Transient, IsPlainOldData)
	struct FBallisticProjectileData                    ProjectileData;                                           // 0x00E8(0x0090) (Transient)
};

// ASStruct Angelscript.ArchetypeValidationData
// 0x0010
struct FArchetypeValidationData
{
	class UClass*                                      Standing;                                                 // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UClass*                                      Crouching;                                                // 0x0008(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ASStruct Angelscript.ArchetypeValidationActor
// 0x0010
struct FArchetypeValidationActor
{
	unsigned char                                      UnknownData00[0x1];                                       // 0x0000(0x0001) MISSED OFFSET
	bool                                               bCrouching;                                               // 0x0001(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData01[0x6];                                       // 0x0002(0x0006) MISSED OFFSET
	class AActor*                                      ValidationActor;                                          // 0x0008(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
};

// ASStruct Angelscript.PracticeDummyTargetData
// 0x0020
struct FPracticeDummyTargetData
{
	class ACharacter*                                  TargetCharacter;                                          // 0x0000(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	struct FVector                                     TargetOffset;                                             // 0x0008(0x0018) (ZeroConstructor, Transient, IsPlainOldData)
};

// ASStruct Angelscript.CharacterCustomization
// 0x0020
struct FCharacterCustomization
{
	class UCharacterArchetypeDataAsset*                Archetype;                                                // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBodyType*                                   BodyType;                                                 // 0x0008(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TArray<class UCharacterCustomizationItem*>         Items;                                                    // 0x0010(0x0010) (Edit, BlueprintVisible)
};

// ASStruct Angelscript.DebugDamageEvent
// 0x0010
struct FDebugDamageEvent
{
	double                                             Damage;                                                   // 0x0000(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	double                                             Timestamp;                                                // 0x0008(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
};

// ASStruct Angelscript.AudienceAudio
// 0x0018
struct FAudienceAudio
{
	class USoundBase*                                  PositiveSound;                                            // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class USoundBase*                                  NegativeSound;                                            // 0x0008(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class USoundBase*                                  NeutralSound;                                             // 0x0010(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ASStruct Angelscript.AudienceReaction
// 0x0030
struct FAudienceReaction
{
	unsigned char                                      UnknownData00[0x8];                                       // 0x0000(0x0008) MISSED OFFSET
	TArray<int>                                        PositiveReactionForSquads;                                // 0x0008(0x0010) (Transient)
	TArray<int>                                        NegativeReactionForSquads;                                // 0x0018(0x0010) (Transient)
	bool                                               bAllowNeutralReaction;                                    // 0x0028(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0029(0x0007) MISSED OFFSET
};

// ASStruct Angelscript.IRSettings
// 0x0018
struct FIRSettings
{
	class UAudioImpulseResponse*                       IR;                                                       // 0x0000(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	float                                              Amp;                                                      // 0x0008(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x000C(0x0004) MISSED OFFSET
	class UObject*                                     RequestedBy;                                              // 0x0010(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
};

// ASStruct Angelscript.ConvolutionSetting
// 0x0030
struct FConvolutionSetting
{
	class USubmixEffectConvolutionReverbPreset*        ConvolutionReverb;                                        // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class USoundSubmix*                                ConvolutionReverbSubmix;                                  // 0x0008(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FIRSettings                                 IRSettings;                                               // 0x0010(0x0018) (Transient)
	float                                              AmpInterpolated;                                          // 0x0028(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	bool                                               bInUse;                                                   // 0x002C(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x002D(0x0003) MISSED OFFSET
};

// ASStruct Angelscript.RayInfo
// 0x0128
struct FRayInfo
{
	int                                                RayWeight;                                                // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              RayLength;                                                // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FVector                                     Direction;                                                // 0x0008(0x0018) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bShouldDoSlapBack;                                        // 0x0020(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bShouldDoAdditionalGroundBounce;                          // 0x0021(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x2];                                       // 0x0022(0x0002) MISSED OFFSET
	float                                              MaterialReflectivity;                                     // 0x0024(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	struct FVector                                     DirectionScaled;                                          // 0x0028(0x0018) (ZeroConstructor, Transient, IsPlainOldData)
	struct FHitResult                                  RayHitResult;                                             // 0x0040(0x00E8) (Transient, IsPlainOldData)
};

// ASStruct Angelscript.Sound2DSetting
// 0x0048
struct FSound2DSetting
{
	class USoundBase*                                  Sound;                                                    // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	double                                             Volume;                                                   // 0x0008(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	double                                             FadeInTime;                                               // 0x0010(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	double                                             FadeOutTime;                                              // 0x0018(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bRandomOffset;                                            // 0x0020(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0021(0x0007) MISSED OFFSET
	double                                             StartTime;                                                // 0x0028(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bEnableLPF;                                               // 0x0030(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0031(0x0007) MISSED OFFSET
	double                                             LPF;                                                      // 0x0038(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UAudioComponent*                             SpawnedSound;                                             // 0x0040(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
};

// ASStruct Angelscript.Sound2DCollection
// 0x0090
struct FSound2DCollection
{
	struct FName                                       UserName;                                                 // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FGameplayTagQuery                           TagQuery;                                                 // 0x0008(0x0048) (Edit, BlueprintVisible)
	TArray<struct FSound2DSetting>                     SoundCollection;                                          // 0x0050(0x0010) (Edit, BlueprintVisible)
	struct FGameplayTag                                ScreenMusicEvent;                                         // 0x0060(0x0008) (Edit, BlueprintVisible)
	bool                                               bRemoveMusicEventOnExit;                                  // 0x0068(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0069(0x0007) MISSED OFFSET
	TArray<struct FGameplayTag>                        MusicEventsToRemoveOnEnter;                               // 0x0070(0x0010) (Edit, BlueprintVisible)
	class USoundMix*                                   Mixer;                                                    // 0x0080(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bMixerActive;                                             // 0x0088(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0089(0x0007) MISSED OFFSET
};

// ASStruct Angelscript.DiscoveryMatchStateMusicConfigurationEntry
// 0x0018
struct FDiscoveryMatchStateMusicConfigurationEntry
{
	struct FGameplayTag                                MusicEventTag;                                            // 0x0000(0x0008) (Edit, BlueprintVisible)
	struct FGameplayTag                                ActivateSoundMixTag;                                      // 0x0008(0x0008) (Edit, BlueprintVisible)
	struct FGameplayTag                                ClearSoundMixTag;                                         // 0x0010(0x0008) (Edit, BlueprintVisible)
};

// ASStruct Angelscript.MusicEventSetting
// 0x0080
struct FMusicEventSetting
{
	bool                                               bDisabled;                                                // 0x0000(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0001(0x0003) MISSED OFFSET
	struct FGameplayTag                                MusicEventTag;                                            // 0x0004(0x0008) (Edit, BlueprintVisible)
	unsigned char                                      UnknownData01[0x4];                                       // 0x000C(0x0004) MISSED OFFSET
	class USoundWaveCollection*                        SoundCollection;                                          // 0x0010(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bIsSWCLoopingPlaylist;                                    // 0x0018(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bUseNetworkedRandomStartIndex;                            // 0x0019(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x6];                                       // 0x001A(0x0006) MISSED OFFSET
	class USoundBase*                                  Sound;                                                    // 0x0020(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class USoundClass*                                 OverrideSoundClass;                                       // 0x0028(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	double                                             FadeOutTime;                                              // 0x0030(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData03[0x8];                                       // 0x0038(0x0008) MISSED OFFSET
	double                                             FadeInTime;                                               // 0x0040(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData04[0x8];                                       // 0x0048(0x0008) MISSED OFFSET
	double                                             Delay;                                                    // 0x0050(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bKeepActive;                                              // 0x0058(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bKeepUntilFullDurationPlayed;                             // 0x0059(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bSetLoadingMix;                                           // 0x005A(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bWantedLoadingMixState;                                   // 0x005B(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData05[0x4];                                       // 0x005C(0x0004) MISSED OFFSET
	double                                             VolumeMultiplier;                                         // 0x0060(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TArray<enum class EMusicParameter>                 Parameters;                                               // 0x0068(0x0010) (Edit, BlueprintVisible)
	class USoundMix*                                   Mix;                                                      // 0x0078(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ASStruct Angelscript.ConditionalDialogueSoundSettings
// 0x0078
struct FConditionalDialogueSoundSettings
{
	struct FGameplayTagQuery                           TagQuery;                                                 // 0x0000(0x0048) (Edit, BlueprintVisible)
	bool                                               bUseDistanceQuery;                                        // 0x0048(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0049(0x0007) MISSED OFFSET
	double                                             MinDistance;                                              // 0x0050(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	double                                             MaxDistance;                                              // 0x0058(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UMetaSoundSource*                            Sound;                                                    // 0x0060(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class USoundAttenuation*                           AttenuationOverride;                                      // 0x0068(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	double                                             VolumeMultiplier;                                         // 0x0070(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ASStruct Angelscript.PingInformation
// 0x00B8
struct FPingInformation
{
	unsigned char                                      UnknownData00[0x8];                                       // 0x0000(0x0008) MISSED OFFSET
	struct FText                                       PingDescription;                                          // 0x0008(0x0018) (Edit, BlueprintVisible)
	struct FText                                       Text;                                                     // 0x0020(0x0018) (Edit, BlueprintVisible)
	struct FText                                       ExtraText;                                                // 0x0038(0x0018) (Edit, BlueprintVisible)
	unsigned char                                      UnknownData01[0x28];                                      // 0x0050(0x0028) UNKNOWN PROPERTY: PingIcon
	unsigned char                                      UnknownData02[0x4];                                       // 0x0078(0x0004) MISSED OFFSET
	struct FGameplayTag                                ObjectTag;                                                // 0x007C(0x0008) (Edit, BlueprintVisible)
	struct FGameplayTag                                DialogueTag;                                              // 0x0084(0x0008) (Edit, BlueprintVisible)
	unsigned char                                      UnknownData03[0x4];                                       // 0x008C(0x0004) MISSED OFFSET
	struct FGameplayTagContainer                       DisplayTags;                                              // 0x0090(0x0020) (Edit, BlueprintVisible)
	unsigned char                                      UnknownData04[0x1];                                       // 0x00B0(0x0001) MISSED OFFSET
	bool                                               bAlwaysDisplayOffscreenIcon;                              // 0x00B1(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bPresentOffscreenIcon;                                    // 0x00B2(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData05[0x5];                                       // 0x00B3(0x0005) MISSED OFFSET
};

// ASStruct Angelscript.Ping
// 0x0160
struct FPing
{
	int                                                PingId;                                                   // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0004(0x0004) MISSED OFFSET
	struct FString                                     PingerName;                                               // 0x0008(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	unsigned char                                      UnknownData01[0x8];                                       // 0x0018(0x0008) MISSED OFFSET
	struct FVector                                     PingPosition;                                             // 0x0020(0x0018) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FVector                                     PingNormal;                                               // 0x0038(0x0018) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                PingCreatorId;                                            // 0x0050(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x4];                                       // 0x0054(0x0004) MISSED OFFSET
	class AEmbarkSquad*                                PingCreatorSquad;                                         // 0x0058(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FPingInformation                            PingInformation;                                          // 0x0060(0x00B8) (Edit, BlueprintVisible)
	struct FComponentOrStyle                           AttachedToComponentOrStyle;                               // 0x0118(0x0018) (Edit, BlueprintVisible)
	class APawn*                                       PingerPawn;                                               // 0x0130(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bRequireLocalVisibilityForAttach;                         // 0x0138(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bSelected;                                                // 0x0139(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	bool                                               bAllowPingingDestroyedTarget;                             // 0x013A(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	bool                                               bIsReply;                                                 // 0x013B(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData03[0x4];                                       // 0x013C(0x0004) MISSED OFFSET
	struct FGameplayTagContainer                       PingTags;                                                 // 0x0140(0x0020) (Edit)
};

// ASStruct Angelscript.DamageTypeSoundInfo
// 0x0030
struct FDamageTypeSoundInfo
{
	class USoundBase*                                  LocalPlayerDamageSound;                                   // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class USoundBase*                                  NonLocalPlayerDamageSound;                                // 0x0008(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FGameplayTag                                VocalizationTag;                                          // 0x0010(0x0008) (Edit, BlueprintVisible)
	double                                             VocalizationDelayTime;                                    // 0x0018(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FGameplayTag                                SpawnedSoundTag;                                          // 0x0020(0x0008) (Transient)
	double                                             TimeToStop;                                               // 0x0028(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
};

// ASStruct Angelscript.DiscoveryAutobotRespawnSettings
// 0x0008
struct FDiscoveryAutobotRespawnSettings
{
	bool                                               bKeepLoadout;                                             // 0x0000(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0001(0x0007) MISSED OFFSET
};

// ASStruct Angelscript.AutobotTarget
// 0x0058
struct FAutobotTarget
{
	class AActor*                                      Actor;                                                    // 0x0000(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	TMap<enum class EStimulusSense, struct FAIStimulusInfo> StimuliInfoMap;                                           // 0x0008(0x0050) (Transient)
};

// ASStruct Angelscript.AutobotUtilityResponseCurve
// 0x0028
struct FAutobotUtilityResponseCurve
{
	unsigned char                                      UnknownData00[0x8];                                       // 0x0000(0x0008) MISSED OFFSET
	double                                             M;                                                        // 0x0008(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	double                                             K;                                                        // 0x0010(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	double                                             B;                                                        // 0x0018(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	double                                             C;                                                        // 0x0020(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ASStruct Angelscript.AutobotUtilityAxis
// 0x0038
struct FAutobotUtilityAxis
{
	class UAutobotUtilityAxisInput*                    Input;                                                    // 0x0000(0x0008) (Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	struct FAutobotUtilityResponseCurve                Curve;                                                    // 0x0008(0x0028) (Edit, BlueprintVisible)
	struct FName                                       AxisName;                                                 // 0x0030(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ASStruct Angelscript.OnAmmoChangedData
// 0x0020
struct FOnAmmoChangedData
{
	unsigned char                                      UnknownData00[0x4];                                       // 0x0000(0x0004) MISSED OFFSET
	int                                                AmmoInClip;                                               // 0x0004(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	int                                                AmmoInReserve;                                            // 0x0008(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	int                                                MaxAmmoInClip;                                            // 0x000C(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	int                                                MaxAmmoInReserve;                                         // 0x0010(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x0014(0x0004) MISSED OFFSET
	double                                             LowAmmoThreshold;                                         // 0x0018(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
};

// ASStruct Angelscript.AutobotAIComponentCharacterPair
// 0x0010
struct FAutobotAIComponentCharacterPair
{
	class UAutobotAIComponent*                         AIComponent_Server;                                       // 0x0000(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class AEmbarkCharacterBase*                        Character;                                                // 0x0008(0x0008) (BlueprintVisible, Net, ZeroConstructor, IsPlainOldData)
};

// ASStruct Angelscript.MovementFrame
// 0x0020
struct FMovementFrame
{
	struct FVector                                     Input;                                                    // 0x0000(0x0018) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                FrameIndex;                                               // 0x0018(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x001C(0x0004) MISSED OFFSET
};

// ASStruct Angelscript.RotationFrame
// 0x0020
struct FRotationFrame
{
	struct FRotator                                    Rotation;                                                 // 0x0000(0x0018) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                FrameIndex;                                               // 0x0018(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x001C(0x0004) MISSED OFFSET
};

// ASStruct Angelscript.ActionFrame
// 0x0028
struct FActionFrame
{
	TArray<struct FName>                               ActivatedActions;                                         // 0x0000(0x0010) (Edit, BlueprintVisible)
	TArray<struct FName>                               EndedActions;                                             // 0x0010(0x0010) (Edit, BlueprintVisible)
	int                                                FrameIndex;                                               // 0x0020(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0024(0x0004) MISSED OFFSET
};

// ASStruct Angelscript.PlayerRecording
// 0x0080
struct FPlayerRecording
{
	struct FString                                     Name;                                                     // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<struct FMovementFrame>                      MovementFrames;                                           // 0x0010(0x0010) (Edit, BlueprintVisible)
	TArray<struct FRotationFrame>                      RotationFrames;                                           // 0x0020(0x0010) (Edit, BlueprintVisible)
	TArray<struct FActionFrame>                        ActionFrames;                                             // 0x0030(0x0010) (Edit, BlueprintVisible)
	struct FVector                                     StartingLocation;                                         // 0x0040(0x0018) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FRotator                                    StartingRotation;                                         // 0x0058(0x0018) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	double                                             TickRate;                                                 // 0x0070(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                FrameCount;                                               // 0x0078(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x007C(0x0004) MISSED OFFSET
};

// ASStruct Angelscript.PlayerRecordingPlaybackData
// 0x0088
struct FPlayerRecordingPlaybackData
{
	struct FPlayerRecording                            Recording;                                                // 0x0000(0x0080) (Transient)
	bool                                               bPlaybackMovement;                                        // 0x0080(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	bool                                               bPlaybackRotations;                                       // 0x0081(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	bool                                               bPlaybackActions;                                         // 0x0082(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	bool                                               bUseStartLocation;                                        // 0x0083(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	bool                                               bUseStartRotation;                                        // 0x0084(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0085(0x0003) MISSED OFFSET
};

// ASStruct Angelscript.PendingPlayer
// 0x0058
struct FPendingPlayer
{
	class AController*                                 Controller;                                               // 0x0000(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	struct FUniqueNetIdRepl                            NetId;                                                    // 0x0008(0x0030) (Transient)
	int                                                StepIndex;                                                // 0x0038(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x003C(0x0004) MISSED OFFSET
	class UPlayerInitStep*                             CurrentStep;                                              // 0x0040(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData01[0x8];                                       // 0x0048(0x0008) MISSED OFFSET
	double                                             ConnectedAtTimestamp;                                     // 0x0050(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
};

// ASStruct Angelscript.ItemDataAssetSlotPair
// 0x0010
struct FItemDataAssetSlotPair
{
	class UDiscoveryItemDataAsset*                     ItemDataAsset;                                            // 0x0000(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0008(0x0008) MISSED OFFSET
};

// ASStruct Angelscript.CameraBoomState
// 0x0018
struct FCameraBoomState
{
	double                                             ArmLength;                                                // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	double                                             RightSideOffset;                                          // 0x0008(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	double                                             HeightOffset;                                             // 0x0010(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ASStruct Angelscript.CameraFovState
// 0x00D8
struct FCameraFovState
{
	struct FGameplayTag                                State;                                                    // 0x0000(0x0008) (Edit, BlueprintVisible)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0008(0x0004) MISSED OFFSET
	int                                                Priority;                                                 // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	double                                             CameraFovValue;                                           // 0x0010(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x8];                                       // 0x0018(0x0008) MISSED OFFSET
	double                                             FirstPersonMeshesFovValue;                                // 0x0020(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x8];                                       // 0x0028(0x0008) MISSED OFFSET
	double                                             TransitionTime;                                           // 0x0030(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FRuntimeFloatCurve                          TransitionCurve;                                          // 0x0038(0x0088) (Edit, BlueprintVisible)
	struct FCameraBoomState                            ThirdPersonCameraBoomSettings;                            // 0x00C0(0x0018) (Edit, BlueprintVisible)
};

// ASStruct Angelscript.ReloadZoomState
// 0x00A0
struct FReloadZoomState
{
	double                                             CameraFovAdditive;                                        // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	double                                             FirstPersonMeshesFovAdditive;                             // 0x0008(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	double                                             TransitionTime;                                           // 0x0010(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FRuntimeFloatCurve                          TransitionCurve;                                          // 0x0018(0x0088) (Edit, BlueprintVisible)
};

// ASStruct Angelscript.FixedCullFovSettings
// 0x0010
struct FFixedCullFovSettings
{
	double                                             UpperBoundsFovAdditive;                                   // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	double                                             LowerBoundsFovMultiplier;                                 // 0x0008(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ASStruct Angelscript.CameraFovZoomSetting
// 0x0010
struct FCameraFovZoomSetting
{
	unsigned char                                      UnknownData00[0x8];                                       // 0x0000(0x0008) MISSED OFFSET
	double                                             Value;                                                    // 0x0008(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ASStruct Angelscript.CameraState
// 0x0028
struct FCameraState
{
	double                                             CameraFOV;                                                // 0x0000(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	double                                             FirstPersonMeshesFov;                                     // 0x0008(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	struct FCameraBoomState                            ThirdPersonCameraBoomState;                               // 0x0010(0x0018) (Transient)
};

// ASStruct Angelscript.CameraFovConfigData
// 0x0018
struct FCameraFovConfigData
{
	struct FGameplayTag                                ZoomingTag;                                               // 0x0000(0x0008) (Transient)
	double                                             FirstPersonMeshesFov;                                     // 0x0008(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	double                                             FirstPersonMeshesZoomedFOV;                               // 0x0010(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
};

// ASStruct Angelscript.AimAssistCapsule
// 0x0010
struct FAimAssistCapsule
{
	double                                             Radius;                                                   // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	double                                             HalfHeight;                                               // 0x0008(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ASStruct Angelscript.AimAssistSphere
// 0x0020
struct FAimAssistSphere
{
	double                                             Radius;                                                   // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FVector                                     Offset;                                                   // 0x0008(0x0018) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ASStruct Angelscript.AimAssistArchetypeCapsuleDefinition
// 0x0060
struct FAimAssistArchetypeCapsuleDefinition
{
	struct FAimAssistCapsule                           LightStandingCapsule;                                     // 0x0000(0x0010) (Edit, BlueprintVisible)
	struct FAimAssistCapsule                           LightCrouchingCapsule;                                    // 0x0010(0x0010) (Edit, BlueprintVisible)
	struct FAimAssistCapsule                           MediumStandingCapsule;                                    // 0x0020(0x0010) (Edit, BlueprintVisible)
	struct FAimAssistCapsule                           MediumCrouchingCapsule;                                   // 0x0030(0x0010) (Edit, BlueprintVisible)
	struct FAimAssistCapsule                           HeavyStandingCapsule;                                     // 0x0040(0x0010) (Edit, BlueprintVisible)
	struct FAimAssistCapsule                           HeavyCrouchingCapsule;                                    // 0x0050(0x0010) (Edit, BlueprintVisible)
};

// ASStruct Angelscript.AimAssistCapsuleDefinitions
// 0x0120
struct FAimAssistCapsuleDefinitions
{
	struct FAimAssistArchetypeCapsuleDefinition        SensitivityReductionCapsuleDefinitions;                   // 0x0000(0x0060) (Edit, BlueprintVisible)
	struct FAimAssistArchetypeCapsuleDefinition        CameraMagnetismCapsuleDefinitions;                        // 0x0060(0x0060) (Edit, BlueprintVisible)
	struct FAimAssistArchetypeCapsuleDefinition        ZoomSnappingCapsuleDefinitions;                           // 0x00C0(0x0060) (Edit, BlueprintVisible)
};

// ASStruct Angelscript.AimAssistSensitivityReductionConfig
// 0x00F0
struct FAimAssistSensitivityReductionConfig
{
	bool                                               bEnable;                                                  // 0x0000(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0001(0x0007) MISSED OFFSET
	struct FAimAssistArchetypeCapsuleDefinition        SensitivityReductionCapsuleDefinitions;                   // 0x0008(0x0060) (Edit, BlueprintVisible)
	struct FRuntimeFloatCurve                          SensitivityReductionCurve;                                // 0x0068(0x0088) (Edit, BlueprintVisible)
};

// ASStruct Angelscript.AimAssistCameraMagnetismConfig
// 0x0150
struct FAimAssistCameraMagnetismConfig
{
	bool                                               bEnable;                                                  // 0x0000(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0001(0x0007) MISSED OFFSET
	struct FAimAssistArchetypeCapsuleDefinition        AcqusitionCapsuleDefinitions;                             // 0x0008(0x0060) (Edit, BlueprintVisible)
	struct FAimAssistArchetypeCapsuleDefinition        AcqusitionLostCapsuleDefinitions;                         // 0x0068(0x0060) (Edit, BlueprintVisible)
	struct FAimAssistArchetypeCapsuleDefinition        MagnetismCapsuleDefinition;                               // 0x00C8(0x0060) (Edit, BlueprintVisible)
	double                                             TargetAcqusitionRange;                                    // 0x0128(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	double                                             MagnestismRatio;                                          // 0x0130(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	double                                             EquallyCenteredAcceptanceRange;                           // 0x0138(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	double                                             SimulatedReactionTime;                                    // 0x0140(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	double                                             MaxControlRotationPull;                                   // 0x0148(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ASStruct Angelscript.AimAssistZoomSnappingConfig
// 0x01C0
struct FAimAssistZoomSnappingConfig
{
	bool                                               bEnable;                                                  // 0x0000(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0001(0x0007) MISSED OFFSET
	struct FAimAssistArchetypeCapsuleDefinition        ZoomSnappingAcquisitionCapsuleDefinitions;                // 0x0008(0x0060) (Edit, BlueprintVisible)
	struct FAimAssistArchetypeCapsuleDefinition        TorsoCapsuleDefinition;                                   // 0x0068(0x0060) (Edit, BlueprintVisible)
	bool                                               bEnableHeadSnapping;                                      // 0x00C8(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x00C9(0x0007) MISSED OFFSET
	struct FAimAssistArchetypeCapsuleDefinition        HeadCapsuleDefinition;                                    // 0x00D0(0x0060) (Edit, BlueprintVisible)
	struct FTransform                                  HeadCapsuleOffsetTransform;                               // 0x0130(0x0060) (Edit, BlueprintVisible, IsPlainOldData)
	double                                             SnappingRange;                                            // 0x0190(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	double                                             InterpolationSpeed;                                       // 0x0198(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	double                                             Duration;                                                 // 0x01A0(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	double                                             Cooldown;                                                 // 0x01A8(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x8];                                       // 0x01B0(0x0008) MISSED OFFSET
	double                                             MaxControlRotationPull;                                   // 0x01B8(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ASStruct Angelscript.AimAssistCategoryConfig
// 0x0410
struct FAimAssistCategoryConfig
{
	struct FGameplayTag                                CategoryTag;                                              // 0x0000(0x0008) (Edit, BlueprintVisible)
	struct FAimAssistSensitivityReductionConfig        SensitivityReductionConfig;                               // 0x0008(0x00F0) (Edit, BlueprintVisible)
	struct FAimAssistCameraMagnetismConfig             CameraMagnetismConfig;                                    // 0x00F8(0x0150) (Edit, BlueprintVisible)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0248(0x0008) MISSED OFFSET
	struct FAimAssistZoomSnappingConfig                ZoomSnappingConfig;                                       // 0x0250(0x01C0) (Edit, BlueprintVisible)
};

// ASStruct Angelscript.BoneMultiplier
// 0x00A0
struct FBoneMultiplier
{
	TMap<struct FName, double>                         BoneMultiplier;                                           // 0x0000(0x0050) (Edit, BlueprintVisible)
	TMap<struct FName, double>                         AllBoneMultipliers;                                       // 0x0050(0x0050) (Transient)
};

// ASStruct Angelscript.AnimatedItemAssemblyTransforms
// 0x0300
struct FAnimatedItemAssemblyTransforms
{
	struct FTransform                                  MagTransform;                                             // 0x0000(0x0060) (Edit, BlueprintVisible, EditConst, IsPlainOldData)
	struct FTransform                                  Belt01Transform;                                          // 0x0060(0x0060) (Edit, BlueprintVisible, EditConst, IsPlainOldData)
	struct FTransform                                  Belt02Transform;                                          // 0x00C0(0x0060) (Edit, BlueprintVisible, EditConst, IsPlainOldData)
	struct FTransform                                  Belt03Transform;                                          // 0x0120(0x0060) (Edit, BlueprintVisible, EditConst, IsPlainOldData)
	struct FTransform                                  Belt04Transform;                                          // 0x0180(0x0060) (Edit, BlueprintVisible, EditConst, IsPlainOldData)
	struct FTransform                                  Belt05Transform;                                          // 0x01E0(0x0060) (Edit, BlueprintVisible, EditConst, IsPlainOldData)
	struct FTransform                                  Belt06Transform;                                          // 0x0240(0x0060) (Edit, BlueprintVisible, EditConst, IsPlainOldData)
	struct FTransform                                  DynamicReachOffsetToMag;                                  // 0x02A0(0x0060) (Edit, BlueprintVisible, EditConst, IsPlainOldData)
};

// ASStruct Angelscript.WeaponSwaySettings
// 0x0030
struct FWeaponSwaySettings
{
	struct FVector                                     PositionMultiplier;                                       // 0x0000(0x0018) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FVector                                     RotationMultiplier;                                       // 0x0018(0x0018) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ASStruct Angelscript.AnimatedItemInfo
// 0x0660
struct FAnimatedItemInfo
{
	struct FAnimatedItemAssemblyTransforms             AssemblyTransforms;                                       // 0x0000(0x0300) (Edit, BlueprintVisible)
	struct FVector                                     WeaponLocationOffset;                                     // 0x0300(0x0018) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FVector                                     WeaponLocationZoomOffset;                                 // 0x0318(0x0018) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FVector                                     WeaponSprintLocationOffset;                               // 0x0330(0x0018) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FVector                                     WeaponRotationOffset;                                     // 0x0348(0x0018) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FVector                                     WeaponRotationZoomOffset;                                 // 0x0360(0x0018) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FVector                                     WeaponSprintRotationOffset;                               // 0x0378(0x0018) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	double                                             FirstPersonMeshesFov;                                     // 0x0390(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	double                                             FirstPersonMeshesZoomFov;                                 // 0x0398(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	double                                             TacticalReloadPlaybackScale;                              // 0x03A0(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	double                                             EmptyReloadPlaybackScale;                                 // 0x03A8(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	double                                             WeaponLeanWeight;                                         // 0x03B0(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	double                                             WeaponADSLeanWeight;                                      // 0x03B8(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	double                                             WeaponSprintLeanWeight;                                   // 0x03C0(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	double                                             SprintCadenceModifierHeavy;                               // 0x03C8(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	double                                             SprintCadenceModifierMedium;                              // 0x03D0(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	double                                             SprintCadenceModifierSmall;                               // 0x03D8(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bShouldLowerWhenCloseToWall;                              // 0x03E0(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x03E1(0x0007) MISSED OFFSET
	struct FWeaponLagSettings                          WeaponLagSettings;                                        // 0x03E8(0x00F8) (Edit, BlueprintVisible)
	struct FWeaponSwaySettings                         WeaponSwaySettings;                                       // 0x04E0(0x0030) (Edit, BlueprintVisible)
	struct FWeaponSwaySettings                         WeaponFiringSwaySettings;                                 // 0x0510(0x0030) (Edit, BlueprintVisible)
	struct FWeaponLeanSettings                         WeaponLeanSettingsDefault;                                // 0x0540(0x0090) (Edit, BlueprintVisible)
	struct FWeaponLeanSettings                         WeaponLeanSettingsZoom;                                   // 0x05D0(0x0090) (Edit, BlueprintVisible)
};

// ASStruct Angelscript.SquadColor
// 0x0040
struct FSquadColor
{
	struct FLinearColor                                Default;                                                  // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                Deutranopia;                                              // 0x0010(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                Tritanopia;                                               // 0x0020(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                Protanopia;                                               // 0x0030(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ASStruct Angelscript.MatchTeamColor
// 0x0080
struct FMatchTeamColor
{
	struct FSquadColor                                 TeamColor;                                                // 0x0000(0x0040) (Edit, BlueprintVisible)
	struct FSquadColor                                 AccentColor;                                              // 0x0040(0x0040) (Edit, BlueprintVisible)
};

// ASStruct Angelscript.TypeDamage
// 0x0010
struct FTypeDamage
{
	unsigned char                                      UnknownData00[0x8];                                       // 0x0000(0x0008) MISSED OFFSET
	double                                             Value;                                                    // 0x0008(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ASStruct Angelscript.HealthBarSegmentInfo
// 0x0018
struct FHealthBarSegmentInfo
{
	int                                                HealthPerSegment;                                         // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                RegenSegmentCount;                                        // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TArray<int>                                        RegenBreakSegmentIndices;                                 // 0x0008(0x0010) (Edit, BlueprintVisible)
};

// ASStruct Angelscript.SortableArchetypeSize
// 0x0008
struct FSortableArchetypeSize
{
	unsigned char                                      UnknownData00[0x8];                                       // 0x0000(0x0008) MISSED OFFSET
};

// ASStruct Angelscript.FallbackCustomization
// 0x0060
struct FFallbackCustomization
{
	TMap<enum class EBodyType, class UCharacterCustomizationItem*> Head;                                                     // 0x0000(0x0050) (Edit, BlueprintVisible)
	TArray<class UCharacterCustomizationItem*>         Items;                                                    // 0x0050(0x0010) (Edit, BlueprintVisible)
};

// ASStruct Angelscript.CharacterFrontendAnimations
// 0x0018
struct FCharacterFrontendAnimations
{
	class UAnimSequence*                               Idle;                                                     // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UAnimSequence*                               Preview;                                                  // 0x0008(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UAnimSequence*                               Equip;                                                    // 0x0010(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ASStruct Angelscript.CustomDepthStencilState
// 0x0008
struct FCustomDepthStencilState
{
	bool                                               bDrawToCustomDepth;                                       // 0x0000(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0001(0x0003) MISSED OFFSET
	int                                                CustomStencilValue;                                       // 0x0004(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
};

// ASStruct Angelscript.CharacterCustomizationData
// 0x01A8
struct FCharacterCustomizationData
{
	TArray<class USkeletalMesh*>                       FirstPersonMeshesToMerge;                                 // 0x0000(0x0010) (Transient)
	TArray<class USkeletalMesh*>                       ThirdPersonMeshesToMerge;                                 // 0x0010(0x0010) (Transient)
	TArray<class UPhysicsAsset*>                       PhysicsAssetsToMerge;                                     // 0x0020(0x0010) (Transient)
	TArray<struct FEmbarkAttachedStaticMeshDesc>       FirstPersonAttachedStaticMeshes;                          // 0x0030(0x0010) (Transient)
	TArray<struct FEmbarkAttachedStaticMeshDesc>       ThirdPersonAttachedStaticMeshes;                          // 0x0040(0x0010) (Transient)
	int                                                FirstPersonMeshIndex;                                     // 0x0050(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	int                                                ThirdPersonSkeletalMeshIndex;                             // 0x0054(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	int                                                FirstPersonStaticMeshIndex;                               // 0x0058(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	int                                                ThirdPersonStaticMeshIndex;                               // 0x005C(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x50];                                      // 0x0060(0x0050) UNKNOWN PROPERTY: ThirdPersonWrapDeformerComponentMap
	unsigned char                                      UnknownData01[0x50];                                      // 0x00B0(0x0050) UNKNOWN PROPERTY: FirstPersonWrapDeformerComponentMap
	unsigned char                                      UnknownData02[0x50];                                      // 0x0100(0x0050) UNKNOWN PROPERTY: MergedThirdPersonWrapDeformerComponentMap
	unsigned char                                      UnknownData03[0x50];                                      // 0x0150(0x0050) UNKNOWN PROPERTY: MergedFirstPersonWrapDeformerComponentMap
	class UEmbarkSkeletalMeshComponent*                HeadComponent;                                            // 0x01A0(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
};

// ASStruct Angelscript.CustomizationItemTagOverrides
// 0x0120
struct FCustomizationItemTagOverrides
{
	struct FGameplayTagContainer                       MatchingTags;                                             // 0x0000(0x0020) (Edit, BlueprintVisible)
	bool                                               bOffsetTransform;                                         // 0x0020(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0021(0x0007) MISSED OFFSET
	struct FVector                                     OffsetPosition;                                           // 0x0028(0x0018) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FRotator                                    OffsetRotation;                                           // 0x0040(0x0018) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FVector                                     OffsetScale;                                              // 0x0058(0x0018) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bOverrideMesh;                                            // 0x0070(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0071(0x0007) MISSED OFFSET
	unsigned char                                      UnknownData02[0x28];                                      // 0x0071(0x0028) UNKNOWN PROPERTY: ReplacementStaticMesh
	unsigned char                                      UnknownData03[0x28];                                      // 0x00A0(0x0028) UNKNOWN PROPERTY: ReplacementSkeletalMesh
	bool                                               bOverrideMaterials;                                       // 0x00C8(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData04[0x7];                                       // 0x00C9(0x0007) MISSED OFFSET
	unsigned char                                      UnknownData05[0x50];                                      // 0x00C9(0x0050) UNKNOWN PROPERTY: MaterialOverrides
};

// ASStruct Angelscript.CustomizationItemWrapDeformation
// 0x0030
struct FCustomizationItemWrapDeformation
{
	bool                                               bIsWrapDeformed;                                          // 0x0000(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bIsWrapDeformedByHeadComponent;                           // 0x0001(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x6];                                       // 0x0002(0x0006) MISSED OFFSET
	unsigned char                                      UnknownData01[0x28];                                      // 0x0002(0x0028) UNKNOWN PROPERTY: OptionalWrapDeformerMesh
};

// ASStruct Angelscript.CustomizationItemVisualPart
// 0x0138
struct FCustomizationItemVisualPart
{
	unsigned char                                      UnknownData00[0x28];                                      // 0x0000(0x0028) UNKNOWN PROPERTY: StaticMesh
	unsigned char                                      UnknownData01[0x28];                                      // 0x0028(0x0028) UNKNOWN PROPERTY: SkeletalMesh
	unsigned char                                      UnknownData02[0x28];                                      // 0x0050(0x0028) UNKNOWN PROPERTY: Effect
	bool                                               bVisibleInFirstPerson;                                    // 0x0078(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bCanBeMerged;                                             // 0x0079(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bIsAttached;                                              // 0x007A(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData03[0x5];                                       // 0x007B(0x0005) MISSED OFFSET
	unsigned char                                      UnknownData04[0x28];                                      // 0x007B(0x0028) UNKNOWN PROPERTY: OptionalAttachmentMesh
	struct FName                                       AttachmentSocket;                                         // 0x00A8(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FVector                                     LocalPosition;                                            // 0x00B0(0x0018) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FRotator                                    LocalRotation;                                            // 0x00C8(0x0018) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FVector                                     LocalScale;                                               // 0x00E0(0x0018) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TArray<struct FCustomizationItemTagOverrides>      TagOverrides;                                             // 0x00F8(0x0010) (Edit, BlueprintVisible)
	struct FCustomizationItemWrapDeformation           WrapDeformation;                                          // 0x0108(0x0030) (Edit, BlueprintVisible)
};

// ASStruct Angelscript.CustomizationMaterialParameters
// 0x0058
struct FCustomizationMaterialParameters
{
	struct FGameplayTagContainer                       MatchingTags;                                             // 0x0000(0x0020) (Edit, BlueprintVisible)
	unsigned char                                      UnknownData00[0x28];                                      // 0x0020(0x0028) UNKNOWN PROPERTY: MaterialInstance
	TArray<struct FName>                               SlotNames;                                                // 0x0048(0x0010) (Edit, BlueprintVisible)
};

// ASStruct Angelscript.SortableCustomizationItem
// 0x0008
struct FSortableCustomizationItem
{
	class UCharacterCustomizationItem*                 Item;                                                     // 0x0000(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
};

// ASStruct Angelscript.SortableCustomizationOutfit
// 0x0008
struct FSortableCustomizationOutfit
{
	class UCharacterCustomizationOutfitDataAsset*      Outfit;                                                   // 0x0000(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
};

// ASStruct Angelscript.SortableCustomizationWeaponSkin
// 0x0008
struct FSortableCustomizationWeaponSkin
{
	class UWeaponSkinDataAsset*                        Skin;                                                     // 0x0000(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
};

// ASStruct Angelscript.SortableCustomizationPurchaseItem
// 0x0010
struct FSortableCustomizationPurchaseItem
{
	class UCharacterCustomizationItem*                 Item;                                                     // 0x0000(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	bool                                               bIsOwned;                                                 // 0x0008(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	bool                                               bPurchasable;                                             // 0x0009(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x6];                                       // 0x000A(0x0006) MISSED OFFSET
};

// ASStruct Angelscript.SortableCustomizationPurchaseOutfit
// 0x0010
struct FSortableCustomizationPurchaseOutfit
{
	class UCharacterCustomizationOutfitDataAsset*      Outfit;                                                   // 0x0000(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	bool                                               bIsOwned;                                                 // 0x0008(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	bool                                               bPurchasable;                                             // 0x0009(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x6];                                       // 0x000A(0x0006) MISSED OFFSET
};

// ASStruct Angelscript.TestCustomizationItemLibrary
// 0x0070
struct FTestCustomizationItemLibrary
{
	class UCharacterCustomizationItem*                 Item0;                                                    // 0x0000(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class UCharacterCustomizationItem*                 Item1;                                                    // 0x0008(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class UCharacterCustomizationItem*                 Item2;                                                    // 0x0010(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class UCharacterCustomizationItem*                 Item3;                                                    // 0x0018(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class UCharacterCustomizationItem*                 Item4;                                                    // 0x0020(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class UCharacterCustomizationItem*                 Item5;                                                    // 0x0028(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class UCharacterCustomizationItem*                 Item6;                                                    // 0x0030(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class UCharacterCustomizationItem*                 Item7;                                                    // 0x0038(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class UCharacterCustomizationItem*                 Item8;                                                    // 0x0040(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class UCharacterCustomizationItem*                 Item9;                                                    // 0x0048(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class UCharacterCustomizationItem*                 Item10;                                                   // 0x0050(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class UCharacterCustomizationItem*                 Item11;                                                   // 0x0058(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class UCharacterCustomizationOutfitDataAsset*      Outfit0;                                                  // 0x0060(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class UCharacterCustomizationOutfitDataAsset*      Outfit1;                                                  // 0x0068(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
};

// ASStruct Angelscript.EmoteProp
// 0x0078
struct FEmoteProp
{
	unsigned char                                      UnknownData00[0x28];                                      // 0x0000(0x0028) UNKNOWN PROPERTY: StaticMesh
	struct FName                                       AttachmentSocket;                                         // 0x0028(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FVector                                     LocalPosition;                                            // 0x0030(0x0018) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FRotator                                    LocalRotation;                                            // 0x0048(0x0018) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FVector                                     LocalScale;                                               // 0x0060(0x0018) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ASStruct Angelscript.ArrayVector
// 0x0010
struct FArrayVector
{
	TArray<struct FVector>                             Value;                                                    // 0x0000(0x0010) (Transient)
};

// ASStruct Angelscript.EffectParameters
// 0x0398
struct FEffectParameters
{
	struct FHitResult                                  Hit;                                                      // 0x0000(0x00E8) (Transient, IsPlainOldData)
	struct FVector                                     Velocity;                                                 // 0x00E8(0x0018) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FVector                                     Direction;                                                // 0x0100(0x0018) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TArray<struct FVector>                             LocationArray;                                            // 0x0118(0x0010) (Edit, BlueprintVisible)
	TArray<struct FVector>                             DirectionArray;                                           // 0x0128(0x0010) (Edit, BlueprintVisible)
	float                                              VolumeMultiplier;                                         // 0x0138(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	float                                              PitchMultiplier;                                          // 0x013C(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	float                                              StartOffset;                                              // 0x0140(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	float                                              Radius;                                                   // 0x0144(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FVector                                     DecalRadius;                                              // 0x0148(0x0018) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              Mass;                                                     // 0x0160(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TEnumAsByte<EPhysicalSurface>                      SurfaceType;                                              // 0x0164(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	bool                                               bLooping;                                                 // 0x0165(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	bool                                               bSkipAttachmentForTrail;                                  // 0x0166(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x1];                                       // 0x0167(0x0001) MISSED OFFSET
	TMap<struct FName, int>                            CustomIntParameters;                                      // 0x0168(0x0050) (Transient)
	TMap<struct FName, double>                         CustomFloatParameters;                                    // 0x01B8(0x0050) (Transient)
	TMap<struct FName, struct FVector>                 CustomVectorParameters;                                   // 0x0208(0x0050) (Transient)
	TMap<struct FName, struct FLinearColor>            CustomColorParameters;                                    // 0x0258(0x0050) (Transient)
	TMap<struct FName, bool>                           CustomBoolParameters;                                     // 0x02A8(0x0050) (Transient)
	TMap<struct FName, struct FArrayVector>            CustomArrayVectorParameters;                              // 0x02F8(0x0050) (Transient)
	struct FVector                                     Location;                                                 // 0x0348(0x0018) (ZeroConstructor, Transient, IsPlainOldData)
	struct FVector                                     RelativeLocation;                                         // 0x0360(0x0018) (ZeroConstructor, Transient, IsPlainOldData)
	bool                                               bUseWorldLocation;                                        // 0x0378(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0379(0x0007) MISSED OFFSET
	class USceneComponent*                             AttachToComponent;                                        // 0x0380(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	struct FName                                       AttachSocketName;                                         // 0x0388(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	int                                                UserData;                                                 // 0x0390(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData02[0x4];                                       // 0x0394(0x0004) MISSED OFFSET
};

// ASStruct Angelscript.EmbarkFootStep
// 0x0458
struct FEmbarkFootStep
{
	class UEffectDataAsset*                            EffectPreset;                                             // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FName                                       Socket;                                                   // 0x0008(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	double                                             FootstepHeightThreshold;                                  // 0x0010(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	double                                             FootstepVelocityThreshold;                                // 0x0018(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                DebugColor;                                               // 0x0020(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UMaterialInterface*                          ImprintBrushMaterial;                                     // 0x0030(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	double                                             ImprintSize;                                              // 0x0038(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	double                                             ImprintVelocityDivision;                                  // 0x0040(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FVector2D                                   ImprintPlayerMassRange;                                   // 0x0048(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FVector2D                                   ImprintPlayerMassAlpha;                                   // 0x0058(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class USkeletalMeshComponent*                      SkeletalMeshComponent;                                    // 0x0068(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class UPawnMovementComponent*                      MovementComponent;                                        // 0x0070(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	struct FVector                                     FootVelocity;                                             // 0x0078(0x0018) (ZeroConstructor, Transient, IsPlainOldData)
	struct FVector                                     PrevFootLocation;                                         // 0x0090(0x0018) (ZeroConstructor, Transient, IsPlainOldData)
	bool                                               bIsFootPlanted;                                           // 0x00A8(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x00A9(0x0007) MISSED OFFSET
	class UMaterialInstanceDynamic*                    ImprintBrushMaterialInstance;                             // 0x00B0(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class UDiscoveryGameInstance*                      GameInstance;                                             // 0x00B8(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	struct FEffectParameters                           EffectParameters;                                         // 0x00C0(0x0398) (Transient)
};

// ASStruct Angelscript.DiscoveryTargetedEffect
// 0x0020
struct FDiscoveryTargetedEffect
{
	class UClass*                                      TargetType;                                               // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UClass*                                      DamageEffect;                                             // 0x0008(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	double                                             SetByCaller_NormalDamage;                                 // 0x0010(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	double                                             SetByCaller_EnvironmentalDamage;                          // 0x0018(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ASStruct Angelscript.PayloadSettings
// 0x0030
struct FPayloadSettings
{
	TArray<struct FDiscoveryTargetedEffect>            PayloadEffects;                                           // 0x0000(0x0010) (Edit, BlueprintVisible)
	struct FGameplayTagContainer                       DamageTags;                                               // 0x0010(0x0020) (Edit, BlueprintVisible)
};

// ASStruct Angelscript.DiscoveryRadialForceParams
// 0x0018
struct FDiscoveryRadialForceParams
{
	unsigned char                                      UnknownData00[0x2];                                       // 0x0000(0x0002) MISSED OFFSET
