#pragma once

//   SDK By:if

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace sdk
{
//---------------------------------------------------------------------------
// Enums
//---------------------------------------------------------------------------

// Enum ControlRig.EControlRigComponentSpace
enum class EControlRigComponentSpace : uint8_t
{
	WorldSpace                     = 0,
	ActorSpace                     = 1,
	ComponentSpace                 = 2,
	RigSpace                       = 3,
	LocalSpace                     = 4,
	Max                            = 5
};


// Enum ControlRig.EControlRigComponentMapDirection
enum class EControlRigComponentMapDirection : uint8_t
{
	Input                          = 0,
	Output                         = 1,
	EControlRigComponentMapDirection_MAX = 2
};


// Enum ControlRig.ETransformSpaceMode
enum class ETransformSpaceMode : uint8_t
{
	LocalSpace                     = 0,
	GlobalSpace                    = 1,
	BaseSpace                      = 2,
	BaseJoint                      = 3,
	Max                            = 4
};


// Enum ControlRig.EControlRigClampSpatialMode
enum class EControlRigClampSpatialMode : uint8_t
{
	Plane                          = 0,
	Cylinder                       = 1,
	Sphere                         = 2,
	EControlRigClampSpatialMode_MAX = 3
};


// Enum ControlRig.ETransformGetterType
enum class ETransformGetterType : uint8_t
{
	Initial                        = 0,
	Current                        = 1,
	Max                            = 2
};


// Enum ControlRig.EBoneGetterSetterMode
enum class EBoneGetterSetterMode : uint8_t
{
	LocalSpace                     = 0,
	GlobalSpace                    = 1,
	Max                            = 2
};


// Enum ControlRig.ERigExecutionType
enum class ERigExecutionType : uint8_t
{
	Runtime                        = 0,
	Editing                        = 1,
	Max                            = 2
};


// Enum ControlRig.EControlRigDrawSettings
enum class EControlRigDrawSettings : uint8_t
{
	Points                         = 0,
	Lines                          = 1,
	LineStrip                      = 2,
	DynamicMesh                    = 3,
	EControlRigDrawSettings_MAX    = 4
};


// Enum ControlRig.EControlRigDrawHierarchyMode
enum class EControlRigDrawHierarchyMode : uint8_t
{
	Axes                           = 0,
	Max                            = 1
};


// Enum ControlRig.EControlRigAnimEasingType
enum class EControlRigAnimEasingType : uint8_t
{
	Linear                         = 0,
	QuadraticEaseIn                = 1,
	QuadraticEaseOut               = 2,
	QuadraticEaseInOut             = 3,
	CubicEaseIn                    = 4,
	CubicEaseOut                   = 5,
	CubicEaseInOut                 = 6,
	QuarticEaseIn                  = 7,
	QuarticEaseOut                 = 8,
	QuarticEaseInOut               = 9,
	QuinticEaseIn                  = 10,
	QuinticEaseOut                 = 11,
	QuinticEaseInOut               = 12,
	SineEaseIn                     = 13,
	SineEaseOut                    = 14,
	SineEaseInOut                  = 15,
	CircularEaseIn                 = 16,
	CircularEaseOut                = 17,
	CircularEaseInOut              = 18,
	ExponentialEaseIn              = 19,
	ExponentialEaseOut             = 20,
	ExponentialEaseInOut           = 21,
	ElasticEaseIn                  = 22,
	ElasticEaseOut                 = 23,
	ElasticEaseInOut               = 24,
	BackEaseIn                     = 25,
	BackEaseOut                    = 26,
	BackEaseInOut                  = 27,
	BounceEaseIn                   = 28,
	BounceEaseOut                  = 29,
	BounceEaseInOut                = 30,
	EControlRigAnimEasingType_MAX  = 31
};


// Enum ControlRig.ECRSimPointIntegrateType
enum class ECRSimPointIntegrateType : uint8_t
{
	Verlet                         = 0,
	SemiExplicitEuler              = 1,
	ECRSimPointIntegrateType_MAX   = 2
};


// Enum ControlRig.ECRSimConstraintType
enum class ECRSimConstraintType : uint8_t
{
	Distance                       = 0,
	DistanceFromA                  = 1,
	DistanceFromB                  = 2,
	Plane                          = 3,
	ECRSimConstraintType_MAX       = 4
};


// Enum ControlRig.ECRSimPointForceType
enum class ECRSimPointForceType : uint8_t
{
	Direction                      = 0,
	ECRSimPointForceType_MAX       = 1
};


// Enum ControlRig.ECRSimSoftCollisionType
enum class ECRSimSoftCollisionType : uint8_t
{
	Plane                          = 0,
	Sphere                         = 1,
	Cone                           = 2,
	ECRSimSoftCollisionType_MAX    = 3
};


// Enum ControlRig.EControlRigFKRigExecuteMode
enum class EControlRigFKRigExecuteMode : uint8_t
{
	Replace                        = 0,
	Additive                       = 1,
	Max                            = 2
};


// Enum ControlRig.EMovieSceneControlRigSpaceType
enum class EMovieSceneControlRigSpaceType : uint8_t
{
	Parent                         = 0,
	World                          = 1,
	ControlRig                     = 2,
	EMovieSceneControlRigSpaceType_MAX = 3
};


// Enum ControlRig.ERigTransformStackEntryType
enum class ERigTransformStackEntryType : uint8_t
{
	TransformPose                  = 0,
	ControlOffset                  = 1,
	ControlShape                   = 2,
	CurveValue                     = 3,
	ERigTransformStackEntryType_MAX = 4
};


// Enum ControlRig.ERigElementType
enum class ERigElementType : uint8_t
{
	None                           = 0,
	Bone                           = 1,
	Null                           = 2,
	Space                          = 3,
	Control                        = 4,
	Curve                          = 5,
	RigidBody                      = 6,
	Reference                      = 7,
	Last                           = 8,
	All                            = 9,
	ToResetAfterSetupEvent         = 10,
	ERigElementType_MAX            = 11
};


// Enum ControlRig.ERigBoneType
enum class ERigBoneType : uint8_t
{
	Imported                       = 0,
	User                           = 1,
	ERigBoneType_MAX               = 2
};


// Enum ControlRig.ERigHierarchyNotification
enum class ERigHierarchyNotification : uint8_t
{
	ElementAdded                   = 0,
	ElementRemoved                 = 1,
	ElementRenamed                 = 2,
	ElementSelected                = 3,
	ElementDeselected              = 4,
	ParentChanged                  = 5,
	HierarchyReset                 = 6,
	ControlSettingChanged          = 7,
	ControlVisibilityChanged       = 8,
	ControlShapeTransformChanged   = 9,
	ParentWeightsChanged           = 10,
	Max                            = 11
};


// Enum ControlRig.ERigEvent
enum class ERigEvent : uint8_t
{
	None                           = 0,
	RequestAutoKey                 = 1,
	Max                            = 2
};


// Enum ControlRig.EControlRigSetKey
enum class EControlRigSetKey : uint8_t
{
	DoNotCare                      = 0,
	Always                         = 1,
	Never                          = 2,
	EControlRigSetKey_MAX          = 3
};


// Enum ControlRig.ERigControlType
enum class ERigControlType : uint8_t
{
	Bool                           = 0,
	Float                          = 1,
	Integer                        = 2,
	Vector2D                       = 3,
	Position                       = 4,
	Scale                          = 5,
	Rotator                        = 6,
	Transform                      = 7,
	TransformNoScale               = 8,
	EulerTransform                 = 9,
	ERigControlType_MAX            = 10
};


// Enum ControlRig.ERigControlValueType
enum class ERigControlValueType : uint8_t
{
	Initial                        = 0,
	Current                        = 1,
	Minimum                        = 2,
	Maximum                        = 3,
	ERigControlValueType_MAX       = 4
};


// Enum ControlRig.ERigControlAxis
enum class ERigControlAxis : uint8_t
{
	X                              = 0,
	Y                              = 1,
	Z                              = 2,
	ERigControlAxis_MAX            = 3
};


// Enum ControlRig.ERigTransformType
enum class ERigTransformType : uint8_t
{
	InitialLocal                   = 0,
	CurrentLocal                   = 1,
	InitialGlobal                  = 2,
	CurrentGlobal                  = 3,
	NumTransformTypes              = 4,
	ERigTransformType_MAX          = 5
};


// Enum ControlRig.ERigSpaceType
enum class ERigSpaceType : uint8_t
{
	Global                         = 0,
	Bone                           = 1,
	Control                        = 2,
	Space                          = 3,
	ERigSpaceType_MAX              = 4
};


// Enum ControlRig.EControlRigState
enum class EControlRigState : uint8_t
{
	Init                           = 0,
	Update                         = 1,
	Invalid                        = 2,
	EControlRigState_MAX           = 3
};


// Enum ControlRig.EAimMode
enum class EAimMode : uint8_t
{
	AimAtTarget                    = 0,
	OrientToTarget                 = 1,
	MAX                            = 2
};


// Enum ControlRig.EApplyTransformMode
enum class EApplyTransformMode : uint8_t
{
	Override                       = 0,
	Additive                       = 1,
	Max                            = 2
};


// Enum ControlRig.ERigUnitDebugPointMode
enum class ERigUnitDebugPointMode : uint8_t
{
	Point                          = 0,
	Vector                         = 1,
	Max                            = 2
};


// Enum ControlRig.ERigUnitDebugTransformMode
enum class ERigUnitDebugTransformMode : uint8_t
{
	Point                          = 0,
	Axes                           = 1,
	Box                            = 2,
	Max                            = 3
};


// Enum ControlRig.ERigSwitchParentMode
enum class ERigSwitchParentMode : uint8_t
{
	World                          = 0,
	DefaultParent                  = 1,
	ParentItem                     = 2,
	ERigSwitchParentMode_MAX       = 3
};


// Enum ControlRig.EControlRigCurveAlignment
enum class EControlRigCurveAlignment : uint8_t
{
	Front                          = 0,
	Stretched                      = 1,
	EControlRigCurveAlignment_MAX  = 2
};


// Enum ControlRig.EControlRigVectorKind
enum class EControlRigVectorKind : uint8_t
{
	Direction                      = 0,
	Location                       = 1,
	EControlRigVectorKind_MAX      = 2
};


// Enum ControlRig.ERBFKernelType
enum class ERBFKernelType : uint8_t
{
	Gaussian                       = 0,
	Exponential                    = 1,
	Linear                         = 2,
	Cubic                          = 3,
	Quintic                        = 4,
	ERBFKernelType_MAX             = 5
};


// Enum ControlRig.ERBFQuatDistanceType
enum class ERBFQuatDistanceType : uint8_t
{
	Euclidean                      = 0,
	ArcLength                      = 1,
	SwingAngle                     = 2,
	TwistAngle                     = 3,
	ERBFQuatDistanceType_MAX       = 4
};


// Enum ControlRig.ERBFVectorDistanceType
enum class ERBFVectorDistanceType : uint8_t
{
	Euclidean                      = 0,
	Manhattan                      = 1,
	ArcLength                      = 2,
	ERBFVectorDistanceType_MAX     = 3
};


// Enum ControlRig.EControlRigModifyBoneMode
enum class EControlRigModifyBoneMode : uint8_t
{
	OverrideLocal                  = 0,
	OverrideGlobal                 = 1,
	AdditiveLocal                  = 2,
	AdditiveGlobal                 = 3,
	Max                            = 4
};


// Enum ControlRig.EConstraintInterpType
enum class EConstraintInterpType : uint8_t
{
	Average                        = 0,
	Shortest                       = 1,
	Max                            = 2
};


// Enum ControlRig.ERigUnitVisualDebugPointMode
enum class ERigUnitVisualDebugPointMode : uint8_t
{
	Point                          = 0,
	Vector                         = 1,
	Max                            = 2
};



//---------------------------------------------------------------------------
// Script Structs
//---------------------------------------------------------------------------

// ScriptStruct ControlRig.RigElementKey
// 0x000C
struct FRigElementKey
{
	unsigned char                                      UnknownData00[0x4];                                       // 0x0000(0x0004) MISSED OFFSET
	struct FName                                       Name;                                                     // 0x0004(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct ControlRig.RigControlElementCustomization
// 0x0020
struct FRigControlElementCustomization
{
	TArray<struct FRigElementKey>                      AvailableSpaces;                                          // 0x0000(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	TArray<struct FRigElementKey>                      RemovedSpaces;                                            // 0x0010(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
};

// ScriptStruct ControlRig.ControlRigDrawInstruction
// 0x00D0
struct FControlRigDrawInstruction
{
	struct FName                                       Name;                                                     // 0x0000(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	TEnumAsByte<EControlRigDrawSettings>               PrimitiveType;                                            // 0x0008(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0009(0x0007) MISSED OFFSET
	TArray<struct FVector>                             Positions;                                                // 0x0010(0x0010) (Edit, ZeroConstructor)
	struct FLinearColor                                Color;                                                    // 0x0020(0x0010) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              Thickness;                                                // 0x0030(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0xC];                                       // 0x0034(0x000C) MISSED OFFSET
	struct FTransform                                  Transform;                                                // 0x0040(0x0060) (Edit, IsPlainOldData)
	unsigned char                                      UnknownData02[0x30];                                      // 0x00A0(0x0030) MISSED OFFSET
};

// ScriptStruct ControlRig.ControlRigDrawContainer
// 0x0018
struct FControlRigDrawContainer
{
	unsigned char                                      UnknownData00[0x8];                                       // 0x0000(0x0008) MISSED OFFSET
	TArray<struct FControlRigDrawInstruction>          Instructions;                                             // 0x0008(0x0010) (Edit, ZeroConstructor)
};

// ScriptStruct ControlRig.RigInfluenceEntry
// 0x0020
struct FRigInfluenceEntry
{
	struct FRigElementKey                              Source;                                                   // 0x0000(0x000C)
	unsigned char                                      UnknownData00[0x4];                                       // 0x000C(0x0004) MISSED OFFSET
	TArray<struct FRigElementKey>                      AffectedList;                                             // 0x0010(0x0010) (ZeroConstructor)
};

// ScriptStruct ControlRig.RigInfluenceMap
// 0x0068
struct FRigInfluenceMap
{
	struct FName                                       EventName;                                                // 0x0000(0x0008) (ZeroConstructor, IsPlainOldData)
	TArray<struct FRigInfluenceEntry>                  Entries;                                                  // 0x0008(0x0010) (ZeroConstructor)
	TMap<struct FRigElementKey, int>                   KeyToIndex;                                               // 0x0018(0x0050)
};

// ScriptStruct ControlRig.RigInfluenceMapPerEvent
// 0x0060
struct FRigInfluenceMapPerEvent
{
	TArray<struct FRigInfluenceMap>                    Maps;                                                     // 0x0000(0x0010) (ZeroConstructor)
	TMap<struct FName, int>                            EventToIndex;                                             // 0x0010(0x0050)
};

// ScriptStruct ControlRig.ControlRigComponentMappedElement
// 0x00D0
struct FControlRigComponentMappedElement
{
	struct FComponentReference                         ComponentReference;                                       // 0x0000(0x0028) (Edit, BlueprintVisible)
	int                                                TransformIndex;                                           // 0x0028(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FName                                       TransformName;                                            // 0x002C(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0034(0x0004) MISSED OFFSET
	struct FName                                       ElementName;                                              // 0x0038(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x10];                                      // 0x0040(0x0010) MISSED OFFSET
	struct FTransform                                  Offset;                                                   // 0x0050(0x0060) (Edit, BlueprintVisible, IsPlainOldData)
	float                                              Weight;                                                   // 0x00B0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x4];                                       // 0x00B4(0x0004) MISSED OFFSET
	class USceneComponent*                             SceneComponent;                                           // 0x00B8(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	int                                                ElementIndex;                                             // 0x00C0(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	int                                                SubIndex;                                                 // 0x00C4(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData03[0x8];                                       // 0x00C8(0x0008) MISSED OFFSET
};

// ScriptStruct ControlRig.ControlRigComponentMappedComponent
// 0x0018
struct FControlRigComponentMappedComponent
{
	class USceneComponent*                             Component;                                                // 0x0000(0x0008) (Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	struct FName                                       ElementName;                                              // 0x0008(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0010(0x0008) MISSED OFFSET
};

// ScriptStruct ControlRig.ControlRigShapeDefinition
// 0x00A0
struct FControlRigShapeDefinition
{
	struct FName                                       ShapeName;                                                // 0x0000(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x28];                                      // 0x0008(0x0028) UNKNOWN PROPERTY: StaticMesh
	struct FTransform                                  Transform;                                                // 0x0030(0x0060) (Edit, BlueprintVisible, BlueprintReadOnly, IsPlainOldData)
	unsigned char                                      UnknownData01[0x10];                                      // 0x0090(0x0010) MISSED OFFSET
};

// ScriptStruct ControlRig.CachedRigElement
// 0x0020
struct FCachedRigElement
{
	struct FRigElementKey                              Key;                                                      // 0x0000(0x000C)
	uint16_t                                           Index;                                                    // 0x000C(0x0002) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x2];                                       // 0x000E(0x0002) MISSED OFFSET
	int                                                ContainerVersion;                                         // 0x0010(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0xC];                                       // 0x0014(0x000C) MISSED OFFSET
};

// ScriptStruct ControlRig.RigPoseElement
// 0x00F0
struct FRigPoseElement
{
	struct FCachedRigElement                           Index;                                                    // 0x0000(0x0020)
	struct FTransform                                  GlobalTransform;                                          // 0x0020(0x0060) (IsPlainOldData)
	struct FTransform                                  LocalTransform;                                           // 0x0080(0x0060) (IsPlainOldData)
	float                                              CurveValue;                                               // 0x00E0(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0xC];                                       // 0x00E4(0x000C) MISSED OFFSET
};

// ScriptStruct ControlRig.RigPose
// 0x0070
struct FRigPose
{
	TArray<struct FRigPoseElement>                     Elements;                                                 // 0x0000(0x0010) (ZeroConstructor)
	int                                                HierarchyTopologyVersion;                                 // 0x0010(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                PoseHash;                                                 // 0x0014(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x58];                                      // 0x0018(0x0058) MISSED OFFSET
};

// ScriptStruct ControlRig.RigControlValueStorage
// 0x0084
struct FRigControlValueStorage
{
	float                                              Float00;                                                  // 0x0000(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              Float01;                                                  // 0x0004(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              Float02;                                                  // 0x0008(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              Float03;                                                  // 0x000C(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              Float10;                                                  // 0x0010(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              Float11;                                                  // 0x0014(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              Float12;                                                  // 0x0018(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              Float13;                                                  // 0x001C(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              Float20;                                                  // 0x0020(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              Float21;                                                  // 0x0024(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              Float22;                                                  // 0x0028(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              Float23;                                                  // 0x002C(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              Float30;                                                  // 0x0030(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              Float31;                                                  // 0x0034(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              Float32;                                                  // 0x0038(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              Float33;                                                  // 0x003C(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              Float00_2;                                                // 0x0040(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              Float01_2;                                                // 0x0044(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              Float02_2;                                                // 0x0048(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              Float03_2;                                                // 0x004C(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              Float10_2;                                                // 0x0050(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              Float11_2;                                                // 0x0054(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              Float12_2;                                                // 0x0058(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              Float13_2;                                                // 0x005C(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              Float20_2;                                                // 0x0060(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              Float21_2;                                                // 0x0064(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              Float22_2;                                                // 0x0068(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              Float23_2;                                                // 0x006C(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              Float30_2;                                                // 0x0070(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              Float31_2;                                                // 0x0074(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              Float32_2;                                                // 0x0078(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              Float33_2;                                                // 0x007C(0x0004) (ZeroConstructor, IsPlainOldData)
	bool                                               bValid;                                                   // 0x0080(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0081(0x0003) MISSED OFFSET
};

// ScriptStruct ControlRig.RigControlValue
// 0x00F0
struct FRigControlValue
{
	struct FRigControlValueStorage                     FloatStorage;                                             // 0x0000(0x0084)
	unsigned char                                      UnknownData00[0xC];                                       // 0x0084(0x000C) MISSED OFFSET
	struct FTransform                                  Storage;                                                  // 0x0090(0x0060) (Deprecated, IsPlainOldData)
};

// ScriptStruct ControlRig.RigControlCopy
// 0x02A0
struct FRigControlCopy
{
	unsigned char                                      UnknownData00[0x10];                                      // 0x0000(0x0010) MISSED OFFSET
	struct FName                                       Name;                                                     // 0x0010(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x8];                                       // 0x0018(0x0008) MISSED OFFSET
	struct FRigControlValue                            Value;                                                    // 0x0020(0x00F0)
	struct FRigElementKey                              ParentKey;                                                // 0x0110(0x000C) (Edit, BlueprintVisible)
	unsigned char                                      UnknownData02[0x4];                                       // 0x011C(0x0004) MISSED OFFSET
	struct FTransform                                  OffsetTransform;                                          // 0x0120(0x0060) (Edit, BlueprintVisible, IsPlainOldData)
	struct FTransform                                  ParentTransform;                                          // 0x0180(0x0060) (Edit, BlueprintVisible, IsPlainOldData)
	struct FTransform                                  LocalTransform;                                           // 0x01E0(0x0060) (Edit, BlueprintVisible, IsPlainOldData)
	struct FTransform                                  GlobalTransform;                                          // 0x0240(0x0060) (Edit, BlueprintVisible, IsPlainOldData)
};

// ScriptStruct ControlRig.ControlRigControlPose
// 0x0060
struct FControlRigControlPose
{
	TArray<struct FRigControlCopy>                     CopyOfControls;                                           // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	unsigned char                                      UnknownData00[0x50];                                      // 0x0010(0x0050) MISSED OFFSET
};

// ScriptStruct ControlRig.ChannelMapInfo
// 0x002C
struct FChannelMapInfo
{
	int                                                ControlIndex;                                             // 0x0000(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                TotalChannelIndex;                                        // 0x0004(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                ChannelIndex;                                             // 0x0008(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                ParentControlIndex;                                       // 0x000C(0x0004) (ZeroConstructor, IsPlainOldData)
	struct FName                                       ChannelTypeName;                                          // 0x0010(0x0008) (ZeroConstructor, IsPlainOldData)
	bool                                               bDoesHaveSpace;                                           // 0x0018(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0019(0x0003) MISSED OFFSET
	int                                                SpaceChannelIndex;                                        // 0x001C(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                MaskIndex;                                                // 0x0020(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                CategoryIndex;                                            // 0x0024(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x0028(0x0004) MISSED OFFSET
};

// ScriptStruct ControlRig.EnumParameterNameAndCurve
// 0x00E8
struct FEnumParameterNameAndCurve
{
	struct FName                                       ParameterName;                                            // 0x0000(0x0008) (ZeroConstructor, IsPlainOldData)
	struct FMovieSceneByteChannel                      ParameterCurve;                                           // 0x0008(0x00E0)
};

// ScriptStruct ControlRig.IntegerParameterNameAndCurve
// 0x00E0
struct FIntegerParameterNameAndCurve
{
	struct FName                                       ParameterName;                                            // 0x0000(0x0008) (ZeroConstructor, IsPlainOldData)
	struct FMovieSceneIntegerChannel                   ParameterCurve;                                           // 0x0008(0x00D8)
};

// ScriptStruct ControlRig.MovieSceneControlRigSpaceBaseKey
// 0x0010
struct FMovieSceneControlRigSpaceBaseKey
{
	unsigned char                                      UnknownData00[0x4];                                       // 0x0000(0x0004) MISSED OFFSET
	struct FRigElementKey                              ControlRigElement;                                        // 0x0004(0x000C) (Edit)
};

// ScriptStruct ControlRig.MovieSceneControlRigSpaceChannel
// 0x0098 (0x00E8 - 0x0050)
struct FMovieSceneControlRigSpaceChannel : public FMovieSceneChannel
{
	TArray<struct FFrameNumber>                        KeyTimes;                                                 // 0x0050(0x0010) (ZeroConstructor)
	TArray<struct FMovieSceneControlRigSpaceBaseKey>   KeyValues;                                                // 0x0060(0x0010) (ZeroConstructor)
	unsigned char                                      UnknownData00[0x78];                                      // 0x0070(0x0078) MISSED OFFSET
};

// ScriptStruct ControlRig.SpaceControlNameAndChannel
// 0x00F0
struct FSpaceControlNameAndChannel
{
	struct FName                                       ControlName;                                              // 0x0000(0x0008) (ZeroConstructor, IsPlainOldData)
	struct FMovieSceneControlRigSpaceChannel           SpaceCurve;                                               // 0x0008(0x00E8)
};

// ScriptStruct ControlRig.RigUnit
// 0x0000 (0x0008 - 0x0008)
struct FRigUnit : public FRigVMStruct
{

};

// ScriptStruct ControlRig.ControlRigExecuteContext
// 0x0000 (0x00C0 - 0x00C0)
struct FControlRigExecuteContext : public FRigVMExecuteContext
{

};

// ScriptStruct ControlRig.RigUnitMutable
// 0x00C8 (0x00D0 - 0x0008)
struct FRigUnitMutable : public FRigUnit
{
	unsigned char                                      UnknownData00[0x8];                                       // 0x0008(0x0008) MISSED OFFSET
	struct FControlRigExecuteContext                   ExecuteContext;                                           // 0x0010(0x00C0) (Transient)
};

// ScriptStruct ControlRig.RigUnit_HighlevelBaseMutable
// 0x0000 (0x00D0 - 0x00D0)
struct FRigUnit_HighlevelBaseMutable : public FRigUnitMutable
{

};

// ScriptStruct ControlRig.ConstraintNodeData
// 0x0140
struct FConstraintNodeData
{
	struct FTransform                                  RelativeParent;                                           // 0x0000(0x0060) (IsPlainOldData)
	struct FConstraintOffset                           ConstraintOffset;                                         // 0x0060(0x00C0)
	struct FName                                       LinkedNode;                                               // 0x0120(0x0008) (ZeroConstructor, IsPlainOldData)
	TArray<struct FTransformConstraint>                Constraints;                                              // 0x0128(0x0010) (ZeroConstructor)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0138(0x0008) MISSED OFFSET
};

// ScriptStruct ControlRig.AnimationHierarchy
// 0x0010 (0x0088 - 0x0078)
struct FAnimationHierarchy : public FNodeHierarchyWithUserData
{
	TArray<struct FConstraintNodeData>                 UserData;                                                 // 0x0078(0x0010) (ZeroConstructor)
};

// ScriptStruct ControlRig.ControlRigIOSettings
// 0x0002
struct FControlRigIOSettings
{
	bool                                               bUpdatePose;                                              // 0x0000(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               bUpdateCurves;                                            // 0x0001(0x0001) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct ControlRig.AnimNode_ControlRigBase
// 0x0200 (0x0258 - 0x0058)
struct FAnimNode_ControlRigBase : public FAnimNode_CustomProperty
{
	struct FPoseLink                                   Source;                                                   // 0x0058(0x0010) (Edit)
	bool                                               bResetInputPoseToInitial;                                 // 0x0068(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bTransferInputPose;                                       // 0x0069(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bTransferInputCurves;                                     // 0x006A(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bTransferPoseInGlobalSpace;                               // 0x006B(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x006C(0x0004) MISSED OFFSET
	TArray<struct FBoneReference>                      InputBonesToTransfer;                                     // 0x0070(0x0010) (Edit, ZeroConstructor)
	unsigned char                                      UnknownData01[0x1C0];                                     // 0x0080(0x01C0) MISSED OFFSET
	TWeakObjectPtr<class UNodeMappingContainer>        NodeMappingContainer;                                     // 0x0240(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	struct FControlRigIOSettings                       InputSettings;                                            // 0x0248(0x0002) (Transient)
	struct FControlRigIOSettings                       OutputSettings;                                           // 0x024A(0x0002) (Transient)
	bool                                               bExecute;                                                 // 0x024C(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData02[0xB];                                       // 0x024D(0x000B) MISSED OFFSET
};

// ScriptStruct ControlRig.AnimNode_ControlRig
// 0x0200 (0x0458 - 0x0258)
struct FAnimNode_ControlRig : public FAnimNode_ControlRigBase
{
	class UClass*                                      ControlRigClass;                                          // 0x0258(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UControlRig*                                 ControlRig;                                               // 0x0260(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	float                                              Alpha;                                                    // 0x0268(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x1];                                       // 0x026C(0x0001) MISSED OFFSET
	unsigned char                                      bAlphaBoolEnabled : 1;                                    // 0x026D(0x0001) (Edit)
	unsigned char                                      bSetRefPoseFromSkeleton : 1;                              // 0x026D(0x0001) (Edit)
	unsigned char                                      UnknownData01[0x2];                                       // 0x026E(0x0002) MISSED OFFSET
	struct FInputScaleBias                             AlphaScaleBias;                                           // 0x0270(0x0008) (Edit)
	struct FInputAlphaBoolBlend                        AlphaBoolBlend;                                           // 0x0278(0x0048) (Edit)
	struct FName                                       AlphaCurveName;                                           // 0x02C0(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	struct FInputScaleBiasClamp                        AlphaScaleBiasClamp;                                      // 0x02C8(0x0030) (Edit)
	TMap<struct FName, struct FName>                   InputMapping;                                             // 0x02F8(0x0050)
	TMap<struct FName, struct FName>                   OutputMapping;                                            // 0x0348(0x0050)
	unsigned char                                      UnknownData02[0xB0];                                      // 0x0398(0x00B0) MISSED OFFSET
	int                                                LODThreshold;                                             // 0x0448(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData03[0xC];                                       // 0x044C(0x000C) MISSED OFFSET
};

// ScriptStruct ControlRig.AnimNode_ControlRig_ExternalSource
// 0x0008 (0x0260 - 0x0258)
struct FAnimNode_ControlRig_ExternalSource : public FAnimNode_ControlRigBase
{
	TWeakObjectPtr<class UControlRig>                  ControlRig;                                               // 0x0258(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
};

// ScriptStruct ControlRig.ControlRigAnimInstanceProxy
// 0x00A0 (0x0920 - 0x0880)
struct FControlRigAnimInstanceProxy : public FAnimInstanceProxy
{
	unsigned char                                      UnknownData00[0xA0];                                      // 0x0880(0x00A0) MISSED OFFSET
};

// ScriptStruct ControlRig.ControlRigComponentMappedBone
// 0x0010
struct FControlRigComponentMappedBone
{
	struct FName                                       Source;                                                   // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FName                                       Target;                                                   // 0x0008(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct ControlRig.ControlRigComponentMappedCurve
// 0x0010
struct FControlRigComponentMappedCurve
{
	struct FName                                       Source;                                                   // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FName                                       Target;                                                   // 0x0008(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct ControlRig.ControlRigDrawInterface
// 0x0000 (0x0018 - 0x0018)
struct FControlRigDrawInterface : public FControlRigDrawContainer
{

};

// ScriptStruct ControlRig.ControlShapeActorCreationParam
// 0x01B0
struct FControlShapeActorCreationParam
{
	unsigned char                                      UnknownData00[0x1B0];                                     // 0x0000(0x01B0) MISSED OFFSET
};

// ScriptStruct ControlRig.AnimNode_ControlRigInputPose
// 0x0020 (0x0030 - 0x0010)
struct FAnimNode_ControlRigInputPose : public FAnimNode_Base
{
	struct FPoseLink                                   InputPose;                                                // 0x0010(0x0010)
	unsigned char                                      UnknownData00[0x10];                                      // 0x0020(0x0010) MISSED OFFSET
};

// ScriptStruct ControlRig.ControlRigLayerInstanceProxy
// 0x00A0 (0x0920 - 0x0880)
struct FControlRigLayerInstanceProxy : public FAnimInstanceProxy
{
	unsigned char                                      UnknownData00[0xA0];                                      // 0x0880(0x00A0) MISSED OFFSET
};

// ScriptStruct ControlRig.CRFourPointBezier
// 0x0060
struct FCRFourPointBezier
{
	struct FVector                                     A;                                                        // 0x0000(0x0018) (ZeroConstructor, IsPlainOldData)
	struct FVector                                     B;                                                        // 0x0018(0x0018) (ZeroConstructor, IsPlainOldData)
	struct FVector                                     C;                                                        // 0x0030(0x0018) (ZeroConstructor, IsPlainOldData)
	struct FVector                                     D;                                                        // 0x0048(0x0018) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct ControlRig.ControlRigSequenceObjectReference
// 0x0008
struct FControlRigSequenceObjectReference
{
	class UClass*                                      ControlRigClass;                                          // 0x0000(0x0008) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct ControlRig.ControlRigSequenceObjectReferences
// 0x0010
struct FControlRigSequenceObjectReferences
{
	TArray<struct FControlRigSequenceObjectReference>  Array;                                                    // 0x0000(0x0010) (ZeroConstructor)
};

// ScriptStruct ControlRig.ControlRigSequenceObjectReferenceMap
// 0x0020
struct FControlRigSequenceObjectReferenceMap
{
	TArray<struct FGuid>                               BindingIds;                                               // 0x0000(0x0010) (ZeroConstructor)
	TArray<struct FControlRigSequenceObjectReferences> References;                                               // 0x0010(0x0010) (ZeroConstructor)
};

// ScriptStruct ControlRig.ControlRigSettingsPerPinBool
// 0x0050
struct FControlRigSettingsPerPinBool
{
	TMap<struct FString, bool>                         Values;                                                   // 0x0000(0x0050) (Edit)
};

// ScriptStruct ControlRig.ControlRigValidationContext
// 0x0028
struct FControlRigValidationContext
{
	unsigned char                                      UnknownData00[0x28];                                      // 0x0000(0x0028) MISSED OFFSET
};

// ScriptStruct ControlRig.CRSimContainer
// 0x0018
struct FCRSimContainer
{
	unsigned char                                      UnknownData00[0x8];                                       // 0x0000(0x0008) MISSED OFFSET
	float                                              TimeStep;                                                 // 0x0008(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              AccumulatedTime;                                          // 0x000C(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              TimeLeftForStep;                                          // 0x0010(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x0014(0x0004) MISSED OFFSET
};

// ScriptStruct ControlRig.CRSimLinearSpring
// 0x0010
struct FCRSimLinearSpring
{
	int                                                SubjectA;                                                 // 0x0000(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                SubjectB;                                                 // 0x0004(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              Coefficient;                                              // 0x0008(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              Equilibrium;                                              // 0x000C(0x0004) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct ControlRig.CRSimPoint
// 0x0040
struct FCRSimPoint
{
	float                                              Mass;                                                     // 0x0000(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              Size;                                                     // 0x0004(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              LinearDamping;                                            // 0x0008(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              InheritMotion;                                            // 0x000C(0x0004) (ZeroConstructor, IsPlainOldData)
	struct FVector                                     Position;                                                 // 0x0010(0x0018) (ZeroConstructor, IsPlainOldData)
	struct FVector                                     LinearVelocity;                                           // 0x0028(0x0018) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct ControlRig.CRSimPointConstraint
// 0x0040
struct FCRSimPointConstraint
{
	unsigned char                                      UnknownData00[0x4];                                       // 0x0000(0x0004) MISSED OFFSET
	int                                                SubjectA;                                                 // 0x0004(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                SubjectB;                                                 // 0x0008(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x000C(0x0004) MISSED OFFSET
	struct FVector                                     DataA;                                                    // 0x0010(0x0018) (ZeroConstructor, IsPlainOldData)
	struct FVector                                     DataB;                                                    // 0x0028(0x0018) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct ControlRig.CRSimPointForce
// 0x0028
struct FCRSimPointForce
{
	unsigned char                                      UnknownData00[0x8];                                       // 0x0000(0x0008) MISSED OFFSET
	struct FVector                                     Vector;                                                   // 0x0008(0x0018) (ZeroConstructor, IsPlainOldData)
	float                                              Coefficient;                                              // 0x0020(0x0004) (ZeroConstructor, IsPlainOldData)
	bool                                               bNormalize;                                               // 0x0024(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x0025(0x0003) MISSED OFFSET
};

// ScriptStruct ControlRig.CRSimSoftCollision
// 0x0080
struct FCRSimSoftCollision
{
	struct FTransform                                  Transform;                                                // 0x0000(0x0060) (IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0060(0x0004) MISSED OFFSET
	float                                              MinimumDistance;                                          // 0x0064(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              MaximumDistance;                                          // 0x0068(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x006C(0x0004) MISSED OFFSET
	float                                              Coefficient;                                              // 0x0070(0x0004) (ZeroConstructor, IsPlainOldData)
	bool                                               bInverted;                                                // 0x0074(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0xB];                                       // 0x0075(0x000B) MISSED OFFSET
};

// ScriptStruct ControlRig.CRSimPointContainer
// 0x0060 (0x0078 - 0x0018)
struct FCRSimPointContainer : public FCRSimContainer
{
	TArray<struct FCRSimPoint>                         Points;                                                   // 0x0018(0x0010) (ZeroConstructor)
	TArray<struct FCRSimLinearSpring>                  Springs;                                                  // 0x0028(0x0010) (ZeroConstructor)
	TArray<struct FCRSimPointForce>                    Forces;                                                   // 0x0038(0x0010) (ZeroConstructor)
	TArray<struct FCRSimSoftCollision>                 CollisionVolumes;                                         // 0x0048(0x0010) (ZeroConstructor)
	TArray<struct FCRSimPointConstraint>               Constraints;                                              // 0x0058(0x0010) (ZeroConstructor)
	TArray<struct FCRSimPoint>                         PreviousStep;                                             // 0x0068(0x0010) (ZeroConstructor)
};

// ScriptStruct ControlRig.MovieSceneControlRigInstanceData
// 0x0118 (0x0120 - 0x0008)
struct FMovieSceneControlRigInstanceData : public FMovieSceneSequenceInstanceData
{
	bool                                               bAdditive;                                                // 0x0008(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               bApplyBoneFilter;                                         // 0x0009(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x6];                                       // 0x000A(0x0006) MISSED OFFSET
	struct FInputBlendPose                             BoneFilter;                                               // 0x0010(0x0010)
	struct FMovieSceneFloatChannel                     Weight;                                                   // 0x0020(0x00E8)
	struct FMovieSceneEvaluationOperand                Operand;                                                  // 0x0108(0x0014)
	unsigned char                                      UnknownData01[0x4];                                       // 0x011C(0x0004) MISSED OFFSET
};

// ScriptStruct ControlRig.MovieSceneControlRigParameterTemplate
// 0x0030 (0x00B0 - 0x0080)
struct FMovieSceneControlRigParameterTemplate : public FMovieSceneParameterSectionTemplate
{
	TArray<struct FEnumParameterNameAndCurve>          Enums;                                                    // 0x0080(0x0010) (ZeroConstructor)
	TArray<struct FIntegerParameterNameAndCurve>       Integers;                                                 // 0x0090(0x0010) (ZeroConstructor)
	TArray<struct FSpaceControlNameAndChannel>         Spaces;                                                   // 0x00A0(0x0010) (ZeroConstructor)
};

// ScriptStruct ControlRig.RigElement
// 0x0018
struct FRigElement
{
	unsigned char                                      UnknownData00[0x8];                                       // 0x0000(0x0008) MISSED OFFSET
	struct FName                                       Name;                                                     // 0x0008(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	int                                                Index;                                                    // 0x0010(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x0014(0x0004) MISSED OFFSET
};

// ScriptStruct ControlRig.RigBone
// 0x0158 (0x0170 - 0x0018)
struct FRigBone : public FRigElement
{
	struct FName                                       ParentName;                                               // 0x0018(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	int                                                ParentIndex;                                              // 0x0020(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0xC];                                       // 0x0024(0x000C) MISSED OFFSET
	struct FTransform                                  InitialTransform;                                         // 0x0030(0x0060) (Edit, BlueprintVisible, BlueprintReadOnly, IsPlainOldData)
	struct FTransform                                  GlobalTransform;                                          // 0x0090(0x0060) (Edit, BlueprintVisible, BlueprintReadOnly, Transient, IsPlainOldData)
	struct FTransform                                  LocalTransform;                                           // 0x00F0(0x0060) (Edit, BlueprintVisible, BlueprintReadOnly, Transient, IsPlainOldData)
	TArray<int>                                        Dependents;                                               // 0x0150(0x0010) (ZeroConstructor, Transient)
	unsigned char                                      UnknownData01[0x10];                                      // 0x0160(0x0010) MISSED OFFSET
};

// ScriptStruct ControlRig.RigBoneHierarchy
// 0x0010
struct FRigBoneHierarchy
{
	TArray<struct FRigBone>                            Bones;                                                    // 0x0000(0x0010) (Edit, ZeroConstructor)
};

// ScriptStruct ControlRig.RigControl
// 0x04F8 (0x0510 - 0x0018)
struct FRigControl : public FRigElement
{
	unsigned char                                      UnknownData00[0x4];                                       // 0x0018(0x0004) MISSED OFFSET
	struct FName                                       DisplayName;                                              // 0x001C(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FName                                       ParentName;                                               // 0x0024(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	int                                                ParentIndex;                                              // 0x002C(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	struct FName                                       SpaceName;                                                // 0x0030(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	int                                                SpaceIndex;                                               // 0x0038(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x003C(0x0004) MISSED OFFSET
	struct FTransform                                  OffsetTransform;                                          // 0x0040(0x0060) (Edit, BlueprintVisible, IsPlainOldData)
	struct FRigControlValue                            InitialValue;                                             // 0x00A0(0x00F0) (Edit, BlueprintVisible, BlueprintReadOnly, EditConst)
	struct FRigControlValue                            Value;                                                    // 0x0190(0x00F0) (Edit, BlueprintVisible, BlueprintReadOnly, Transient, EditConst)
	unsigned char                                      UnknownData02[0x1];                                       // 0x0280(0x0001) MISSED OFFSET
	bool                                               bIsCurve;                                                 // 0x0281(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	bool                                               bAnimatable;                                              // 0x0282(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
