#pragma once

//   SDK By:if

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace sdk
{
//---------------------------------------------------------------------------
// Classes
//---------------------------------------------------------------------------

// SMBlueprintGeneratedClass DSM_MapIntroduction.DSM_MapIntroduction_C
// 0x2804 (0x2F1C - 0x0718)
class UDSM_MapIntroduction_C : public UDialogueStateMachineInstance
{
public:
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                           // 0x0718(0x0008) (ZeroConstructor, Transient, DuplicateTransient)
	struct FSMTransition                               SMGraphK2Node_TransitionResultNode_E42208F24E0311678BAF409B3D1957BE_LD_Prop_9;// 0x0720(0x0190)
	struct FSMTransition                               SMGraphK2Node_TransitionResultNode_E42208F24E0311678BAF409B3D1957BE_LD_Prop_8;// 0x08B0(0x0190)
	struct FSMTransition                               SMGraphK2Node_TransitionResultNode_E42208F24E0311678BAF409B3D1957BE_LD_Prop_7;// 0x0A40(0x0190)
	struct FSMTransition                               SMGraphK2Node_TransitionResultNode_E42208F24E0311678BAF409B3D1957BE_LD_Prop_6;// 0x0BD0(0x0190)
	struct FSMTransition                               SMGraphK2Node_TransitionResultNode_E42208F24E0311678BAF409B3D1957BE_LD_Prop_5;// 0x0D60(0x0190)
	struct FSMTransition                               SMGraphK2Node_TransitionResultNode_E42208F24E0311678BAF409B3D1957BE_LD_Prop_4;// 0x0EF0(0x0190)
	struct FSMTransition                               SMGraphK2Node_TransitionResultNode_E42208F24E0311678BAF409B3D1957BE_LD_Prop_3;// 0x1080(0x0190)
	struct FSMTransition                               SMGraphK2Node_TransitionResultNode_E42208F24E0311678BAF409B3D1957BE_LD_Prop_2;// 0x1210(0x0190)
	struct FSMTransition                               SMGraphK2Node_TransitionResultNode_E42208F24E0311678BAF409B3D1957BE_LD_Prop_1;// 0x13A0(0x0190)
	struct FSMTransition                               SMGraphK2Node_TransitionResultNode_E42208F24E0311678BAF409B3D1957BE_LD_Prop;// 0x1530(0x0190)
	struct FSMState                                    SMGraphK2Node_StateEntryNode_E42208F24E0311678BAF409B3D1957BE_LD_Prop_10;// 0x16C0(0x0188)
	struct FSMState                                    SMGraphK2Node_StateEntryNode_E42208F24E0311678BAF409B3D1957BE_LD_Prop_9;// 0x1848(0x0188)
	struct FSMState                                    SMGraphK2Node_StateEntryNode_E42208F24E0311678BAF409B3D1957BE_LD_Prop_8;// 0x19D0(0x0188)
	struct FSMState                                    SMGraphK2Node_StateEntryNode_E42208F24E0311678BAF409B3D1957BE_LD_Prop_7;// 0x1B58(0x0188)
	struct FSMState                                    SMGraphK2Node_StateEntryNode_E42208F24E0311678BAF409B3D1957BE_LD_Prop_6;// 0x1CE0(0x0188)
	struct FSMState                                    SMGraphK2Node_StateEntryNode_E42208F24E0311678BAF409B3D1957BE_LD_Prop_5;// 0x1E68(0x0188)
	struct FSMState                                    SMGraphK2Node_StateEntryNode_E42208F24E0311678BAF409B3D1957BE_LD_Prop_4;// 0x1FF0(0x0188)
	struct FSMState                                    SMGraphK2Node_StateEntryNode_E42208F24E0311678BAF409B3D1957BE_LD_Prop_3;// 0x2178(0x0188)
	struct FSMState                                    SMGraphK2Node_StateEntryNode_E42208F24E0311678BAF409B3D1957BE_LD_Prop_2;// 0x2300(0x0188)
	struct FSMState                                    SMGraphK2Node_StateEntryNode_E42208F24E0311678BAF409B3D1957BE_LD_Prop_1;// 0x2488(0x0188)
	struct FSMState                                    SMGraphK2Node_StateEntryNode_E42208F24E0311678BAF409B3D1957BE_LD_Prop;// 0x2610(0x0188)
	struct FSMGraphProperty_Runtime                    SMGraphK2Node_GraphPropertyNode_E42208F24E0311678BAF409B3D1957BE_LD_Prop_23;// 0x2798(0x0048)
	struct FSMGraphProperty_Runtime                    SMGraphK2Node_GraphPropertyNode_E42208F24E0311678BAF409B3D1957BE_LD_Prop_22;// 0x27E0(0x0048)
	struct FSMGraphProperty_Runtime                    SMGraphK2Node_GraphPropertyNode_E42208F24E0311678BAF409B3D1957BE_LD_Prop_21;// 0x2828(0x0048)
	struct FSMGraphProperty_Runtime                    SMGraphK2Node_GraphPropertyNode_E42208F24E0311678BAF409B3D1957BE_LD_Prop_20;// 0x2870(0x0048)
	struct FSMGraphProperty_Runtime                    SMGraphK2Node_GraphPropertyNode_E42208F24E0311678BAF409B3D1957BE_LD_Prop_19;// 0x28B8(0x0048)
	struct FSMGraphProperty_Runtime                    SMGraphK2Node_GraphPropertyNode_E42208F24E0311678BAF409B3D1957BE_LD_Prop_18;// 0x2900(0x0048)
	struct FSMGraphProperty_Runtime                    SMGraphK2Node_GraphPropertyNode_E42208F24E0311678BAF409B3D1957BE_LD_Prop_17;// 0x2948(0x0048)
	struct FSMGraphProperty_Runtime                    SMGraphK2Node_GraphPropertyNode_E42208F24E0311678BAF409B3D1957BE_LD_Prop_16;// 0x2990(0x0048)
	struct FSMGraphProperty_Runtime                    SMGraphK2Node_GraphPropertyNode_E42208F24E0311678BAF409B3D1957BE_LD_Prop_15;// 0x29D8(0x0048)
	struct FSMGraphProperty_Runtime                    SMGraphK2Node_GraphPropertyNode_E42208F24E0311678BAF409B3D1957BE_LD_Prop_14;// 0x2A20(0x0048)
	struct FSMGraphProperty_Runtime                    SMGraphK2Node_GraphPropertyNode_E42208F24E0311678BAF409B3D1957BE_LD_Prop_13;// 0x2A68(0x0048)
	struct FSMGraphProperty_Runtime                    SMGraphK2Node_GraphPropertyNode_E42208F24E0311678BAF409B3D1957BE_LD_Prop_12;// 0x2AB0(0x0048)
	struct FSMGraphProperty_Runtime                    SMGraphK2Node_GraphPropertyNode_E42208F24E0311678BAF409B3D1957BE_LD_Prop_11;// 0x2AF8(0x0048)
	struct FSMGraphProperty_Runtime                    SMGraphK2Node_GraphPropertyNode_E42208F24E0311678BAF409B3D1957BE_LD_Prop_10;// 0x2B40(0x0048)
	struct FSMGraphProperty_Runtime                    SMGraphK2Node_GraphPropertyNode_E42208F24E0311678BAF409B3D1957BE_LD_Prop_9;// 0x2B88(0x0048)
	struct FSMGraphProperty_Runtime                    SMGraphK2Node_GraphPropertyNode_E42208F24E0311678BAF409B3D1957BE_LD_Prop_8;// 0x2BD0(0x0048)
	struct FSMGraphProperty_Runtime                    SMGraphK2Node_GraphPropertyNode_E42208F24E0311678BAF409B3D1957BE_LD_Prop_7;// 0x2C18(0x0048)
	struct FSMGraphProperty_Runtime                    SMGraphK2Node_GraphPropertyNode_E42208F24E0311678BAF409B3D1957BE_LD_Prop_6;// 0x2C60(0x0048)
	struct FSMGraphProperty_Runtime                    SMGraphK2Node_GraphPropertyNode_E42208F24E0311678BAF409B3D1957BE_LD_Prop_5;// 0x2CA8(0x0048)
	struct FSMGraphProperty_Runtime                    SMGraphK2Node_GraphPropertyNode_E42208F24E0311678BAF409B3D1957BE_LD_Prop_4;// 0x2CF0(0x0048)
	struct FSMGraphProperty_Runtime                    SMGraphK2Node_GraphPropertyNode_E42208F24E0311678BAF409B3D1957BE_LD_Prop_3;// 0x2D38(0x0048)
	struct FSMGraphProperty_Runtime                    SMGraphK2Node_GraphPropertyNode_E42208F24E0311678BAF409B3D1957BE_LD_Prop_2;// 0x2D80(0x0048)
	struct FSMGraphProperty_Runtime                    SMGraphK2Node_GraphPropertyNode_E42208F24E0311678BAF409B3D1957BE_LD_Prop_1;// 0x2DC8(0x0048)
	struct FSMGraphProperty_Runtime                    SMGraphK2Node_GraphPropertyNode_E42208F24E0311678BAF409B3D1957BE_LD_Prop;// 0x2E10(0x0048)
	TMap<struct FGameplayTag, struct FGameplayTag>     WeatherTagMap;                                            // 0x2E58(0x0050) (Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<struct FGameplayTag, struct FGameplayTag>     VariantTagMap;                                            // 0x2EA8(0x0050) (Edit, BlueprintVisible, DisableEditOnInstance)
	struct FName                                       WeatherBucketSequence;                                    // 0x2EF8(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FName                                       VariantBucketSequence;                                    // 0x2F00(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FName                                       FinalRoundIntroCoHostBucketSequence;                      // 0x2F08(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FName                                       FinalRoundIntroCommentatorBucketSequence;                 // 0x2F10(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	int                                                RandomInt;                                                // 0x2F18(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("SMBlueprintGeneratedClass DSM_MapIntroduction.DSM_MapIntroduction_C"));
		return ptr;
	}


	void SMGraphK2Node_GraphPropertyNode_E42208F24E0311678BAF409B3D1957BE_DF7CC22DE6FE46E5F65D04F537E7042F();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_GraphPropertyNode_E42208F24E0311678BAF409B3D1957BE_7029191DC382CD1DEADCCBBCD33EDE2E();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_GraphPropertyNode_E42208F24E0311678BAF409B3D1957BE_26AE8674113BF0F399A68E15984CFCED();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_GraphPropertyNode_E42208F24E0311678BAF409B3D1957BE_96B795C34CF8ECE4812C3463ABFBCDDF();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_GraphPropertyNode_E42208F24E0311678BAF409B3D1957BE_DF7CC22DE6FE46E5F65D04F537E7042F_1();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_GraphPropertyNode_E42208F24E0311678BAF409B3D1957BE_7029191DC382CD1DEADCCBBCD33EDE2E_1();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_GraphPropertyNode_E42208F24E0311678BAF409B3D1957BE_26AE8674113BF0F399A68E15984CFCED_1();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_GraphPropertyNode_E42208F24E0311678BAF409B3D1957BE_96B795C34CF8ECE4812C3463ABFBCDDF_1();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_GraphPropertyNode_E42208F24E0311678BAF409B3D1957BE_DF7CC22DE6FE46E5F65D04F537E7042F_2();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_GraphPropertyNode_E42208F24E0311678BAF409B3D1957BE_7029191DC382CD1DEADCCBBCD33EDE2E_2();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_GraphPropertyNode_E42208F24E0311678BAF409B3D1957BE_26AE8674113BF0F399A68E15984CFCED_2();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_GraphPropertyNode_E42208F24E0311678BAF409B3D1957BE_96B795C34CF8ECE4812C3463ABFBCDDF_2();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_GraphPropertyNode_E42208F24E0311678BAF409B3D1957BE_DF7CC22DE6FE46E5F65D04F537E7042F_3();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_GraphPropertyNode_E42208F24E0311678BAF409B3D1957BE_7029191DC382CD1DEADCCBBCD33EDE2E_3();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_GraphPropertyNode_E42208F24E0311678BAF409B3D1957BE_26AE8674113BF0F399A68E15984CFCED_3();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_GraphPropertyNode_E42208F24E0311678BAF409B3D1957BE_96B795C34CF8ECE4812C3463ABFBCDDF_3();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_GraphPropertyNode_E42208F24E0311678BAF409B3D1957BE_DF7CC22DE6FE46E5F65D04F537E7042F_4();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_GraphPropertyNode_E42208F24E0311678BAF409B3D1957BE_7029191DC382CD1DEADCCBBCD33EDE2E_4();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_GraphPropertyNode_E42208F24E0311678BAF409B3D1957BE_26AE8674113BF0F399A68E15984CFCED_4();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_GraphPropertyNode_E42208F24E0311678BAF409B3D1957BE_96B795C34CF8ECE4812C3463ABFBCDDF_4();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_GraphPropertyNode_E42208F24E0311678BAF409B3D1957BE_DF7CC22DE6FE46E5F65D04F537E7042F_5();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_GraphPropertyNode_E42208F24E0311678BAF409B3D1957BE_7029191DC382CD1DEADCCBBCD33EDE2E_5();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_GraphPropertyNode_E42208F24E0311678BAF409B3D1957BE_26AE8674113BF0F399A68E15984CFCED_5();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_GraphPropertyNode_E42208F24E0311678BAF409B3D1957BE_96B795C34CF8ECE4812C3463ABFBCDDF_5();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_StateEntryNode_E42208F24E0311678BAF409B3D1957BE_Commentator___Map_Variant_3481D9C64EF7226F5B44208981B9C519();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_StateEntryNode_E42208F24E0311678BAF409B3D1957BE_Get_Weather_Bucket_F0F214C94FC85D96470AB18697D0758C();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_StateEntryNode_E42208F24E0311678BAF409B3D1957BE_CoHost___Weather_984EFFFB49E803A8BBF5D7AB074E7D2C();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_StateEntryNode_E42208F24E0311678BAF409B3D1957BE_Get_Variant_Bucket_1EF605D34CECBBBC9651B794E259E221();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_StateEntryNode_E42208F24E0311678BAF409B3D1957BE_Reset_All_Queues_CDA0FA204636DB3B2E9B0E85CB8E1A36();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_StateEntryNode_E42208F24E0311678BAF409B3D1957BE_Is_Quickcash_or_Tournament_or_Final_round_855F8FB74A11D58B7DF8329257E76DA9();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_StateEntryNode_E42208F24E0311678BAF409B3D1957BE_Commentator___Quickcash_Intro_3BCC8BDF4B591D6BD962CABA7A3B66C0();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_StateEntryNode_E42208F24E0311678BAF409B3D1957BE_CoHost___Quickcash_Intro_Answer_F1D3B5104C02713DD0F500B5B76E7431();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_StateEntryNode_E42208F24E0311678BAF409B3D1957BE_CoHost___Final_Round_D3A3FF414AD6648790379199C7A98E39();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_StateEntryNode_E42208F24E0311678BAF409B3D1957BE_Determine_Final_Round_Variation_Combination_EFCFE08541471B813CE2899121D58E90();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_StateEntryNode_E42208F24E0311678BAF409B3D1957BE_Commentator___Final_Round_Answer_F0F09AEC4712A886E11C70BB1C721A33();//Offset:Discovery.exe+0x327F8B0
	void ExecuteUbergraph_DSM_MapIntroduction(int EntryPoint);//Offset:Discovery.exe+0x327F8B0
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
