#pragma once

//   SDK By:if

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace sdk
{
//---------------------------------------------------------------------------
// Classes
//---------------------------------------------------------------------------

// SMBlueprintGeneratedClass DSM_LeadTakenCommentator.DSM_LeadTakenCommentator_C
// 0x2380 (0x2A98 - 0x0718)
class UDSM_LeadTakenCommentator_C : public UDialogueStateMachineInstance
{
public:
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                           // 0x0718(0x0008) (ZeroConstructor, Transient, DuplicateTransient)
	struct FSMTransition                               SMGraphK2Node_TransitionResultNode_FA4D05C0445A3359219A9093CCD9BA03_LD_Prop_8;// 0x0720(0x0190)
	struct FSMTransition                               SMGraphK2Node_TransitionResultNode_FA4D05C0445A3359219A9093CCD9BA03_LD_Prop_7;// 0x08B0(0x0190)
	struct FSMTransition                               SMGraphK2Node_TransitionResultNode_FA4D05C0445A3359219A9093CCD9BA03_LD_Prop_6;// 0x0A40(0x0190)
	struct FSMTransition                               SMGraphK2Node_TransitionResultNode_FA4D05C0445A3359219A9093CCD9BA03_LD_Prop_5;// 0x0BD0(0x0190)
	struct FSMTransition                               SMGraphK2Node_TransitionResultNode_FA4D05C0445A3359219A9093CCD9BA03_LD_Prop_4;// 0x0D60(0x0190)
	struct FSMTransition                               SMGraphK2Node_TransitionResultNode_FA4D05C0445A3359219A9093CCD9BA03_LD_Prop_3;// 0x0EF0(0x0190)
	struct FSMTransition                               SMGraphK2Node_TransitionResultNode_FA4D05C0445A3359219A9093CCD9BA03_LD_Prop_2;// 0x1080(0x0190)
	struct FSMTransition                               SMGraphK2Node_TransitionResultNode_FA4D05C0445A3359219A9093CCD9BA03_LD_Prop_1;// 0x1210(0x0190)
	struct FSMTransition                               SMGraphK2Node_TransitionResultNode_FA4D05C0445A3359219A9093CCD9BA03_LD_Prop;// 0x13A0(0x0190)
	struct FSMState                                    SMGraphK2Node_StateEntryNode_FA4D05C0445A3359219A9093CCD9BA03_LD_Prop_8;// 0x1530(0x0188)
	struct FSMState                                    SMGraphK2Node_StateEntryNode_FA4D05C0445A3359219A9093CCD9BA03_LD_Prop_7;// 0x16B8(0x0188)
	struct FSMState                                    SMGraphK2Node_StateEntryNode_FA4D05C0445A3359219A9093CCD9BA03_LD_Prop_6;// 0x1840(0x0188)
	struct FSMState                                    SMGraphK2Node_StateEntryNode_FA4D05C0445A3359219A9093CCD9BA03_LD_Prop_5;// 0x19C8(0x0188)
	struct FSMState                                    SMGraphK2Node_StateEntryNode_FA4D05C0445A3359219A9093CCD9BA03_LD_Prop_4;// 0x1B50(0x0188)
	struct FSMState                                    SMGraphK2Node_StateEntryNode_FA4D05C0445A3359219A9093CCD9BA03_LD_Prop_3;// 0x1CD8(0x0188)
	struct FSMState                                    SMGraphK2Node_StateEntryNode_FA4D05C0445A3359219A9093CCD9BA03_LD_Prop_2;// 0x1E60(0x0188)
	struct FSMState                                    SMGraphK2Node_StateEntryNode_FA4D05C0445A3359219A9093CCD9BA03_LD_Prop_1;// 0x1FE8(0x0188)
	struct FSMState                                    SMGraphK2Node_StateEntryNode_FA4D05C0445A3359219A9093CCD9BA03_LD_Prop;// 0x2170(0x0188)
	struct FSMGraphProperty_Runtime                    SMGraphK2Node_GraphPropertyNode_FA4D05C0445A3359219A9093CCD9BA03_LD_Prop_21;// 0x22F8(0x0048)
	struct FSMGraphProperty_Runtime                    SMGraphK2Node_GraphPropertyNode_FA4D05C0445A3359219A9093CCD9BA03_LD_Prop_20;// 0x2340(0x0048)
	struct FSMGraphProperty_Runtime                    SMGraphK2Node_GraphPropertyNode_FA4D05C0445A3359219A9093CCD9BA03_LD_Prop_19;// 0x2388(0x0048)
	struct FSMGraphProperty_Runtime                    SMGraphK2Node_GraphPropertyNode_FA4D05C0445A3359219A9093CCD9BA03_LD_Prop_18;// 0x23D0(0x0048)
	struct FSMGraphProperty_Runtime                    SMGraphK2Node_GraphPropertyNode_FA4D05C0445A3359219A9093CCD9BA03_LD_Prop_17;// 0x2418(0x0048)
	struct FSMGraphProperty_Runtime                    SMGraphK2Node_GraphPropertyNode_FA4D05C0445A3359219A9093CCD9BA03_LD_Prop_16;// 0x2460(0x0048)
	struct FSMGraphProperty_Runtime                    SMGraphK2Node_GraphPropertyNode_FA4D05C0445A3359219A9093CCD9BA03_LD_Prop_15;// 0x24A8(0x0048)
	struct FSMGraphProperty_Runtime                    SMGraphK2Node_GraphPropertyNode_FA4D05C0445A3359219A9093CCD9BA03_LD_Prop_14;// 0x24F0(0x0048)
	struct FSMGraphProperty_Runtime                    SMGraphK2Node_GraphPropertyNode_FA4D05C0445A3359219A9093CCD9BA03_LD_Prop_13;// 0x2538(0x0048)
	struct FSMGraphProperty_Runtime                    SMGraphK2Node_GraphPropertyNode_FA4D05C0445A3359219A9093CCD9BA03_LD_Prop_12;// 0x2580(0x0048)
	struct FSMGraphProperty_Runtime                    SMGraphK2Node_GraphPropertyNode_FA4D05C0445A3359219A9093CCD9BA03_LD_Prop_11;// 0x25C8(0x0048)
	struct FSMGraphProperty_Runtime                    SMGraphK2Node_GraphPropertyNode_FA4D05C0445A3359219A9093CCD9BA03_LD_Prop_10;// 0x2610(0x0048)
	struct FSMGraphProperty_Runtime                    SMGraphK2Node_GraphPropertyNode_FA4D05C0445A3359219A9093CCD9BA03_LD_Prop_9;// 0x2658(0x0048)
	struct FSMGraphProperty_Runtime                    SMGraphK2Node_GraphPropertyNode_FA4D05C0445A3359219A9093CCD9BA03_LD_Prop_8;// 0x26A0(0x0048)
	struct FSMGraphProperty_Runtime                    SMGraphK2Node_GraphPropertyNode_FA4D05C0445A3359219A9093CCD9BA03_LD_Prop_7;// 0x26E8(0x0048)
	struct FSMGraphProperty_Runtime                    SMGraphK2Node_GraphPropertyNode_FA4D05C0445A3359219A9093CCD9BA03_LD_Prop_6;// 0x2730(0x0048)
	struct FSMGraphProperty_Runtime                    SMGraphK2Node_GraphPropertyNode_FA4D05C0445A3359219A9093CCD9BA03_LD_Prop_5;// 0x2778(0x0048)
	struct FSMGraphProperty_Runtime                    SMGraphK2Node_GraphPropertyNode_FA4D05C0445A3359219A9093CCD9BA03_LD_Prop_4;// 0x27C0(0x0048)
	struct FSMGraphProperty_Runtime                    SMGraphK2Node_GraphPropertyNode_FA4D05C0445A3359219A9093CCD9BA03_LD_Prop_3;// 0x2808(0x0048)
	struct FSMGraphProperty_Runtime                    SMGraphK2Node_GraphPropertyNode_FA4D05C0445A3359219A9093CCD9BA03_LD_Prop_2;// 0x2850(0x0048)
	struct FSMGraphProperty_Runtime                    SMGraphK2Node_GraphPropertyNode_FA4D05C0445A3359219A9093CCD9BA03_LD_Prop_1;// 0x2898(0x0048)
	struct FSMGraphProperty_Runtime                    SMGraphK2Node_GraphPropertyNode_FA4D05C0445A3359219A9093CCD9BA03_LD_Prop;// 0x28E0(0x0048)
	TMap<struct FGameplayTag, struct FGameplayTag>     SquadMap;                                                 // 0x2928(0x0050) (Edit, BlueprintVisible, DisableEditOnInstance)
	struct FName                                       SquadBucketSequence;                                      // 0x2978(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FName                                       LosingSquadBucketSequence;                                // 0x2980(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TMap<struct FGameplayTag, struct FGameplayTag>     LosingSquadMap;                                           // 0x2988(0x0050) (Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FGameplayTag>                        RoundTypeArray;                                           // 0x29D8(0x0010) (Edit, BlueprintVisible, DisableEditOnInstance)
	struct FName                                       ComebackSquadBucketSequence;                              // 0x29E8(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TMap<struct FGameplayTag, struct FGameplayTag>     ComebackSquadMap;                                         // 0x29F0(0x0050) (Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTag                                DidComebackHappen;                                        // 0x2A40(0x0008) (Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<struct FGameplayTag, struct FGameplayTag>     IsComebackMap;                                            // 0x2A48(0x0050) (Edit, BlueprintVisible, DisableEditOnInstance)

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("SMBlueprintGeneratedClass DSM_LeadTakenCommentator.DSM_LeadTakenCommentator_C"));
		return ptr;
	}


	void SMGraphK2Node_GraphPropertyNode_FA4D05C0445A3359219A9093CCD9BA03_DF7CC22DE6FE46E5F65D04F537E7042F();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_GraphPropertyNode_FA4D05C0445A3359219A9093CCD9BA03_7029191DC382CD1DEADCCBBCD33EDE2E();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_GraphPropertyNode_FA4D05C0445A3359219A9093CCD9BA03_26AE8674113BF0F399A68E15984CFCED();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_GraphPropertyNode_FA4D05C0445A3359219A9093CCD9BA03_96B795C34CF8ECE4812C3463ABFBCDDF();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_GraphPropertyNode_FA4D05C0445A3359219A9093CCD9BA03_DF7CC22DE6FE46E5F65D04F537E7042F_1();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_GraphPropertyNode_FA4D05C0445A3359219A9093CCD9BA03_7029191DC382CD1DEADCCBBCD33EDE2E_1();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_GraphPropertyNode_FA4D05C0445A3359219A9093CCD9BA03_26AE8674113BF0F399A68E15984CFCED_1();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_GraphPropertyNode_FA4D05C0445A3359219A9093CCD9BA03_96B795C34CF8ECE4812C3463ABFBCDDF_1();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_GraphPropertyNode_FA4D05C0445A3359219A9093CCD9BA03_DF7CC22DE6FE46E5F65D04F537E7042F_2();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_GraphPropertyNode_FA4D05C0445A3359219A9093CCD9BA03_7029191DC382CD1DEADCCBBCD33EDE2E_2();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_GraphPropertyNode_FA4D05C0445A3359219A9093CCD9BA03_26AE8674113BF0F399A68E15984CFCED_2();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_GraphPropertyNode_FA4D05C0445A3359219A9093CCD9BA03_96B795C34CF8ECE4812C3463ABFBCDDF_2();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_GraphPropertyNode_FA4D05C0445A3359219A9093CCD9BA03_DF7CC22DE6FE46E5F65D04F537E7042F_3();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_GraphPropertyNode_FA4D05C0445A3359219A9093CCD9BA03_7029191DC382CD1DEADCCBBCD33EDE2E_3();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_GraphPropertyNode_FA4D05C0445A3359219A9093CCD9BA03_26AE8674113BF0F399A68E15984CFCED_3();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_GraphPropertyNode_FA4D05C0445A3359219A9093CCD9BA03_96B795C34CF8ECE4812C3463ABFBCDDF_3();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_GraphPropertyNode_FA4D05C0445A3359219A9093CCD9BA03_DF7CC22DE6FE46E5F65D04F537E7042F_4();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_GraphPropertyNode_FA4D05C0445A3359219A9093CCD9BA03_7029191DC382CD1DEADCCBBCD33EDE2E_4();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_GraphPropertyNode_FA4D05C0445A3359219A9093CCD9BA03_26AE8674113BF0F399A68E15984CFCED_4();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_GraphPropertyNode_FA4D05C0445A3359219A9093CCD9BA03_96B795C34CF8ECE4812C3463ABFBCDDF_4();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_GraphPropertyNode_FA4D05C0445A3359219A9093CCD9BA03_2CBD9EB82C7B7C2A22E7305E5262474D();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_GraphPropertyNode_FA4D05C0445A3359219A9093CCD9BA03_A20978DA60E5652D4C2282FE857519F5();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_StateEntryNode_FA4D05C0445A3359219A9093CCD9BA03_Leader___Loser___Comeback_FBF2B4DC478522F2FA63DAAE35B4A18C();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_StateEntryNode_FA4D05C0445A3359219A9093CCD9BA03_Commentator___Lead_Taken_In_Knockout_531803B440256289E97D98A0FF6BB3FF();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_StateEntryNode_FA4D05C0445A3359219A9093CCD9BA03_Commentator___Danger_Of_Knockout_A9A0327D42ED79CEB22E739024CC1B98();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_StateEntryNode_FA4D05C0445A3359219A9093CCD9BA03_Leader_or_Loser_in_either_Casual___Knockout___Final_E03C0A4D4BD0F8C85E826AB2D4358D8F();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_StateEntryNode_FA4D05C0445A3359219A9093CCD9BA03_Commentator___Lead_Taken_Quickcash_70C98641480CC5F9F4C556AF4337637D();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_StateEntryNode_FA4D05C0445A3359219A9093CCD9BA03_Commentator___Lead_Taken_Final_F981C6BB47689EE8F92B86BD53895A53();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_StateEntryNode_FA4D05C0445A3359219A9093CCD9BA03_CoHost___Comeback_D9830E7D4E0980AB495CAB8D2967C588();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_StateEntryNode_FA4D05C0445A3359219A9093CCD9BA03_Did_A_Comeback_Happen_D5E1516E4DABFFE2F4C03BBB3AFEC334();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_StateEntryNode_FA4D05C0445A3359219A9093CCD9BA03_Wait_33DB382049FB685636BC5C9DF7E7265E();//Offset:Discovery.exe+0x327F8B0
	void ExecuteUbergraph_DSM_LeadTakenCommentator(int EntryPoint);//Offset:Discovery.exe+0x327F8B0
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
