#pragma once

//   SDK By:if

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace sdk
{
//---------------------------------------------------------------------------
// Classes
//---------------------------------------------------------------------------

// SMBlueprintGeneratedClass DSM_DepotStolen.DSM_DepotStolen_C
// 0x1D60 (0x2478 - 0x0718)
class UDSM_DepotStolen_C : public UDialogueStateMachineInstance
{
public:
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                           // 0x0718(0x0008) (ZeroConstructor, Transient, DuplicateTransient)
	struct FSMTransition                               SMGraphK2Node_TransitionResultNode_57A2237E4C35DEC31E741E8672CB2986_LD_Prop_6;// 0x0720(0x0190)
	struct FSMTransition                               SMGraphK2Node_TransitionResultNode_57A2237E4C35DEC31E741E8672CB2986_LD_Prop_5;// 0x08B0(0x0190)
	struct FSMTransition                               SMGraphK2Node_TransitionResultNode_57A2237E4C35DEC31E741E8672CB2986_LD_Prop_4;// 0x0A40(0x0190)
	struct FSMTransition                               SMGraphK2Node_TransitionResultNode_57A2237E4C35DEC31E741E8672CB2986_LD_Prop_3;// 0x0BD0(0x0190)
	struct FSMTransition                               SMGraphK2Node_TransitionResultNode_57A2237E4C35DEC31E741E8672CB2986_LD_Prop_2;// 0x0D60(0x0190)
	struct FSMTransition                               SMGraphK2Node_TransitionResultNode_57A2237E4C35DEC31E741E8672CB2986_LD_Prop_1;// 0x0EF0(0x0190)
	struct FSMTransition                               SMGraphK2Node_TransitionResultNode_57A2237E4C35DEC31E741E8672CB2986_LD_Prop;// 0x1080(0x0190)
	struct FSMState                                    SMGraphK2Node_StateEntryNode_57A2237E4C35DEC31E741E8672CB2986_LD_Prop_7;// 0x1210(0x0188)
	struct FSMState                                    SMGraphK2Node_StateEntryNode_57A2237E4C35DEC31E741E8672CB2986_LD_Prop_6;// 0x1398(0x0188)
	struct FSMState                                    SMGraphK2Node_StateEntryNode_57A2237E4C35DEC31E741E8672CB2986_LD_Prop_5;// 0x1520(0x0188)
	struct FSMState                                    SMGraphK2Node_StateEntryNode_57A2237E4C35DEC31E741E8672CB2986_LD_Prop_4;// 0x16A8(0x0188)
	struct FSMState                                    SMGraphK2Node_StateEntryNode_57A2237E4C35DEC31E741E8672CB2986_LD_Prop_3;// 0x1830(0x0188)
	struct FSMState                                    SMGraphK2Node_StateEntryNode_57A2237E4C35DEC31E741E8672CB2986_LD_Prop_2;// 0x19B8(0x0188)
	struct FSMState                                    SMGraphK2Node_StateEntryNode_57A2237E4C35DEC31E741E8672CB2986_LD_Prop_1;// 0x1B40(0x0188)
	struct FSMState                                    SMGraphK2Node_StateEntryNode_57A2237E4C35DEC31E741E8672CB2986_LD_Prop;// 0x1CC8(0x0188)
	struct FSMGraphProperty_Runtime                    SMGraphK2Node_GraphPropertyNode_57A2237E4C35DEC31E741E8672CB2986_LD_Prop_17;// 0x1E50(0x0048)
	struct FSMGraphProperty_Runtime                    SMGraphK2Node_GraphPropertyNode_57A2237E4C35DEC31E741E8672CB2986_LD_Prop_16;// 0x1E98(0x0048)
	struct FSMGraphProperty_Runtime                    SMGraphK2Node_GraphPropertyNode_57A2237E4C35DEC31E741E8672CB2986_LD_Prop_15;// 0x1EE0(0x0048)
	struct FSMGraphProperty_Runtime                    SMGraphK2Node_GraphPropertyNode_57A2237E4C35DEC31E741E8672CB2986_LD_Prop_14;// 0x1F28(0x0048)
	struct FSMGraphProperty_Runtime                    SMGraphK2Node_GraphPropertyNode_57A2237E4C35DEC31E741E8672CB2986_LD_Prop_13;// 0x1F70(0x0048)
	struct FSMGraphProperty_Runtime                    SMGraphK2Node_GraphPropertyNode_57A2237E4C35DEC31E741E8672CB2986_LD_Prop_12;// 0x1FB8(0x0048)
	struct FSMGraphProperty_Runtime                    SMGraphK2Node_GraphPropertyNode_57A2237E4C35DEC31E741E8672CB2986_LD_Prop_11;// 0x2000(0x0048)
	struct FSMGraphProperty_Runtime                    SMGraphK2Node_GraphPropertyNode_57A2237E4C35DEC31E741E8672CB2986_LD_Prop_10;// 0x2048(0x0048)
	struct FSMGraphProperty_Runtime                    SMGraphK2Node_GraphPropertyNode_57A2237E4C35DEC31E741E8672CB2986_LD_Prop_9;// 0x2090(0x0048)
	struct FSMGraphProperty_Runtime                    SMGraphK2Node_GraphPropertyNode_57A2237E4C35DEC31E741E8672CB2986_LD_Prop_8;// 0x20D8(0x0048)
	struct FSMGraphProperty_Runtime                    SMGraphK2Node_GraphPropertyNode_57A2237E4C35DEC31E741E8672CB2986_LD_Prop_7;// 0x2120(0x0048)
	struct FSMGraphProperty_Runtime                    SMGraphK2Node_GraphPropertyNode_57A2237E4C35DEC31E741E8672CB2986_LD_Prop_6;// 0x2168(0x0048)
	struct FSMGraphProperty_Runtime                    SMGraphK2Node_GraphPropertyNode_57A2237E4C35DEC31E741E8672CB2986_LD_Prop_5;// 0x21B0(0x0048)
	struct FSMGraphProperty_Runtime                    SMGraphK2Node_GraphPropertyNode_57A2237E4C35DEC31E741E8672CB2986_LD_Prop_4;// 0x21F8(0x0048)
	struct FSMGraphProperty_Runtime                    SMGraphK2Node_GraphPropertyNode_57A2237E4C35DEC31E741E8672CB2986_LD_Prop_3;// 0x2240(0x0048)
	struct FSMGraphProperty_Runtime                    SMGraphK2Node_GraphPropertyNode_57A2237E4C35DEC31E741E8672CB2986_LD_Prop_2;// 0x2288(0x0048)
	struct FSMGraphProperty_Runtime                    SMGraphK2Node_GraphPropertyNode_57A2237E4C35DEC31E741E8672CB2986_LD_Prop_1;// 0x22D0(0x0048)
	struct FSMGraphProperty_Runtime                    SMGraphK2Node_GraphPropertyNode_57A2237E4C35DEC31E741E8672CB2986_LD_Prop;// 0x2318(0x0048)
	TMap<struct FGameplayTag, struct FGameplayTag>     GenericDepotSquadTagMap;                                  // 0x2360(0x0050) (Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<struct FGameplayTag, struct FGameplayTag>     DepotASquadTagMap;                                        // 0x23B0(0x0050) (Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<struct FGameplayTag, struct FGameplayTag>     DepotBSquadTagMap;                                        // 0x2400(0x0050) (Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FGameplayTag>                        DepotTagArray;                                            // 0x2450(0x0010) (Edit, BlueprintVisible, DisableEditOnInstance)
	struct FName                                       SquadBucketSequence;                                      // 0x2460(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FName                                       CommentatorStolenBucketSequence;                          // 0x2468(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FName                                       CohostStolenAnswerBucketSequence;                         // 0x2470(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("SMBlueprintGeneratedClass DSM_DepotStolen.DSM_DepotStolen_C"));
		return ptr;
	}


	void SMGraphK2Node_GraphPropertyNode_57A2237E4C35DEC31E741E8672CB2986_DF7CC22DE6FE46E5F65D04F537E7042F();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_GraphPropertyNode_57A2237E4C35DEC31E741E8672CB2986_7029191DC382CD1DEADCCBBCD33EDE2E();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_GraphPropertyNode_57A2237E4C35DEC31E741E8672CB2986_26AE8674113BF0F399A68E15984CFCED();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_GraphPropertyNode_57A2237E4C35DEC31E741E8672CB2986_96B795C34CF8ECE4812C3463ABFBCDDF();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_GraphPropertyNode_57A2237E4C35DEC31E741E8672CB2986_DF7CC22DE6FE46E5F65D04F537E7042F_1();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_GraphPropertyNode_57A2237E4C35DEC31E741E8672CB2986_7029191DC382CD1DEADCCBBCD33EDE2E_1();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_GraphPropertyNode_57A2237E4C35DEC31E741E8672CB2986_26AE8674113BF0F399A68E15984CFCED_1();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_GraphPropertyNode_57A2237E4C35DEC31E741E8672CB2986_96B795C34CF8ECE4812C3463ABFBCDDF_1();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_GraphPropertyNode_57A2237E4C35DEC31E741E8672CB2986_2CBD9EB82C7B7C2A22E7305E5262474D();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_GraphPropertyNode_57A2237E4C35DEC31E741E8672CB2986_A20978DA60E5652D4C2282FE857519F5();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_GraphPropertyNode_57A2237E4C35DEC31E741E8672CB2986_DF7CC22DE6FE46E5F65D04F537E7042F_2();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_GraphPropertyNode_57A2237E4C35DEC31E741E8672CB2986_7029191DC382CD1DEADCCBBCD33EDE2E_2();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_GraphPropertyNode_57A2237E4C35DEC31E741E8672CB2986_26AE8674113BF0F399A68E15984CFCED_2();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_GraphPropertyNode_57A2237E4C35DEC31E741E8672CB2986_96B795C34CF8ECE4812C3463ABFBCDDF_2();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_GraphPropertyNode_57A2237E4C35DEC31E741E8672CB2986_DF7CC22DE6FE46E5F65D04F537E7042F_3();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_GraphPropertyNode_57A2237E4C35DEC31E741E8672CB2986_7029191DC382CD1DEADCCBBCD33EDE2E_3();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_GraphPropertyNode_57A2237E4C35DEC31E741E8672CB2986_26AE8674113BF0F399A68E15984CFCED_3();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_GraphPropertyNode_57A2237E4C35DEC31E741E8672CB2986_96B795C34CF8ECE4812C3463ABFBCDDF_3();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_StateEntryNode_57A2237E4C35DEC31E741E8672CB2986_What_Team__2B8C16A9436A73B067F0839339C3B876();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_StateEntryNode_57A2237E4C35DEC31E741E8672CB2986_Commentator___Depot_Stolen_AE1FF8D0456B09CB324A82A634FB4DED();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_StateEntryNode_57A2237E4C35DEC31E741E8672CB2986_CoHost___Depot_Stolen_Generic_Answer_CA65B1BE4837BD71193A60B7A47B9FC7();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_StateEntryNode_57A2237E4C35DEC31E741E8672CB2986_Wait_8C47F621484334BA542B9FA6BF962621();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_StateEntryNode_57A2237E4C35DEC31E741E8672CB2986_Commentator___Depot_Stolen_Final_Round_7BE133FB48D84D8E0D5A55B1E9B00545();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_StateEntryNode_57A2237E4C35DEC31E741E8672CB2986_CoHost___Depot_Stolen_Final_Round_Answer_D7FF0A4542D152ECE37496844F46D48F();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_StateEntryNode_57A2237E4C35DEC31E741E8672CB2986_Determine_Final_Round_Variation_Combination_8D5EAB7A4F62A7EB095D08B06800F760();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_StateEntryNode_57A2237E4C35DEC31E741E8672CB2986_Is_Final_Round_80854E0642F92F3AF58412A87DAD3260();//Offset:Discovery.exe+0x327F8B0
	void ExecuteUbergraph_DSM_DepotStolen(int EntryPoint);//Offset:Discovery.exe+0x327F8B0
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
