#pragma once

//   SDK By:if

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace sdk
{
//---------------------------------------------------------------------------
// Classes
//---------------------------------------------------------------------------

// SMBlueprintGeneratedClass DSM_DepotCompleteFirst.DSM_DepotCompleteFirst_C
// 0x11F8 (0x1910 - 0x0718)
class UDSM_DepotCompleteFirst_C : public UDialogueStateMachineInstance
{
public:
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                           // 0x0718(0x0008) (ZeroConstructor, Transient, DuplicateTransient)
	struct FSMTransition                               SMGraphK2Node_TransitionResultNode_D87751C94EC87024D7461CA9E995FB4C_LD_Prop_3;// 0x0720(0x0190)
	struct FSMTransition                               SMGraphK2Node_TransitionResultNode_D87751C94EC87024D7461CA9E995FB4C_LD_Prop_2;// 0x08B0(0x0190)
	struct FSMTransition                               SMGraphK2Node_TransitionResultNode_D87751C94EC87024D7461CA9E995FB4C_LD_Prop_1;// 0x0A40(0x0190)
	struct FSMTransition                               SMGraphK2Node_TransitionResultNode_D87751C94EC87024D7461CA9E995FB4C_LD_Prop;// 0x0BD0(0x0190)
	struct FSMState                                    SMGraphK2Node_StateEntryNode_D87751C94EC87024D7461CA9E995FB4C_LD_Prop_4;// 0x0D60(0x0188)
	struct FSMState                                    SMGraphK2Node_StateEntryNode_D87751C94EC87024D7461CA9E995FB4C_LD_Prop_3;// 0x0EE8(0x0188)
	struct FSMState                                    SMGraphK2Node_StateEntryNode_D87751C94EC87024D7461CA9E995FB4C_LD_Prop_2;// 0x1070(0x0188)
	struct FSMState                                    SMGraphK2Node_StateEntryNode_D87751C94EC87024D7461CA9E995FB4C_LD_Prop_1;// 0x11F8(0x0188)
	struct FSMState                                    SMGraphK2Node_StateEntryNode_D87751C94EC87024D7461CA9E995FB4C_LD_Prop;// 0x1380(0x0188)
	struct FSMGraphProperty_Runtime                    SMGraphK2Node_GraphPropertyNode_D87751C94EC87024D7461CA9E995FB4C_LD_Prop_11;// 0x1508(0x0048)
	struct FSMGraphProperty_Runtime                    SMGraphK2Node_GraphPropertyNode_D87751C94EC87024D7461CA9E995FB4C_LD_Prop_10;// 0x1550(0x0048)
	struct FSMGraphProperty_Runtime                    SMGraphK2Node_GraphPropertyNode_D87751C94EC87024D7461CA9E995FB4C_LD_Prop_9;// 0x1598(0x0048)
	struct FSMGraphProperty_Runtime                    SMGraphK2Node_GraphPropertyNode_D87751C94EC87024D7461CA9E995FB4C_LD_Prop_8;// 0x15E0(0x0048)
	struct FSMGraphProperty_Runtime                    SMGraphK2Node_GraphPropertyNode_D87751C94EC87024D7461CA9E995FB4C_LD_Prop_7;// 0x1628(0x0048)
	struct FSMGraphProperty_Runtime                    SMGraphK2Node_GraphPropertyNode_D87751C94EC87024D7461CA9E995FB4C_LD_Prop_6;// 0x1670(0x0048)
	struct FSMGraphProperty_Runtime                    SMGraphK2Node_GraphPropertyNode_D87751C94EC87024D7461CA9E995FB4C_LD_Prop_5;// 0x16B8(0x0048)
	struct FSMGraphProperty_Runtime                    SMGraphK2Node_GraphPropertyNode_D87751C94EC87024D7461CA9E995FB4C_LD_Prop_4;// 0x1700(0x0048)
	struct FSMGraphProperty_Runtime                    SMGraphK2Node_GraphPropertyNode_D87751C94EC87024D7461CA9E995FB4C_LD_Prop_3;// 0x1748(0x0048)
	struct FSMGraphProperty_Runtime                    SMGraphK2Node_GraphPropertyNode_D87751C94EC87024D7461CA9E995FB4C_LD_Prop_2;// 0x1790(0x0048)
	struct FSMGraphProperty_Runtime                    SMGraphK2Node_GraphPropertyNode_D87751C94EC87024D7461CA9E995FB4C_LD_Prop_1;// 0x17D8(0x0048)
	struct FSMGraphProperty_Runtime                    SMGraphK2Node_GraphPropertyNode_D87751C94EC87024D7461CA9E995FB4C_LD_Prop;// 0x1820(0x0048)
	TMap<struct FGameplayTag, struct FGameplayTag>     SquadMap;                                                 // 0x1868(0x0050) (Edit, BlueprintVisible, DisableEditOnInstance)
	struct FName                                       SquadBucketSequence;                                      // 0x18B8(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TMap<struct FGameplayTag, struct FGameplayTag>     SquadMapCommentator;                                      // 0x18C0(0x0050) (Edit, BlueprintVisible, DisableEditOnInstance)

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("SMBlueprintGeneratedClass DSM_DepotCompleteFirst.DSM_DepotCompleteFirst_C"));
		return ptr;
	}


	void SMGraphK2Node_GraphPropertyNode_D87751C94EC87024D7461CA9E995FB4C_DF7CC22DE6FE46E5F65D04F537E7042F();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_GraphPropertyNode_D87751C94EC87024D7461CA9E995FB4C_7029191DC382CD1DEADCCBBCD33EDE2E();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_GraphPropertyNode_D87751C94EC87024D7461CA9E995FB4C_26AE8674113BF0F399A68E15984CFCED();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_GraphPropertyNode_D87751C94EC87024D7461CA9E995FB4C_96B795C34CF8ECE4812C3463ABFBCDDF();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_GraphPropertyNode_D87751C94EC87024D7461CA9E995FB4C_DF7CC22DE6FE46E5F65D04F537E7042F_1();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_GraphPropertyNode_D87751C94EC87024D7461CA9E995FB4C_7029191DC382CD1DEADCCBBCD33EDE2E_1();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_GraphPropertyNode_D87751C94EC87024D7461CA9E995FB4C_26AE8674113BF0F399A68E15984CFCED_1();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_GraphPropertyNode_D87751C94EC87024D7461CA9E995FB4C_96B795C34CF8ECE4812C3463ABFBCDDF_1();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_GraphPropertyNode_D87751C94EC87024D7461CA9E995FB4C_DF7CC22DE6FE46E5F65D04F537E7042F_2();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_GraphPropertyNode_D87751C94EC87024D7461CA9E995FB4C_7029191DC382CD1DEADCCBBCD33EDE2E_2();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_GraphPropertyNode_D87751C94EC87024D7461CA9E995FB4C_26AE8674113BF0F399A68E15984CFCED_2();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_GraphPropertyNode_D87751C94EC87024D7461CA9E995FB4C_96B795C34CF8ECE4812C3463ABFBCDDF_2();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_StateEntryNode_D87751C94EC87024D7461CA9E995FB4C_Commentator_Map_Tag_685FE2C94519B08ABF1DF09E87A6F243();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_StateEntryNode_D87751C94EC87024D7461CA9E995FB4C_Commentator___First_Cashout_Of_The_round_8DAA431E46074E27B6E4B3825A67208F();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_StateEntryNode_D87751C94EC87024D7461CA9E995FB4C_Cohost_Map_Tag_534A99654A4BC3A8B38010823BD54242();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_StateEntryNode_D87751C94EC87024D7461CA9E995FB4C_CoHost___Answer_F845CE324BD5230060ED5FBF8BA244E7();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_StateEntryNode_D87751C94EC87024D7461CA9E995FB4C_Commentator___Generic_Answer_2E5EF8CD4FD2D70E34E7ED9C062EE88A();//Offset:Discovery.exe+0x327F8B0
	void ExecuteUbergraph_DSM_DepotCompleteFirst(int EntryPoint);//Offset:Discovery.exe+0x327F8B0
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
