#pragma once

//   SDK By:if

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace sdk
{
//---------------------------------------------------------------------------
// Classes
//---------------------------------------------------------------------------

// SMBlueprintGeneratedClass DSM_LocalWelcome.DSM_LocalWelcome_C
// 0x2310 (0x2A28 - 0x0718)
class UDSM_LocalWelcome_C : public UDialogueStateMachineInstance
{
public:
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                           // 0x0718(0x0008) (ZeroConstructor, Transient, DuplicateTransient)
	struct FSMTransition                               SMGraphK2Node_TransitionResultNode_5D82D0BB4F3314C9CB20CBB3725D4A34_LD_Prop_9;// 0x0720(0x0190)
	struct FSMTransition                               SMGraphK2Node_TransitionResultNode_5D82D0BB4F3314C9CB20CBB3725D4A34_LD_Prop_8;// 0x08B0(0x0190)
	struct FSMTransition                               SMGraphK2Node_TransitionResultNode_5D82D0BB4F3314C9CB20CBB3725D4A34_LD_Prop_7;// 0x0A40(0x0190)
	struct FSMTransition                               SMGraphK2Node_TransitionResultNode_5D82D0BB4F3314C9CB20CBB3725D4A34_LD_Prop_6;// 0x0BD0(0x0190)
	struct FSMTransition                               SMGraphK2Node_TransitionResultNode_5D82D0BB4F3314C9CB20CBB3725D4A34_LD_Prop_5;// 0x0D60(0x0190)
	struct FSMTransition                               SMGraphK2Node_TransitionResultNode_5D82D0BB4F3314C9CB20CBB3725D4A34_LD_Prop_4;// 0x0EF0(0x0190)
	struct FSMTransition                               SMGraphK2Node_TransitionResultNode_5D82D0BB4F3314C9CB20CBB3725D4A34_LD_Prop_3;// 0x1080(0x0190)
	struct FSMTransition                               SMGraphK2Node_TransitionResultNode_5D82D0BB4F3314C9CB20CBB3725D4A34_LD_Prop_2;// 0x1210(0x0190)
	struct FSMTransition                               SMGraphK2Node_TransitionResultNode_5D82D0BB4F3314C9CB20CBB3725D4A34_LD_Prop_1;// 0x13A0(0x0190)
	struct FSMTransition                               SMGraphK2Node_TransitionResultNode_5D82D0BB4F3314C9CB20CBB3725D4A34_LD_Prop;// 0x1530(0x0190)
	struct FSMState                                    SMGraphK2Node_StateEntryNode_5D82D0BB4F3314C9CB20CBB3725D4A34_LD_Prop_8;// 0x16C0(0x0188)
	struct FSMState                                    SMGraphK2Node_StateEntryNode_5D82D0BB4F3314C9CB20CBB3725D4A34_LD_Prop_7;// 0x1848(0x0188)
	struct FSMState                                    SMGraphK2Node_StateEntryNode_5D82D0BB4F3314C9CB20CBB3725D4A34_LD_Prop_6;// 0x19D0(0x0188)
	struct FSMState                                    SMGraphK2Node_StateEntryNode_5D82D0BB4F3314C9CB20CBB3725D4A34_LD_Prop_5;// 0x1B58(0x0188)
	struct FSMState                                    SMGraphK2Node_StateEntryNode_5D82D0BB4F3314C9CB20CBB3725D4A34_LD_Prop_4;// 0x1CE0(0x0188)
	struct FSMState                                    SMGraphK2Node_StateEntryNode_5D82D0BB4F3314C9CB20CBB3725D4A34_LD_Prop_3;// 0x1E68(0x0188)
	struct FSMState                                    SMGraphK2Node_StateEntryNode_5D82D0BB4F3314C9CB20CBB3725D4A34_LD_Prop_2;// 0x1FF0(0x0188)
	struct FSMState                                    SMGraphK2Node_StateEntryNode_5D82D0BB4F3314C9CB20CBB3725D4A34_LD_Prop_1;// 0x2178(0x0188)
	struct FSMState                                    SMGraphK2Node_StateEntryNode_5D82D0BB4F3314C9CB20CBB3725D4A34_LD_Prop;// 0x2300(0x0188)
	struct FSMGraphProperty_Runtime                    SMGraphK2Node_GraphPropertyNode_5D82D0BB4F3314C9CB20CBB3725D4A34_LD_Prop_19;// 0x2488(0x0048)
	struct FSMGraphProperty_Runtime                    SMGraphK2Node_GraphPropertyNode_5D82D0BB4F3314C9CB20CBB3725D4A34_LD_Prop_18;// 0x24D0(0x0048)
	struct FSMGraphProperty_Runtime                    SMGraphK2Node_GraphPropertyNode_5D82D0BB4F3314C9CB20CBB3725D4A34_LD_Prop_17;// 0x2518(0x0048)
	struct FSMGraphProperty_Runtime                    SMGraphK2Node_GraphPropertyNode_5D82D0BB4F3314C9CB20CBB3725D4A34_LD_Prop_16;// 0x2560(0x0048)
	struct FSMGraphProperty_Runtime                    SMGraphK2Node_GraphPropertyNode_5D82D0BB4F3314C9CB20CBB3725D4A34_LD_Prop_15;// 0x25A8(0x0048)
	struct FSMGraphProperty_Runtime                    SMGraphK2Node_GraphPropertyNode_5D82D0BB4F3314C9CB20CBB3725D4A34_LD_Prop_14;// 0x25F0(0x0048)
	struct FSMGraphProperty_Runtime                    SMGraphK2Node_GraphPropertyNode_5D82D0BB4F3314C9CB20CBB3725D4A34_LD_Prop_13;// 0x2638(0x0048)
	struct FSMGraphProperty_Runtime                    SMGraphK2Node_GraphPropertyNode_5D82D0BB4F3314C9CB20CBB3725D4A34_LD_Prop_12;// 0x2680(0x0048)
	struct FSMGraphProperty_Runtime                    SMGraphK2Node_GraphPropertyNode_5D82D0BB4F3314C9CB20CBB3725D4A34_LD_Prop_11;// 0x26C8(0x0048)
	struct FSMGraphProperty_Runtime                    SMGraphK2Node_GraphPropertyNode_5D82D0BB4F3314C9CB20CBB3725D4A34_LD_Prop_10;// 0x2710(0x0048)
	struct FSMGraphProperty_Runtime                    SMGraphK2Node_GraphPropertyNode_5D82D0BB4F3314C9CB20CBB3725D4A34_LD_Prop_9;// 0x2758(0x0048)
	struct FSMGraphProperty_Runtime                    SMGraphK2Node_GraphPropertyNode_5D82D0BB4F3314C9CB20CBB3725D4A34_LD_Prop_8;// 0x27A0(0x0048)
	struct FSMGraphProperty_Runtime                    SMGraphK2Node_GraphPropertyNode_5D82D0BB4F3314C9CB20CBB3725D4A34_LD_Prop_7;// 0x27E8(0x0048)
	struct FSMGraphProperty_Runtime                    SMGraphK2Node_GraphPropertyNode_5D82D0BB4F3314C9CB20CBB3725D4A34_LD_Prop_6;// 0x2830(0x0048)
	struct FSMGraphProperty_Runtime                    SMGraphK2Node_GraphPropertyNode_5D82D0BB4F3314C9CB20CBB3725D4A34_LD_Prop_5;// 0x2878(0x0048)
	struct FSMGraphProperty_Runtime                    SMGraphK2Node_GraphPropertyNode_5D82D0BB4F3314C9CB20CBB3725D4A34_LD_Prop_4;// 0x28C0(0x0048)
	struct FSMGraphProperty_Runtime                    SMGraphK2Node_GraphPropertyNode_5D82D0BB4F3314C9CB20CBB3725D4A34_LD_Prop_3;// 0x2908(0x0048)
	struct FSMGraphProperty_Runtime                    SMGraphK2Node_GraphPropertyNode_5D82D0BB4F3314C9CB20CBB3725D4A34_LD_Prop_2;// 0x2950(0x0048)
	struct FSMGraphProperty_Runtime                    SMGraphK2Node_GraphPropertyNode_5D82D0BB4F3314C9CB20CBB3725D4A34_LD_Prop_1;// 0x2998(0x0048)
	struct FSMGraphProperty_Runtime                    SMGraphK2Node_GraphPropertyNode_5D82D0BB4F3314C9CB20CBB3725D4A34_LD_Prop;// 0x29E0(0x0048)

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("SMBlueprintGeneratedClass DSM_LocalWelcome.DSM_LocalWelcome_C"));
		return ptr;
	}


	void SMGraphK2Node_GraphPropertyNode_5D82D0BB4F3314C9CB20CBB3725D4A34_DF7CC22DE6FE46E5F65D04F537E7042F();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_GraphPropertyNode_5D82D0BB4F3314C9CB20CBB3725D4A34_7029191DC382CD1DEADCCBBCD33EDE2E();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_GraphPropertyNode_5D82D0BB4F3314C9CB20CBB3725D4A34_26AE8674113BF0F399A68E15984CFCED();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_GraphPropertyNode_5D82D0BB4F3314C9CB20CBB3725D4A34_96B795C34CF8ECE4812C3463ABFBCDDF();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_GraphPropertyNode_5D82D0BB4F3314C9CB20CBB3725D4A34_DF7CC22DE6FE46E5F65D04F537E7042F_1();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_GraphPropertyNode_5D82D0BB4F3314C9CB20CBB3725D4A34_7029191DC382CD1DEADCCBBCD33EDE2E_1();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_GraphPropertyNode_5D82D0BB4F3314C9CB20CBB3725D4A34_26AE8674113BF0F399A68E15984CFCED_1();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_GraphPropertyNode_5D82D0BB4F3314C9CB20CBB3725D4A34_96B795C34CF8ECE4812C3463ABFBCDDF_1();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_GraphPropertyNode_5D82D0BB4F3314C9CB20CBB3725D4A34_DF7CC22DE6FE46E5F65D04F537E7042F_2();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_GraphPropertyNode_5D82D0BB4F3314C9CB20CBB3725D4A34_7029191DC382CD1DEADCCBBCD33EDE2E_2();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_GraphPropertyNode_5D82D0BB4F3314C9CB20CBB3725D4A34_26AE8674113BF0F399A68E15984CFCED_2();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_GraphPropertyNode_5D82D0BB4F3314C9CB20CBB3725D4A34_96B795C34CF8ECE4812C3463ABFBCDDF_2();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_GraphPropertyNode_5D82D0BB4F3314C9CB20CBB3725D4A34_DF7CC22DE6FE46E5F65D04F537E7042F_3();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_GraphPropertyNode_5D82D0BB4F3314C9CB20CBB3725D4A34_7029191DC382CD1DEADCCBBCD33EDE2E_3();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_GraphPropertyNode_5D82D0BB4F3314C9CB20CBB3725D4A34_26AE8674113BF0F399A68E15984CFCED_3();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_GraphPropertyNode_5D82D0BB4F3314C9CB20CBB3725D4A34_96B795C34CF8ECE4812C3463ABFBCDDF_3();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_GraphPropertyNode_5D82D0BB4F3314C9CB20CBB3725D4A34_D8D122E11884EA2DFA57CC200A9F947B();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_GraphPropertyNode_5D82D0BB4F3314C9CB20CBB3725D4A34_5F9B942E651394D5B53EB05F21FF4BCA();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_GraphPropertyNode_5D82D0BB4F3314C9CB20CBB3725D4A34_D8D122E11884EA2DFA57CC200A9F947B_1();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_GraphPropertyNode_5D82D0BB4F3314C9CB20CBB3725D4A34_5F9B942E651394D5B53EB05F21FF4BCA_1();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_StateEntryNode_5D82D0BB4F3314C9CB20CBB3725D4A34_IsFinalRoundOnKorea__C846D64C44318347BEFA05828A933435();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_StateEntryNode_5D82D0BB4F3314C9CB20CBB3725D4A34_Announcer___KnockoutOnKorea_8223D68944D5DE44B08ECE91C15544C1();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_StateEntryNode_5D82D0BB4F3314C9CB20CBB3725D4A34_Announcer___FinalRoundOnKorea_B3115A924C3C7A072877469AB6CD72AC();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_StateEntryNode_5D82D0BB4F3314C9CB20CBB3725D4A34_IsFinalRoundOnMonaco__ED39D8604ECC767FAA0313A84E1B5A7E();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_StateEntryNode_5D82D0BB4F3314C9CB20CBB3725D4A34_AnnouncerKnockoutRoundOnMonaco_1FE019F048A1CB38BBB909A364838B72();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_StateEntryNode_5D82D0BB4F3314C9CB20CBB3725D4A34_AnnouncerFinalRoundOnMonaco_4C345A85457D6F9AFF8C4CB063FFA0F5();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_StateEntryNode_5D82D0BB4F3314C9CB20CBB3725D4A34_Switch_on_map_name_505B76A8431C0F3251ED44A094ACD090();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_StateEntryNode_5D82D0BB4F3314C9CB20CBB3725D4A34_LocalWelcomeMonaco_B0E3DFFF4D1B06DA5A8730A244510C2D();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_StateEntryNode_5D82D0BB4F3314C9CB20CBB3725D4A34_LocalWelcomeSeoul_F1EA515D4700B3E3EA72ECB068C924D8();//Offset:Discovery.exe+0x327F8B0
	void ExecuteUbergraph_DSM_LocalWelcome(int EntryPoint);//Offset:Discovery.exe+0x327F8B0
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
