#pragma once

//   SDK By:if

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace sdk
{
//---------------------------------------------------------------------------
// Classes
//---------------------------------------------------------------------------

// SMBlueprintGeneratedClass DSM_MapIntroVideo.DSM_MapIntroVideo_C
// 0x1110 (0x1828 - 0x0718)
class UDSM_MapIntroVideo_C : public UDialogueStateMachineInstance
{
public:
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                           // 0x0718(0x0008) (ZeroConstructor, Transient, DuplicateTransient)
	struct FSMTransition                               SMGraphK2Node_TransitionResultNode_B7B744FB401903E942FF27BCDD796F84_LD_Prop_3;// 0x0720(0x0190)
	struct FSMTransition                               SMGraphK2Node_TransitionResultNode_B7B744FB401903E942FF27BCDD796F84_LD_Prop_2;// 0x08B0(0x0190)
	struct FSMTransition                               SMGraphK2Node_TransitionResultNode_B7B744FB401903E942FF27BCDD796F84_LD_Prop_1;// 0x0A40(0x0190)
	struct FSMTransition                               SMGraphK2Node_TransitionResultNode_B7B744FB401903E942FF27BCDD796F84_LD_Prop;// 0x0BD0(0x0190)
	struct FSMState                                    SMGraphK2Node_StateEntryNode_B7B744FB401903E942FF27BCDD796F84_LD_Prop_4;// 0x0D60(0x0188)
	struct FSMState                                    SMGraphK2Node_StateEntryNode_B7B744FB401903E942FF27BCDD796F84_LD_Prop_3;// 0x0EE8(0x0188)
	struct FSMState                                    SMGraphK2Node_StateEntryNode_B7B744FB401903E942FF27BCDD796F84_LD_Prop_2;// 0x1070(0x0188)
	struct FSMState                                    SMGraphK2Node_StateEntryNode_B7B744FB401903E942FF27BCDD796F84_LD_Prop_1;// 0x11F8(0x0188)
	struct FSMState                                    SMGraphK2Node_StateEntryNode_B7B744FB401903E942FF27BCDD796F84_LD_Prop;// 0x1380(0x0188)
	struct FSMGraphProperty_Runtime                    SMGraphK2Node_GraphPropertyNode_B7B744FB401903E942FF27BCDD796F84_LD_Prop_9;// 0x1508(0x0048)
	struct FSMGraphProperty_Runtime                    SMGraphK2Node_GraphPropertyNode_B7B744FB401903E942FF27BCDD796F84_LD_Prop_8;// 0x1550(0x0048)
	struct FSMGraphProperty_Runtime                    SMGraphK2Node_GraphPropertyNode_B7B744FB401903E942FF27BCDD796F84_LD_Prop_7;// 0x1598(0x0048)
	struct FSMGraphProperty_Runtime                    SMGraphK2Node_GraphPropertyNode_B7B744FB401903E942FF27BCDD796F84_LD_Prop_6;// 0x15E0(0x0048)
	struct FSMGraphProperty_Runtime                    SMGraphK2Node_GraphPropertyNode_B7B744FB401903E942FF27BCDD796F84_LD_Prop_5;// 0x1628(0x0048)
	struct FSMGraphProperty_Runtime                    SMGraphK2Node_GraphPropertyNode_B7B744FB401903E942FF27BCDD796F84_LD_Prop_4;// 0x1670(0x0048)
	struct FSMGraphProperty_Runtime                    SMGraphK2Node_GraphPropertyNode_B7B744FB401903E942FF27BCDD796F84_LD_Prop_3;// 0x16B8(0x0048)
	struct FSMGraphProperty_Runtime                    SMGraphK2Node_GraphPropertyNode_B7B744FB401903E942FF27BCDD796F84_LD_Prop_2;// 0x1700(0x0048)
	struct FSMGraphProperty_Runtime                    SMGraphK2Node_GraphPropertyNode_B7B744FB401903E942FF27BCDD796F84_LD_Prop_1;// 0x1748(0x0048)
	struct FSMGraphProperty_Runtime                    SMGraphK2Node_GraphPropertyNode_B7B744FB401903E942FF27BCDD796F84_LD_Prop;// 0x1790(0x0048)
	TMap<struct FGameplayTag, struct FGameplayTag>     MapTagMap;                                                // 0x17D8(0x0050) (Edit, BlueprintVisible, DisableEditOnInstance)

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("SMBlueprintGeneratedClass DSM_MapIntroVideo.DSM_MapIntroVideo_C"));
		return ptr;
	}


	void SMGraphK2Node_GraphPropertyNode_B7B744FB401903E942FF27BCDD796F84_DF7CC22DE6FE46E5F65D04F537E7042F();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_GraphPropertyNode_B7B744FB401903E942FF27BCDD796F84_7029191DC382CD1DEADCCBBCD33EDE2E();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_GraphPropertyNode_B7B744FB401903E942FF27BCDD796F84_26AE8674113BF0F399A68E15984CFCED();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_GraphPropertyNode_B7B744FB401903E942FF27BCDD796F84_96B795C34CF8ECE4812C3463ABFBCDDF();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_GraphPropertyNode_B7B744FB401903E942FF27BCDD796F84_DF7CC22DE6FE46E5F65D04F537E7042F_1();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_GraphPropertyNode_B7B744FB401903E942FF27BCDD796F84_7029191DC382CD1DEADCCBBCD33EDE2E_1();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_GraphPropertyNode_B7B744FB401903E942FF27BCDD796F84_26AE8674113BF0F399A68E15984CFCED_1();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_GraphPropertyNode_B7B744FB401903E942FF27BCDD796F84_96B795C34CF8ECE4812C3463ABFBCDDF_1();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_GraphPropertyNode_B7B744FB401903E942FF27BCDD796F84_2CBD9EB82C7B7C2A22E7305E5262474D();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_GraphPropertyNode_B7B744FB401903E942FF27BCDD796F84_A20978DA60E5652D4C2282FE857519F5();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_StateEntryNode_B7B744FB401903E942FF27BCDD796F84_What_Map_987ABF3F4A59000A56FBE3942DDC1271();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_StateEntryNode_B7B744FB401903E942FF27BCDD796F84_Commentator___Tournament_Intro_Video_E0DC33414A82BD1B35CE1DAB7003EEDC();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_StateEntryNode_B7B744FB401903E942FF27BCDD796F84_Is_Final_Round_444768C34DE3AA9F72CD10BEB2D29479();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_StateEntryNode_B7B744FB401903E942FF27BCDD796F84_Commentator___Final_Intro_Video_Map_Agnostic_C0D29CA04D4F2CF414FE81A41ECCD16E();//Offset:Discovery.exe+0x327F8B0
	void SMGraphK2Node_StateEntryNode_B7B744FB401903E942FF27BCDD796F84_Wait_952B25F240F5E1C332B29AAF0AE9CACF();//Offset:Discovery.exe+0x327F8B0
	void ExecuteUbergraph_DSM_MapIntroVideo(int EntryPoint);//Offset:Discovery.exe+0x327F8B0
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
