#pragma once

//   SDK By:if

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace sdk
{
//---------------------------------------------------------------------------
// Classes
//---------------------------------------------------------------------------

// Class EmbarkFXDirector.EmbarkFXDirectorDecalComponent
// 0x0000 (0x0320 - 0x0320)
class UEmbarkFXDirectorDecalComponent : public UDecalComponent
{
public:

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class EmbarkFXDirector.EmbarkFXDirectorDecalComponent"));
		return ptr;
	}

};


// Class EmbarkFXDirector.EmbarkFXDirector
// 0x0290 (0x02C0 - 0x0030)
class UEmbarkFXDirector : public UWorldSubsystem
{
public:
	int                                                MaxCost_PrimaryTick;                                      // 0x0030(0x0004) (Edit, ZeroConstructor, Config, IsPlainOldData)
	int                                                MaxCost_SecondaryTick;                                    // 0x0034(0x0004) (Edit, ZeroConstructor, Config, IsPlainOldData)
	int                                                MaxCostPerTask;                                           // 0x0038(0x0004) (Edit, ZeroConstructor, Config, IsPlainOldData)
	int                                                MaxCuesPerInstance;                                       // 0x003C(0x0004) (Edit, ZeroConstructor, Config, IsPlainOldData)
	float                                              DefaultRelevantTimeSeconds;                               // 0x0040(0x0004) (Edit, ZeroConstructor, Config, IsPlainOldData)
	unsigned char                                      UnknownData00[0x27C];                                     // 0x0044(0x027C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class EmbarkFXDirector.EmbarkFXDirector"));
		return ptr;
	}

};


// Class EmbarkFXDirector.EmbarkFXDirectorStatics
// 0x0000 (0x0028 - 0x0028)
class UEmbarkFXDirectorStatics : public UBlueprintFunctionLibrary
{
public:

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class EmbarkFXDirector.EmbarkFXDirectorStatics"));
		return ptr;
	}


	struct FEmbarkFXCue STATIC_UpdateCue_GetRef(class UObject* ContextObject, const struct FEmbarkFXHandle& Handle, struct FEmbarkFXDirectorContext* Context);//Offset:Discovery.exe+0x1986E70
	void STATIC_StopFX(class UObject* ContextObject, float FadeOutSeconds, bool bImmediate, struct FEmbarkFXHandle* Handle);//Offset:Discovery.exe+0x1989170
