#pragma once

//   SDK By:if

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace sdk
{
//---------------------------------------------------------------------------
// Enums
//---------------------------------------------------------------------------

// Enum EmbarkApiGateway.EApiGatewayDiscoveryJoinTournamentStatus
enum class EApiGatewayDiscoveryJoinTournamentStatus : uint8_t
{
	JOIN_TOURNAMENT_STATUS_UNSPECIFIED = 0,
	JOIN_TOURNAMENT_STATUS_PLAYING = 1,
	JOIN_TOURNAMENT_STATUS_FINISHED = 2,
	JOIN_TOURNAMENT_STATUS_MAX     = 3
};


// Enum EmbarkApiGateway.EApiGatewayDiscoveryTournamentMatchStatus
enum class EApiGatewayDiscoveryTournamentMatchStatus : uint8_t
{
	MATCH_STATUS_UNSPECIFIED       = 0,
	MATCH_STATUS_PENDING           = 1,
	MATCH_STATUS_CONNECTING        = 2,
	MATCH_STATUS_PLAYING           = 3,
	MATCH_STATUS_FINISHED          = 4,
	MATCH_STATUS_ABANDONED         = 5,
	MATCH_STATUS_FAILED            = 6,
	MATCH_STATUS_EXPIRED           = 7,
	MATCH_STATUS_SKIPPED           = 8,
	MATCH_STATUS_MAX               = 9
};


// Enum EmbarkApiGateway.EApiGatewayDiscoveryTournamentTeamResultValue
enum class EApiGatewayDiscoveryTournamentTeamResultValue : uint8_t
{
	TOURNAMENT_TEAM_RESULT_UNSPECIFIED = 0,
	TOURNAMENT_TEAM_RESULT_WIN     = 1,
	TOURNAMENT_TEAM_RESULT_LOSS    = 2,
	TOURNAMENT_TEAM_RESULT_MAX     = 3
};


// Enum EmbarkApiGateway.EApiGatewaySharedSurveySettingsType
enum class EApiGatewaySharedSurveySettingsType : uint8_t
{
	EARLYFEEDBACK                  = 0,
	HEALTHPOLL                     = 1,
	BETAIMPRESSIONS                = 2,
	EApiGatewaySharedSurveySettingsType_MAX = 3
};


// Enum EmbarkApiGateway.EApiGatewayDiscoveryServerSanctionType
enum class EApiGatewayDiscoveryServerSanctionType : uint8_t
{
	UNSPECIFIED                    = 0,
	TOURNAMENT_ABANDON             = 1,
	EApiGatewayDiscoveryServerSanctionType_MAX = 2
};


// Enum EmbarkApiGateway.EApiGatewayDiscoverySanctionType
enum class EApiGatewayDiscoverySanctionType : uint8_t
{
	UNSPECIFIED                    = 0,
	TOURNAMENT_ABANDON             = 1,
	EApiGatewayDiscoverySanctionType_MAX = 2
};


// Enum EmbarkApiGateway.EApiGatewayDiscoveryGameStoreProvider
enum class EApiGatewayDiscoveryGameStoreProvider : uint8_t
{
	UNSPECIFIED                    = 0,
	EMBARK                         = 1,
	EPIC                           = 2,
	STEAM                          = 3,
	MICROSOFT                      = 4,
	PLAYSTATION                    = 5,
	EApiGatewayDiscoveryGameStoreProvider_MAX = 6
};


// Enum EmbarkApiGateway.EApiGatewayDiscoveryDistributionPlatform
enum class EApiGatewayDiscoveryDistributionPlatform : uint8_t
{
	UNSPECIFIED                    = 0,
	EPIC                           = 1,
	STEAM                          = 2,
	XBOX                           = 3,
	PLAYSTATION                    = 4,
	EApiGatewayDiscoveryDistributionPlatform_MAX = 5
};


// Enum EmbarkApiGateway.EApiGatewayDiscoveryGetGameStoreAccessTokenRequestType
enum class EApiGatewayDiscoveryGetGameStoreAccessTokenRequestType : uint8_t
{
	COLLECTION                     = 0,
	EApiGatewayDiscoveryGetGameStoreAccessTokenRequestType_MAX = 1
};


// Enum EmbarkApiGateway.EApiGatewayDiscoveryRewardItemType
enum class EApiGatewayDiscoveryRewardItemType : uint8_t
{
	UNKNOWN                        = 0,
	SCHEMATIC                      = 1,
	EApiGatewayDiscoveryRewardItemType_MAX = 2
};


// Enum EmbarkApiGateway.EApiGatewayPioneerAdminResetResource
enum class EApiGatewayPioneerAdminResetResource : uint8_t
{
	RESET_ALL                      = 0,
	RESET_INVENTORY_ITEMS          = 1,
	RESET_QUESTS                   = 2,
	RESET_OFFERS                   = 3,
	RESET_BUCKETS                  = 4,
	RESET_MAX                      = 5
};


// Enum EmbarkApiGateway.EApiGatewayPioneerAdminQuestState
enum class EApiGatewayPioneerAdminQuestState : uint8_t
{
	QUEST_STATE_UNSPECIFIED        = 0,
	QUEST_STATE_AWAITING           = 1,
	QUEST_STATE_ACCEPTED           = 2,
	QUEST_STATE_COMPLETED          = 3,
	QUEST_STATE_MAX                = 4
};


// Enum EmbarkApiGateway.EApiGatewayPioneerGameStoreProvider
enum class EApiGatewayPioneerGameStoreProvider : uint8_t
{
	EMBARK                         = 0,
	EPIC                           = 1,
	STEAM                          = 2,
	MICROSOFT                      = 3,
	PLAYSTATION                    = 4,
	EApiGatewayPioneerGameStoreProvider_MAX = 5
};


// Enum EmbarkApiGateway.EApiGatewayPioneerQuestCadence
enum class EApiGatewayPioneerQuestCadence : uint8_t
{
	UNKNOWN                        = 0,
	DAILY                          = 1,
	WEEKLY                         = 2,
	NARRATIVE                      = 3,
	EApiGatewayPioneerQuestCadence_MAX = 4
};


// Enum EmbarkApiGateway.EApiGatewayPioneerQuestDescriptionObjectiveType
enum class EApiGatewayPioneerQuestDescriptionObjectiveType : uint8_t
{
	UNKNOWN                        = 0,
	DELIVER                        = 1,
	OBTAIN                         = 2,
	DESTROY                        = 3,
	VISIT                          = 4,
	GAMESERVER                     = 5,
	EApiGatewayPioneerQuestDescriptionObjectiveType_MAX = 6
};


// Enum EmbarkApiGateway.EApiGatewayPioneerQuestState
enum class EApiGatewayPioneerQuestState : uint8_t
{
	UNKNOWN                        = 0,
	AWAITING                       = 1,
	ACCEPTED                       = 2,
	COMPLETED                      = 3,
	EApiGatewayPioneerQuestState_MAX = 4
};


// Enum EmbarkApiGateway.EApiGatewayPioneerRewardItemType
enum class EApiGatewayPioneerRewardItemType : uint8_t
{
	UNKNOWN                        = 0,
	SCHEMATIC                      = 1,
	CURRENCY                       = 2,
	CHARACTER                      = 3,
	CHARACTER_SKIN                 = 4,
	CHARACTER_MILESTONE            = 5,
	CHARACTER_TALENT               = 6,
	EApiGatewayPioneerRewardItemType_MAX = 7
};


// Enum EmbarkApiGateway.EApiGatewaySharedGameStoreType
enum class EApiGatewaySharedGameStoreType : uint8_t
{
	UNSPECIFIED                    = 0,
	EPIC                           = 1,
	STEAM                          = 2,
	EApiGatewaySharedGameStoreType_MAX = 3
};


// Enum EmbarkApiGateway.EApiGatewaySharedRewardItemType
enum class EApiGatewaySharedRewardItemType : uint8_t
{
	UNKNOWN                        = 0,
	SCHEMATIC                      = 1,
	CURRENCY                       = 2,
	CHARACTER                      = 3,
	CHARACTER_SKIN                 = 4,
	CHARACTER_MILESTONE            = 5,
	CHARACTER_TALENT               = 6,
	EApiGatewaySharedRewardItemType_MAX = 7
};


// Enum EmbarkApiGateway.EApiGatewaySharedFriendshipInfoFriendshipType
enum class EApiGatewaySharedFriendshipInfoFriendshipType : uint8_t
{
	UNKNOWN                        = 0,
	MUTUAL                         = 1,
	NON_MUTUAL_OUTGOING            = 2,
	NON_MUTUAL_INCOMING            = 3,
	EApiGatewaySharedFriendshipInfoFriendshipType_MAX = 4
};


// Enum EmbarkApiGateway.EApiGatewaySharedMatchmakingPlatform
enum class EApiGatewaySharedMatchmakingPlatform : uint8_t
{
	ALL                            = 0,
	XBOX                           = 1,
	PLAYSTATION                    = 2,
	PC                             = 3,
	EApiGatewaySharedMatchmakingPlatform_MAX = 4
};


// Enum EmbarkApiGateway.EApiGatewaySharedMatchmakingMatchState
enum class EApiGatewaySharedMatchmakingMatchState : uint8_t
{
	UNSPECIFIED                    = 0,
	MATCHING                       = 1,
	COMPLETED                      = 2,
	FAILED                         = 3,
	EApiGatewaySharedMatchmakingMatchState_MAX = 4
};


// Enum EmbarkApiGateway.EApiGatewaySharedMatchRedirectTarget
enum class EApiGatewaySharedMatchRedirectTarget : uint8_t
{
	TOURNAMENTS                    = 0,
	GAMESERVER                     = 1,
	EApiGatewaySharedMatchRedirectTarget_MAX = 2
};


// Enum EmbarkApiGateway.EApiGatewaySharedMatchTimeEstimateState
enum class EApiGatewaySharedMatchTimeEstimateState : uint8_t
{
	NOT_AVAILABLE                  = 0,
	VALID                          = 1,
	FAULTY                         = 2,
	NO_DATA                        = 3,
	EApiGatewaySharedMatchTimeEstimateState_MAX = 4
};


// Enum EmbarkApiGateway.EApiGatewaySharedGameserverState
enum class EApiGatewaySharedGameserverState : uint8_t
{
	UNSPECIFIED                    = 0,
	WAITING                        = 1,
	AVAILABLE                      = 2,
	EXPIRED                        = 3,
	EApiGatewaySharedGameserverState_MAX = 4
};


// Enum EmbarkApiGateway.EApiErrorCode
enum class EApiErrorCode : uint8_t
{
	Unknown                        = 0,
	Continue                       = 1,
	SwitchProtocol                 = 2,
	Ok                             = 3,
	Created                        = 4,
	Accepted                       = 5,
	Partial                        = 6,
	NoContent                      = 7,
	ResetContent                   = 8,
	PartialContent                 = 9,
	Ambiguous                      = 10,
	Moved                          = 11,
	Redirect                       = 12,
	RedirectMethod                 = 13,
	NotModified                    = 14,
	UseProxy                       = 15,
	RedirectKeepVerb               = 16,
	BadRequest                     = 17,
	Denied                         = 18,
	PaymentReq                     = 19,
	Forbidden                      = 20,
	NotFound                       = 21,
	BadMethod                      = 22,
	NoneAcceptable                 = 23,
	ProxyAuthReq                   = 24,
	RequestTimeout                 = 25,
	Conflict                       = 26,
	Gone                           = 27,
	LengthRequired                 = 28,
	PrecondFailed                  = 29,
	RequestTooLarge                = 30,
	UriTooLong                     = 31,
	UnsupportedMedia               = 32,
	TooManyRequests                = 33,
	RetryWith                      = 34,
	ClientClosedRequest            = 35,
	ServerError                    = 36,
	NotSupported                   = 37,
	BadGateway                     = 38,
	ServiceUnavail                 = 39,
	GatewayTimeout                 = 40,
	VersionNotSup                  = 41,
	EApiErrorCode_MAX              = 42
};



//---------------------------------------------------------------------------
// Script Structs
//---------------------------------------------------------------------------

// ScriptStruct EmbarkApiGateway.EmbarkUserHandle
// 0x0010
struct FEmbarkUserHandle
{
	unsigned char                                      UnknownData00[0x10];                                      // 0x0000(0x0010) MISSED OFFSET
};

// ScriptStruct EmbarkApiGateway.ApiGatewayDiscoveryServerUserActiveItemRank
// 0x0020
struct FApiGatewayDiscoveryServerUserActiveItemRank
{
	struct FEmbarkUserHandle                           UserId;                                                   // 0x0000(0x0010)
	struct FString                                     RankBucketId;                                             // 0x0010(0x0010) (ZeroConstructor)
};

// ScriptStruct EmbarkApiGateway.ApiGatewayDiscoveryPlayerPersistenceContestantPackItemAttachment
// 0x0020
struct FApiGatewayDiscoveryPlayerPersistenceContestantPackItemAttachment
{
	struct FString                                     ItemInstanceId;                                           // 0x0000(0x0010) (ZeroConstructor)
	TArray<struct FString>                             AttachedItemInstanceIds;                                  // 0x0010(0x0010) (ZeroConstructor)
};

// ScriptStruct EmbarkApiGateway.ApiGatewayDiscoveryPlayerPersistenceContestantPackSlot
// 0x0020
struct FApiGatewayDiscoveryPlayerPersistenceContestantPackSlot
{
	struct FString                                     SlotName;                                                 // 0x0000(0x0010) (ZeroConstructor)
	TArray<struct FString>                             ItemInstanceIds;                                          // 0x0010(0x0010) (ZeroConstructor)
};

// ScriptStruct EmbarkApiGateway.ApiGatewayDiscoveryPlayerPersistenceContestantPack
// 0x00D8
struct FApiGatewayDiscoveryPlayerPersistenceContestantPack
{
	struct FString                                     InstanceId;                                               // 0x0000(0x0010) (ZeroConstructor)
	int64_t                                            GameAssetId;                                              // 0x0010(0x0008) (ZeroConstructor, IsPlainOldData)
	struct FString                                     Title;                                                    // 0x0018(0x0010) (ZeroConstructor)
	struct FString                                     Etag;                                                     // 0x0028(0x0010) (ZeroConstructor)
	struct FString                                     ArchetypeInstanceId;                                      // 0x0038(0x0010) (ZeroConstructor)
	TArray<struct FString>                             FirstHandInstanceIds;                                     // 0x0048(0x0010) (ZeroConstructor)
	TArray<struct FString>                             ReservedInstanceIds;                                      // 0x0058(0x0010) (ZeroConstructor)
	TArray<struct FString>                             CustomizationItemInstanceIds;                             // 0x0068(0x0010) (ZeroConstructor)
	TArray<struct FApiGatewayDiscoveryPlayerPersistenceContestantPackItemAttachment> ItemAttachments;                                          // 0x0078(0x0010) (ZeroConstructor)
	struct FString                                     SprayItemInstanceId;                                      // 0x0088(0x0010) (ZeroConstructor)
	TArray<struct FString>                             ExpressionItemInstanceIds;                                // 0x0098(0x0010) (ZeroConstructor)
	TArray<struct FString>                             SprayWheelItemInstanceIds;                                // 0x00A8(0x0010) (ZeroConstructor)
	TArray<struct FString>                             EmoteWheelItemInstanceIds;                                // 0x00B8(0x0010) (ZeroConstructor)
	TArray<struct FApiGatewayDiscoveryPlayerPersistenceContestantPackSlot> Slots;                                                    // 0x00C8(0x0010) (ZeroConstructor)
};

// ScriptStruct EmbarkApiGateway.ApiGatewayDiscoveryGameServer
// 0x0048
struct FApiGatewayDiscoveryGameServer
{
	struct FString                                     Name;                                                     // 0x0000(0x0010) (ZeroConstructor)
	struct FString                                     Host;                                                     // 0x0010(0x0010) (ZeroConstructor)
	int                                                Port;                                                     // 0x0020(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0024(0x0004) MISSED OFFSET
	struct FString                                     SecretKey;                                                // 0x0028(0x0010) (ZeroConstructor)
	struct FString                                     RoutingToken;                                             // 0x0038(0x0010) (ZeroConstructor)
};

// ScriptStruct EmbarkApiGateway.ApiGatewayDiscoveryTournamentPlayer
// 0x0020
struct FApiGatewayDiscoveryTournamentPlayer
{
	struct FString                                     ID;                                                       // 0x0000(0x0010) (ZeroConstructor)
	struct FString                                     Name;                                                     // 0x0010(0x0010) (ZeroConstructor)
};

// ScriptStruct EmbarkApiGateway.ApiGatewayDiscoveryTournamentTeam
// 0x0018
struct FApiGatewayDiscoveryTournamentTeam
{
	int                                                TeamIndex;                                                // 0x0000(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                BrandIndex;                                               // 0x0004(0x0004) (ZeroConstructor, IsPlainOldData)
	TArray<struct FApiGatewayDiscoveryTournamentPlayer> Players;                                                  // 0x0008(0x0010) (ZeroConstructor)
};

// ScriptStruct EmbarkApiGateway.ApiGatewayDiscoveryTournamentTeamResult
// 0x0001
struct FApiGatewayDiscoveryTournamentTeamResult
{
	unsigned char                                      UnknownData00[0x1];                                       // 0x0000(0x0001) MISSED OFFSET
};

// ScriptStruct EmbarkApiGateway.ApiGatewayDiscoveryTournamentMatch
// 0x0050
struct FApiGatewayDiscoveryTournamentMatch
{
	int                                                Tier;                                                     // 0x0000(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                Position;                                                 // 0x0004(0x0004) (ZeroConstructor, IsPlainOldData)
	TArray<int>                                        Teams;                                                    // 0x0008(0x0010) (ZeroConstructor)
	TArray<struct FApiGatewayDiscoveryTournamentTeamResult> Results;                                                  // 0x0018(0x0010) (ZeroConstructor)
	int                                                ExpectedEndTime;                                          // 0x0028(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                ExpectedWinningTeams;                                     // 0x002C(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                ExpectedPlayingTeams;                                     // 0x0030(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0034(0x0004) MISSED OFFSET
	struct FString                                     ProgressData;                                             // 0x0038(0x0010) (ZeroConstructor)
	unsigned char                                      UnknownData01[0x8];                                       // 0x0048(0x0008) MISSED OFFSET
};

// ScriptStruct EmbarkApiGateway.ApiGatewayDiscoveryTournamentTier
// 0x0018
struct FApiGatewayDiscoveryTournamentTier
{
	TArray<int>                                        Matches;                                                  // 0x0000(0x0010) (ZeroConstructor)
	int                                                Tier;                                                     // 0x0010(0x0004) (ZeroConstructor, IsPlainOldData)
	bool                                               IsFirstTier;                                              // 0x0014(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               IsFinalTier;                                              // 0x0015(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               IsQualifyingTier;                                         // 0x0016(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x1];                                       // 0x0017(0x0001) MISSED OFFSET
};

// ScriptStruct EmbarkApiGateway.ApiGatewaySharedServerTweakables
// 0x0030
struct FApiGatewaySharedServerTweakables
{
	struct FString                                     ObjectPathName;                                           // 0x0000(0x0010) (ZeroConstructor)
	struct FString                                     PropertyName;                                             // 0x0010(0x0010) (ZeroConstructor)
	struct FString                                     PropertyValue;                                            // 0x0020(0x0010) (ZeroConstructor)
};

// ScriptStruct EmbarkApiGateway.ApiGatewayDiscoveryRoundStats
// 0x0090
struct FApiGatewayDiscoveryRoundStats
{
	struct FString                                     TournamentId;                                             // 0x0000(0x0010) (ZeroConstructor)
	struct FString                                     RoundId;                                                  // 0x0010(0x0010) (ZeroConstructor)
	struct FString                                     SquadName;                                                // 0x0020(0x0010) (ZeroConstructor)
	int64_t                                            Kills;                                                    // 0x0030(0x0008) (ZeroConstructor, IsPlainOldData)
	int64_t                                            Deaths;                                                   // 0x0038(0x0008) (ZeroConstructor, IsPlainOldData)
	int64_t                                            Dbnos;                                                    // 0x0040(0x0008) (ZeroConstructor, IsPlainOldData)
	int64_t                                            Respawns;                                                 // 0x0048(0x0008) (ZeroConstructor, IsPlainOldData)
	float                                              DamageDone;                                               // 0x0050(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0054(0x0004) MISSED OFFSET
	int64_t                                            RevivesDone;                                              // 0x0058(0x0008) (ZeroConstructor, IsPlainOldData)
	int64_t                                            RespawnsDone;                                             // 0x0060(0x0008) (ZeroConstructor, IsPlainOldData)
	struct FString                                     MapVariant;                                               // 0x0068(0x0010) (ZeroConstructor)
	bool                                               RoundWon;                                                 // 0x0078(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               TournamentWon;                                            // 0x0079(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x6];                                       // 0x007A(0x0006) MISSED OFFSET
	int64_t                                            StartTime;                                                // 0x0080(0x0008) (ZeroConstructor, IsPlainOldData)
	int64_t                                            EndTime;                                                  // 0x0088(0x0008) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct EmbarkApiGateway.ApiGatewayDiscoveryRoundStatSummary
// 0x01E0
struct FApiGatewayDiscoveryRoundStatSummary
{
	int64_t                                            Kills;                                                    // 0x0000(0x0008) (ZeroConstructor, IsPlainOldData)
	int64_t                                            Deaths;                                                   // 0x0008(0x0008) (ZeroConstructor, IsPlainOldData)
	TMap<struct FString, int64_t>                      KillsPerItem;                                             // 0x0010(0x0050)
	TMap<struct FString, float>                        DamagePerItem;                                            // 0x0060(0x0050)
	int64_t                                            TimePlayed;                                               // 0x00B0(0x0008) (ZeroConstructor, IsPlainOldData)
	TMap<struct FString, int64_t>                      TimePlayedPerArchetype;                                   // 0x00B8(0x0050)
	float                                              RoundWinRate;                                             // 0x0108(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x010C(0x0004) MISSED OFFSET
	TMap<struct FString, float>                        RoundWinRatePerArchetype;                                 // 0x0110(0x0050)
	float                                              TournamentWinRate;                                        // 0x0160(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x0164(0x0004) MISSED OFFSET
	TMap<struct FString, float>                        TournamentWinRatePerArchetype;                            // 0x0168(0x0050)
	int64_t                                            HighestFameAmount;                                        // 0x01B8(0x0008) (ZeroConstructor, IsPlainOldData)
	int64_t                                            RoundsPlayed;                                             // 0x01C0(0x0008) (ZeroConstructor, IsPlainOldData)
	int64_t                                            RoundsCompleted;                                          // 0x01C8(0x0008) (ZeroConstructor, IsPlainOldData)
	int64_t                                            RevivesDone;                                              // 0x01D0(0x0008) (ZeroConstructor, IsPlainOldData)
	int64_t                                            TotalCashOut;                                             // 0x01D8(0x0008) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct EmbarkApiGateway.ApiGatewayDiscoveryGetRoundStatSummaryResponse
// 0x05A0
struct FApiGatewayDiscoveryGetRoundStatSummaryResponse
{
	struct FApiGatewayDiscoveryRoundStatSummary        Casual;                                                   // 0x0000(0x01E0)
	struct FApiGatewayDiscoveryRoundStatSummary        Ranked;                                                   // 0x01E0(0x01E0)
	struct FApiGatewayDiscoveryRoundStatSummary        Total;                                                    // 0x03C0(0x01E0)
};

// ScriptStruct EmbarkApiGateway.ApiGatewaySharedSurveySettings
// 0x0020
struct FApiGatewaySharedSurveySettings
{
	struct FString                                     URL;                                                      // 0x0000(0x0010) (ZeroConstructor)
	bool                                               IsActive;                                                 // 0x0010(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0011(0x0003) MISSED OFFSET
	int                                                Rounds;                                                   // 0x0014(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x8];                                       // 0x0018(0x0008) MISSED OFFSET
};

// ScriptStruct EmbarkApiGateway.ApiGatewaySharedGetSurveySettingsResponse
// 0x0010
struct FApiGatewaySharedGetSurveySettingsResponse
{
	TArray<struct FApiGatewaySharedSurveySettings>     Surveys;                                                  // 0x0000(0x0010) (ZeroConstructor)
};

// ScriptStruct EmbarkApiGateway.ApiGatewayDiscoveryServerUserRequest
// 0x0010
struct FApiGatewayDiscoveryServerUserRequest
{
	TArray<struct FEmbarkUserHandle>                   UserIds;                                                  // 0x0000(0x0010) (ZeroConstructor)
};

// ScriptStruct EmbarkApiGateway.ApiGatewayDiscoveryServerTweakables
// 0x0030
struct FApiGatewayDiscoveryServerTweakables
{
	struct FString                                     ObjectPathName;                                           // 0x0000(0x0010) (ZeroConstructor)
	struct FString                                     PropertyName;                                             // 0x0010(0x0010) (ZeroConstructor)
	struct FString                                     PropertyValue;                                            // 0x0020(0x0010) (ZeroConstructor)
};

// ScriptStruct EmbarkApiGateway.ApiGatewayDiscoveryServerTweakablesRequest
// 0x0010
struct FApiGatewayDiscoveryServerTweakablesRequest
{
	struct FString                                     ArtifactId;                                               // 0x0000(0x0010) (ZeroConstructor)
};

// ScriptStruct EmbarkApiGateway.ApiGatewayDiscoveryServerTweakablesResponse
// 0x0010
struct FApiGatewayDiscoveryServerTweakablesResponse
{
	TArray<struct FApiGatewayDiscoveryServerTweakables> Tweakables;                                               // 0x0000(0x0010) (ZeroConstructor)
};

// ScriptStruct EmbarkApiGateway.ApiGatewayDiscoveryServerAbandonPlayerRequest
// 0x0030
struct FApiGatewayDiscoveryServerAbandonPlayerRequest
{
	struct FEmbarkUserHandle                           UserId;                                                   // 0x0000(0x0010)
	int64_t                                            TimeOfAbandon;                                            // 0x0010(0x0008) (ZeroConstructor, IsPlainOldData)
	bool                                               ImposeSanction;                                           // 0x0018(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0019(0x0007) MISSED OFFSET
	struct FString                                     GameServer;                                               // 0x0020(0x0010) (ZeroConstructor)
};

// ScriptStruct EmbarkApiGateway.ApiGatewayDiscoveryServerAbandonPlayerRequestV2
// 0x0040
struct FApiGatewayDiscoveryServerAbandonPlayerRequestV2
{
	struct FString                                     TournamentId;                                             // 0x0000(0x0010) (ZeroConstructor)
	struct FEmbarkUserHandle                           UserId;                                                   // 0x0010(0x0010)
	int64_t                                            TimeOfAbandon;                                            // 0x0020(0x0008) (ZeroConstructor, IsPlainOldData)
	bool                                               ImposeSanction;                                           // 0x0028(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0029(0x0007) MISSED OFFSET
	struct FString                                     GameServer;                                               // 0x0030(0x0010) (ZeroConstructor)
};

// ScriptStruct EmbarkApiGateway.ApiGatewayDiscoveryServerAbandonPlayerResponse
// 0x0008
struct FApiGatewayDiscoveryServerAbandonPlayerResponse
{
	int64_t                                            SanctionDuration;                                         // 0x0000(0x0008) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct EmbarkApiGateway.ApiGatewayDiscoveryServerKeyValuePair
// 0x0020
struct FApiGatewayDiscoveryServerKeyValuePair
{
	struct FString                                     Key;                                                      // 0x0000(0x0010) (ZeroConstructor)
	struct FString                                     Value;                                                    // 0x0010(0x0010) (ZeroConstructor)
};

// ScriptStruct EmbarkApiGateway.ApiGatewayDiscoveryServerReportMatchResultRequest
// 0x0050
struct FApiGatewayDiscoveryServerReportMatchResultRequest
{
	struct FString                                     TournamentId;                                             // 0x0000(0x0010) (ZeroConstructor)
	struct FString                                     MatchId;                                                  // 0x0010(0x0010) (ZeroConstructor)
	TArray<int>                                        WinningTeams;                                             // 0x0020(0x0010) (ZeroConstructor)
	TArray<struct FApiGatewayDiscoveryServerKeyValuePair> TravelData;                                               // 0x0030(0x0010) (ZeroConstructor)
	struct FString                                     GameServer;                                               // 0x0040(0x0010) (ZeroConstructor)
};

// ScriptStruct EmbarkApiGateway.ApiGatewayDiscoveryServerReportMatchResultResponse
// 0x0020
struct FApiGatewayDiscoveryServerReportMatchResultResponse
{
	struct FString                                     TournamentId;                                             // 0x0000(0x0010) (ZeroConstructor)
	struct FString                                     MatchId;                                                  // 0x0010(0x0010) (ZeroConstructor)
};

// ScriptStruct EmbarkApiGateway.ApiGatewayDiscoveryServerReportMatchProgressRequest
// 0x0048
struct FApiGatewayDiscoveryServerReportMatchProgressRequest
{
	struct FString                                     TournamentId;                                             // 0x0000(0x0010) (ZeroConstructor)
	struct FString                                     MatchId;                                                  // 0x0010(0x0010) (ZeroConstructor)
	struct FString                                     MatchProgressData;                                        // 0x0020(0x0010) (ZeroConstructor)
	int                                                ExpectedEndTime;                                          // 0x0030(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0034(0x0004) MISSED OFFSET
	struct FString                                     GameServer;                                               // 0x0038(0x0010) (ZeroConstructor)
};

// ScriptStruct EmbarkApiGateway.ApiGatewayDiscoveryServerReportMatchProgressResponse
// 0x0020
struct FApiGatewayDiscoveryServerReportMatchProgressResponse
{
	struct FString                                     TournamentId;                                             // 0x0000(0x0010) (ZeroConstructor)
	struct FString                                     MatchId;                                                  // 0x0010(0x0010) (ZeroConstructor)
};

// ScriptStruct EmbarkApiGateway.ApiGatewayDiscoveryServerReportHeartbeatRequest
// 0x0030
struct FApiGatewayDiscoveryServerReportHeartbeatRequest
{
	struct FString                                     TournamentId;                                             // 0x0000(0x0010) (ZeroConstructor)
	struct FString                                     MatchId;                                                  // 0x0010(0x0010) (ZeroConstructor)
	struct FString                                     GameServer;                                               // 0x0020(0x0010) (ZeroConstructor)
};

// ScriptStruct EmbarkApiGateway.ApiGatewayDiscoveryServerReportHeartbeatResponse
// 0x0020
struct FApiGatewayDiscoveryServerReportHeartbeatResponse
{
	struct FString                                     TournamentId;                                             // 0x0000(0x0010) (ZeroConstructor)
	struct FString                                     MatchId;                                                  // 0x0010(0x0010) (ZeroConstructor)
};

// ScriptStruct EmbarkApiGateway.ApiGatewayDiscoveryServerPlayerPersistenceGameItem
// 0x0038
struct FApiGatewayDiscoveryServerPlayerPersistenceGameItem
{
	struct FString                                     InstanceId;                                               // 0x0000(0x0010) (ZeroConstructor)
	int64_t                                            GameAssetId;                                              // 0x0010(0x0008) (ZeroConstructor, IsPlainOldData)
	struct FString                                     Etag;                                                     // 0x0018(0x0010) (ZeroConstructor)
	int64_t                                            Amount;                                                   // 0x0028(0x0008) (ZeroConstructor, IsPlainOldData)
	bool                                               HasSeen;                                                  // 0x0030(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0031(0x0007) MISSED OFFSET
};

// ScriptStruct EmbarkApiGateway.ApiGatewayDiscoveryServerPlayerPersistenceArchetype
// 0x0048
struct FApiGatewayDiscoveryServerPlayerPersistenceArchetype
{
	struct FString                                     InstanceId;                                               // 0x0000(0x0010) (ZeroConstructor)
	int64_t                                            GameAssetId;                                              // 0x0010(0x0008) (ZeroConstructor, IsPlainOldData)
	struct FString                                     Etag;                                                     // 0x0018(0x0010) (ZeroConstructor)
	TArray<struct FString>                             GameItemInstanceIds;                                      // 0x0028(0x0010) (ZeroConstructor)
	TArray<struct FString>                             SkinInstanceIds;                                          // 0x0038(0x0010) (ZeroConstructor)
};

// ScriptStruct EmbarkApiGateway.ApiGatewayDiscoveryServerPlayerPersistenceCurrency
// 0x0030
struct FApiGatewayDiscoveryServerPlayerPersistenceCurrency
{
	struct FString                                     InstanceId;                                               // 0x0000(0x0010) (ZeroConstructor)
	int64_t                                            GameAssetId;                                              // 0x0010(0x0008) (ZeroConstructor, IsPlainOldData)
	struct FString                                     Etag;                                                     // 0x0018(0x0010) (ZeroConstructor)
	int64_t                                            Amount;                                                   // 0x0028(0x0008) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct EmbarkApiGateway.ApiGatewayDiscoveryServerPlayerPersistenceBattlePass
// 0x0028
struct FApiGatewayDiscoveryServerPlayerPersistenceBattlePass
{
	struct FString                                     InstanceId;                                               // 0x0000(0x0010) (ZeroConstructor)
	int64_t                                            GameAssetId;                                              // 0x0010(0x0008) (ZeroConstructor, IsPlainOldData)
	struct FString                                     Etag;                                                     // 0x0018(0x0010) (ZeroConstructor)
};

// ScriptStruct EmbarkApiGateway.ApiGatewayDiscoveryServerPlayerPersistenceCustomizationItem
// 0x0030
struct FApiGatewayDiscoveryServerPlayerPersistenceCustomizationItem
{
	struct FString                                     InstanceId;                                               // 0x0000(0x0010) (ZeroConstructor)
	int64_t                                            GameAssetId;                                              // 0x0010(0x0008) (ZeroConstructor, IsPlainOldData)
	struct FString                                     Etag;                                                     // 0x0018(0x0010) (ZeroConstructor)
	bool                                               HasSeen;                                                  // 0x0028(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0029(0x0007) MISSED OFFSET
};

// ScriptStruct EmbarkApiGateway.ApiGatewayDiscoveryServerPlayerPersistenceWeaponSkin
// 0x0030
struct FApiGatewayDiscoveryServerPlayerPersistenceWeaponSkin
{
	struct FString                                     InstanceId;                                               // 0x0000(0x0010) (ZeroConstructor)
	int64_t                                            GameAssetId;                                              // 0x0010(0x0008) (ZeroConstructor, IsPlainOldData)
	struct FString                                     Etag;                                                     // 0x0018(0x0010) (ZeroConstructor)
	bool                                               HasSeen;                                                  // 0x0028(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0029(0x0007) MISSED OFFSET
};

// ScriptStruct EmbarkApiGateway.ApiGatewayDiscoveryServerPlayerPersistenceLoadout
// 0x0030
struct FApiGatewayDiscoveryServerPlayerPersistenceLoadout
{
	struct FString                                     InstanceId;                                               // 0x0000(0x0010) (ZeroConstructor)
	struct FString                                     Etag;                                                     // 0x0010(0x0010) (ZeroConstructor)
	struct FString                                     SelectedContestantPackInstanceId;                         // 0x0020(0x0010) (ZeroConstructor)
};

// ScriptStruct EmbarkApiGateway.ApiGatewayDiscoveryServerPlayerPersistenceSanction
// 0x0038
struct FApiGatewayDiscoveryServerPlayerPersistenceSanction
{
	struct FString                                     InstanceId;                                               // 0x0000(0x0010) (ZeroConstructor)
	struct FString                                     Etag;                                                     // 0x0010(0x0010) (ZeroConstructor)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0020(0x0004) MISSED OFFSET
	int                                                Tier;                                                     // 0x0024(0x0004) (ZeroConstructor, IsPlainOldData)
	int64_t                                            TimeOfSanction;                                           // 0x0028(0x0008) (ZeroConstructor, IsPlainOldData)
	int64_t                                            Duration;                                                 // 0x0030(0x0008) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct EmbarkApiGateway.ApiGatewayDiscoveryServerPlayerPersistenceQuest
// 0x0040
struct FApiGatewayDiscoveryServerPlayerPersistenceQuest
{
	struct FString                                     InstanceId;                                               // 0x0000(0x0010) (ZeroConstructor)
	int64_t                                            GameAssetId;                                              // 0x0010(0x0008) (ZeroConstructor, IsPlainOldData)
	struct FString                                     Etag;                                                     // 0x0018(0x0010) (ZeroConstructor)
	int64_t                                            Amount;                                                   // 0x0028(0x0008) (ZeroConstructor, IsPlainOldData)
	int64_t                                            ExpiresAt;                                                // 0x0030(0x0008) (ZeroConstructor, IsPlainOldData)
	int                                                Week;                                                     // 0x0038(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x003C(0x0004) MISSED OFFSET
};

// ScriptStruct EmbarkApiGateway.ApiGatewayDiscoveryServerPlayerPersistenceContestantPackItemAttachment
// 0x0020
struct FApiGatewayDiscoveryServerPlayerPersistenceContestantPackItemAttachment
{
	struct FString                                     ItemInstanceId;                                           // 0x0000(0x0010) (ZeroConstructor)
	TArray<struct FString>                             AttachedItemInstanceIds;                                  // 0x0010(0x0010) (ZeroConstructor)
};

// ScriptStruct EmbarkApiGateway.ApiGatewayDiscoveryServerPlayerPersistenceContestantPackSlot
// 0x0020
struct FApiGatewayDiscoveryServerPlayerPersistenceContestantPackSlot
{
	struct FString                                     SlotName;                                                 // 0x0000(0x0010) (ZeroConstructor)
	TArray<struct FString>                             ItemInstanceIds;                                          // 0x0010(0x0010) (ZeroConstructor)
};

// ScriptStruct EmbarkApiGateway.ApiGatewayDiscoveryServerPlayerPersistenceContestantPack
// 0x00D8
struct FApiGatewayDiscoveryServerPlayerPersistenceContestantPack
{
	struct FString                                     InstanceId;                                               // 0x0000(0x0010) (ZeroConstructor)
	int64_t                                            GameAssetId;                                              // 0x0010(0x0008) (ZeroConstructor, IsPlainOldData)
	struct FString                                     Title;                                                    // 0x0018(0x0010) (ZeroConstructor)
	struct FString                                     Etag;                                                     // 0x0028(0x0010) (ZeroConstructor)
	struct FString                                     ArchetypeInstanceId;                                      // 0x0038(0x0010) (ZeroConstructor)
	TArray<struct FString>                             FirstHandInstanceIds;                                     // 0x0048(0x0010) (ZeroConstructor)
	TArray<struct FString>                             ReservedInstanceIds;                                      // 0x0058(0x0010) (ZeroConstructor)
	TArray<struct FString>                             CustomizationItemInstanceIds;                             // 0x0068(0x0010) (ZeroConstructor)
	TArray<struct FApiGatewayDiscoveryServerPlayerPersistenceContestantPackItemAttachment> ItemAttachments;                                          // 0x0078(0x0010) (ZeroConstructor)
	struct FString                                     SprayItemInstanceId;                                      // 0x0088(0x0010) (ZeroConstructor)
	TArray<struct FString>                             SprayWheelItemInstanceIds;                                // 0x0098(0x0010) (ZeroConstructor)
	TArray<struct FString>                             EmoteWheelItemInstanceIds;                                // 0x00A8(0x0010) (ZeroConstructor)
	TArray<struct FString>                             ExpressionItemInstanceIds;                                // 0x00B8(0x0010) (ZeroConstructor)
	TArray<struct FApiGatewayDiscoveryServerPlayerPersistenceContestantPackSlot> Slots;                                                    // 0x00C8(0x0010) (ZeroConstructor)
};

// ScriptStruct EmbarkApiGateway.ApiGatewayDiscoveryServerPlayerPersistenceFame
// 0x0020
struct FApiGatewayDiscoveryServerPlayerPersistenceFame
{
	struct FString                                     InstanceId;                                               // 0x0000(0x0010) (ZeroConstructor)
	int64_t                                            GameAssetId;                                              // 0x0010(0x0008) (ZeroConstructor, IsPlainOldData)
	int64_t                                            Amount;                                                   // 0x0018(0x0008) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct EmbarkApiGateway.ApiGatewayDiscoveryServerPlayerPersistenceWeaponCharm
// 0x0030
struct FApiGatewayDiscoveryServerPlayerPersistenceWeaponCharm
{
	struct FString                                     InstanceId;                                               // 0x0000(0x0010) (ZeroConstructor)
	int64_t                                            GameAssetId;                                              // 0x0010(0x0008) (ZeroConstructor, IsPlainOldData)
	struct FString                                     Etag;                                                     // 0x0018(0x0010) (ZeroConstructor)
	bool                                               HasSeen;                                                  // 0x0028(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0029(0x0007) MISSED OFFSET
};

// ScriptStruct EmbarkApiGateway.ApiGatewayDiscoveryServerPlayerPersistenceWeaponSticker
// 0x0030
struct FApiGatewayDiscoveryServerPlayerPersistenceWeaponSticker
{
	struct FString                                     InstanceId;                                               // 0x0000(0x0010) (ZeroConstructor)
	int64_t                                            GameAssetId;                                              // 0x0010(0x0008) (ZeroConstructor, IsPlainOldData)
	struct FString                                     Etag;                                                     // 0x0018(0x0010) (ZeroConstructor)
	bool                                               HasSeen;                                                  // 0x0028(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0029(0x0007) MISSED OFFSET
};

// ScriptStruct EmbarkApiGateway.ApiGatewayDiscoveryServerPlayerPersistenceSpray
// 0x0030
struct FApiGatewayDiscoveryServerPlayerPersistenceSpray
{
	struct FString                                     InstanceId;                                               // 0x0000(0x0010) (ZeroConstructor)
	int64_t                                            GameAssetId;                                              // 0x0010(0x0008) (ZeroConstructor, IsPlainOldData)
	struct FString                                     Etag;                                                     // 0x0018(0x0010) (ZeroConstructor)
	bool                                               HasSeen;                                                  // 0x0028(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0029(0x0007) MISSED OFFSET
};

// ScriptStruct EmbarkApiGateway.ApiGatewayDiscoveryServerPlayerPersistenceEmoticon
// 0x0030
struct FApiGatewayDiscoveryServerPlayerPersistenceEmoticon
{
	struct FString                                     InstanceId;                                               // 0x0000(0x0010) (ZeroConstructor)
	int64_t                                            GameAssetId;                                              // 0x0010(0x0008) (ZeroConstructor, IsPlainOldData)
	struct FString                                     Etag;                                                     // 0x0018(0x0010) (ZeroConstructor)
	bool                                               HasSeen;                                                  // 0x0028(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0029(0x0007) MISSED OFFSET
};

// ScriptStruct EmbarkApiGateway.ApiGatewayDiscoveryServerPlayerPersistenceSkill
// 0x0038
struct FApiGatewayDiscoveryServerPlayerPersistenceSkill
{
	struct FString                                     InstanceId;                                               // 0x0000(0x0010) (ZeroConstructor)
	int64_t                                            GameAssetId;                                              // 0x0010(0x0008) (ZeroConstructor, IsPlainOldData)
	struct FString                                     Etag;                                                     // 0x0018(0x0010) (ZeroConstructor)
	int64_t                                            Amount;                                                   // 0x0028(0x0008) (ZeroConstructor, IsPlainOldData)
	bool                                               HasSeen;                                                  // 0x0030(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0031(0x0007) MISSED OFFSET
};

// ScriptStruct EmbarkApiGateway.ApiGatewayDiscoveryServerGetInventoryResponse
// 0x0130
struct FApiGatewayDiscoveryServerGetInventoryResponse
{
	struct FApiGatewayDiscoveryServerPlayerPersistenceLoadout Loadout;                                                  // 0x0000(0x0030)
	TArray<struct FApiGatewayDiscoveryServerPlayerPersistenceSanction> Sanctions;                                                // 0x0030(0x0010) (ZeroConstructor)
	TArray<struct FApiGatewayDiscoveryServerPlayerPersistenceGameItem> GameItems;                                                // 0x0040(0x0010) (ZeroConstructor)
	TArray<struct FApiGatewayDiscoveryServerPlayerPersistenceContestantPack> ContestantPacks;                                          // 0x0050(0x0010) (ZeroConstructor)
	TArray<struct FApiGatewayDiscoveryServerPlayerPersistenceArchetype> Archetypes;                                               // 0x0060(0x0010) (ZeroConstructor)
	TArray<struct FApiGatewayDiscoveryServerPlayerPersistenceCurrency> Currencies;                                               // 0x0070(0x0010) (ZeroConstructor)
	TArray<struct FApiGatewayDiscoveryServerPlayerPersistenceWeaponSkin> WeaponSkins;                                              // 0x0080(0x0010) (ZeroConstructor)
	TArray<struct FApiGatewayDiscoveryServerPlayerPersistenceCustomizationItem> CustomizationItems;                                       // 0x0090(0x0010) (ZeroConstructor)
	TArray<struct FApiGatewayDiscoveryServerPlayerPersistenceBattlePass> BattlePasses;                                             // 0x00A0(0x0010) (ZeroConstructor)
	TArray<struct FApiGatewayDiscoveryServerPlayerPersistenceQuest> Quests;                                                   // 0x00B0(0x0010) (ZeroConstructor)
	struct FApiGatewayDiscoveryServerPlayerPersistenceFame Fame;                                                     // 0x00C0(0x0020)
	TArray<struct FApiGatewayDiscoveryServerPlayerPersistenceWeaponCharm> WeaponCharms;                                             // 0x00E0(0x0010) (ZeroConstructor)
	TArray<struct FApiGatewayDiscoveryServerPlayerPersistenceWeaponSticker> WeaponStickers;                                           // 0x00F0(0x0010) (ZeroConstructor)
	TArray<struct FApiGatewayDiscoveryServerPlayerPersistenceSpray> Sprays;                                                   // 0x0100(0x0010) (ZeroConstructor)
	TArray<struct FApiGatewayDiscoveryServerPlayerPersistenceSkill> Skills;                                                   // 0x0110(0x0010) (ZeroConstructor)
	TArray<struct FApiGatewayDiscoveryServerPlayerPersistenceEmoticon> Emoticons;                                                // 0x0120(0x0010) (ZeroConstructor)
};

// ScriptStruct EmbarkApiGateway.ApiGatewayDiscoveryServerUserInventory
// 0x0140
struct FApiGatewayDiscoveryServerUserInventory
{
	struct FEmbarkUserHandle                           UserId;                                                   // 0x0000(0x0010)
	struct FApiGatewayDiscoveryServerGetInventoryResponse Inventory;                                                // 0x0010(0x0130)
};

// ScriptStruct EmbarkApiGateway.ApiGatewayDiscoveryServerUserInventories
// 0x0010
struct FApiGatewayDiscoveryServerUserInventories
{
	TArray<struct FApiGatewayDiscoveryServerUserInventory> Items;                                                    // 0x0000(0x0010) (ZeroConstructor)
};

// ScriptStruct EmbarkApiGateway.ApiGatewayDiscoveryServerGetActiveItemRankResponse
// 0x0010
struct FApiGatewayDiscoveryServerGetActiveItemRankResponse
{
	TArray<struct FApiGatewayDiscoveryServerUserActiveItemRank> ItemRanks;                                                // 0x0000(0x0010) (ZeroConstructor)
};

// ScriptStruct EmbarkApiGateway.ApiGatewayDiscoveryServerSquad
// 0x0018
struct FApiGatewayDiscoveryServerSquad
{
	TArray<struct FEmbarkUserHandle>                   Players;                                                  // 0x0000(0x0010) (ZeroConstructor)
	int64_t                                            Cash;                                                     // 0x0010(0x0008) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct EmbarkApiGateway.ApiGatewayDiscoveryServerSubmitMatchReportRequest
// 0x0040
struct FApiGatewayDiscoveryServerSubmitMatchReportRequest
{
	TArray<struct FApiGatewayDiscoveryServerSquad>     Squads;                                                   // 0x0000(0x0010) (ZeroConstructor)
	struct FString                                     ScenarioId;                                               // 0x0010(0x0010) (ZeroConstructor)
	struct FString                                     GacMatchId;                                               // 0x0020(0x0010) (ZeroConstructor)
	struct FString                                     RequestID;                                                // 0x0030(0x0010) (ZeroConstructor)
};

// ScriptStruct EmbarkApiGateway.ApiGatewayDiscoveryPlayerPersistenceGameItem
// 0x0038
struct FApiGatewayDiscoveryPlayerPersistenceGameItem
{
	struct FString                                     InstanceId;                                               // 0x0000(0x0010) (ZeroConstructor)
	int64_t                                            GameAssetId;                                              // 0x0010(0x0008) (ZeroConstructor, IsPlainOldData)
	struct FString                                     Etag;                                                     // 0x0018(0x0010) (ZeroConstructor)
	int64_t                                            Amount;                                                   // 0x0028(0x0008) (ZeroConstructor, IsPlainOldData)
	bool                                               HasSeen;                                                  // 0x0030(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0031(0x0007) MISSED OFFSET
};

// ScriptStruct EmbarkApiGateway.ApiGatewayDiscoveryPlayerPersistenceArchetype
// 0x0048
struct FApiGatewayDiscoveryPlayerPersistenceArchetype
{
	struct FString                                     InstanceId;                                               // 0x0000(0x0010) (ZeroConstructor)
	int64_t                                            GameAssetId;                                              // 0x0010(0x0008) (ZeroConstructor, IsPlainOldData)
	struct FString                                     Etag;                                                     // 0x0018(0x0010) (ZeroConstructor)
	TArray<struct FString>                             GameItemInstanceIds;                                      // 0x0028(0x0010) (ZeroConstructor)
	TArray<struct FString>                             SkinInstanceIds;                                          // 0x0038(0x0010) (ZeroConstructor)
};

// ScriptStruct EmbarkApiGateway.ApiGatewayDiscoveryPlayerPersistenceCurrency
// 0x0030
struct FApiGatewayDiscoveryPlayerPersistenceCurrency
{
	struct FString                                     InstanceId;                                               // 0x0000(0x0010) (ZeroConstructor)
	int64_t                                            GameAssetId;                                              // 0x0010(0x0008) (ZeroConstructor, IsPlainOldData)
	struct FString                                     Etag;                                                     // 0x0018(0x0010) (ZeroConstructor)
	int64_t                                            Amount;                                                   // 0x0028(0x0008) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct EmbarkApiGateway.ApiGatewayDiscoveryPlayerPersistenceBattlePass
// 0x0028
struct FApiGatewayDiscoveryPlayerPersistenceBattlePass
{
	struct FString                                     InstanceId;                                               // 0x0000(0x0010) (ZeroConstructor)
	int64_t                                            GameAssetId;                                              // 0x0010(0x0008) (ZeroConstructor, IsPlainOldData)
	struct FString                                     Etag;                                                     // 0x0018(0x0010) (ZeroConstructor)
};

// ScriptStruct EmbarkApiGateway.ApiGatewayDiscoveryPlayerPersistenceCustomizationItem
// 0x0030
struct FApiGatewayDiscoveryPlayerPersistenceCustomizationItem
{
