#pragma once

//   SDK By:if

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace sdk
{
//---------------------------------------------------------------------------
// Classes
//---------------------------------------------------------------------------

// Class EmbarkConstructable.FComponentOrStyleLibrary
// 0x0000 (0x0028 - 0x0028)
class UFComponentOrStyleLibrary : public UObject
{
public:

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class EmbarkConstructable.FComponentOrStyleLibrary"));
		return ptr;
	}


	struct FComponentOrStyle STATIC_MakeFromSceneComponent(class USceneComponent* Component);//Offset:Discovery.exe+0x1A596D0
	struct FComponentOrStyle STATIC_MakeFromPrimitiveComponent(class UPrimitiveComponent* Component);//Offset:Discovery.exe+0x1A596D0
	struct FComponentOrStyle STATIC_MakeFromPhysicsBodyIndex(class UPrimitiveComponent* Component, int BodyIndex);//Offset:Discovery.exe+0x1A59340
	struct FComponentOrStyle STATIC_MakeFromPart(class AConstructableBase* PartOwner, int PartID);//Offset:Discovery.exe+0x1A595D0
	struct FComponentOrStyle STATIC_MakeFromHitResult(const struct FHitResult& HitResult);//Offset:Discovery.exe+0x1A59440
	bool STATIC_IsValid(const struct FComponentOrStyle& ComponentOrStyle);//Offset:Discovery.exe+0x1A59290
	bool STATIC_IsPartReference(const struct FComponentOrStyle& ComponentOrStyle);//Offset:Discovery.exe+0x1A591E0
	bool STATIC_IsPartAndDestroyed(const struct FComponentOrStyle& ComponentOrStyle);//Offset:Discovery.exe+0x1A58AD0
	bool STATIC_IsPartAndAlive(const struct FComponentOrStyle& ComponentOrStyle);//Offset:Discovery.exe+0x1A58A20
	struct FTransform STATIC_GetWorldTransform(const struct FComponentOrStyle& ComponentOrStyle);//Offset:Discovery.exe+0x1A58D40
	bool STATIC_GetTransform(const struct FComponentOrStyle& ComponentOrStyle, bool bWorldTransform, struct FTransform* OutTransform);//Offset:Discovery.exe+0x1A58E40
	class AActor* STATIC_GetOwner(const struct FComponentOrStyle& ComponentOrStyle);//Offset:Discovery.exe+0x1A59130
	bool STATIC_GetClosestPointOnCollision(const struct FComponentOrStyle& ComponentOrStyle, const struct FVector& Point, struct FVector* OutPointOnBody);//Offset:Discovery.exe+0x1A58FE0
	struct FVector STATIC_GetCenterBounds(const struct FComponentOrStyle& ComponentOrStyle);//Offset:Discovery.exe+0x1A58B80
	bool STATIC_GetBounds(const struct FComponentOrStyle& ComponentOrStyle, struct FBox* Bounds);//Offset:Discovery.exe+0x1A58C40
	class AActor* STATIC_GetActor(const struct FComponentOrStyle& ComponentOrStyle);//Offset:Discovery.exe+0x1A59130
	class USceneComponent* STATIC_AdvancedAPI_GetPartReference(const struct FComponentOrStyle& ComponentOrStyle, int* OutPartId);//Offset:Discovery.exe+0x1A58860
	class USceneComponent* STATIC_AdvancedAPI_GetComponent(const struct FComponentOrStyle& ComponentOrStyle);//Offset:Discovery.exe+0x1A58970
};


// Class EmbarkConstructable.ComponentOrStyleTargetHandleMixinLibrary
// 0x0000 (0x0028 - 0x0028)
class UComponentOrStyleTargetHandleMixinLibrary : public UObject
{
public:

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class EmbarkConstructable.ComponentOrStyleTargetHandleMixinLibrary"));
		return ptr;
	}


	struct FComponentOrStyle STATIC_GetFirstValidComponentOrStyleTarget(struct FGameplayAbilityTargetDataHandle* Handle);//Offset:Discovery.exe+0x1A5A500
	struct FComponentOrStyle STATIC_GetComponentOrStyleTarget(int Index, struct FGameplayAbilityTargetDataHandle* Handle);//Offset:Discovery.exe+0x1A5A370
	TArray<struct FComponentOrStyle> STATIC_GetAllValidComponentOrStyleTargets(struct FGameplayAbilityTargetDataHandle* Handle);//Offset:Discovery.exe+0x1A5A640
	void STATIC_AddComponentOrStyleTarget(const struct FComponentOrStyle& Target, struct FGameplayAbilityTargetDataHandle* Handle);//Offset:Discovery.exe+0x1A5A7A0
};


// Class EmbarkConstructable.ConstructableAbilitySystemComponent
// 0x3080 (0x4510 - 0x1490)
class UConstructableAbilitySystemComponent : public UEmbarkAbilitySystemComponent
{
public:
	struct FScriptMulticastDelegate                    OnPartTagsChanged;                                        // 0x1490(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnPartTagAdded;                                           // 0x14A0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnPartTagRemoved;                                         // 0x14B0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData00[0x50];                                      // 0x14C0(0x0050) UNKNOWN PROPERTY: AllocatedPartIDs
	unsigned char                                      UnknownData01[0x50];                                      // 0x1510(0x0050) UNKNOWN PROPERTY: PartAbilityResourceCostEffects
	unsigned char                                      UnknownData02[0x2FA8];                                    // 0x1560(0x2FA8) MISSED OFFSET
	class AConstructableBase*                          OwnerConstructable;                                       // 0x4508(0x0008) (ZeroConstructor, Transient, IsPlainOldData)

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class EmbarkConstructable.ConstructableAbilitySystemComponent"));
		return ptr;
	}


	bool TrySetPartAttributeBaseValue_Server(class UClass* AttributeSetClass, const struct FName& AttributeName, int PartID, float NewValue);//Offset:Discovery.exe+0x1A5CC00
	bool TryGetPartAttributeCurrentValue_Server(class UClass* AttributeSetClass, const struct FName& AttributeName, int PartID, float* OutCurrentValue);//Offset:Discovery.exe+0x1A5C8E0
	bool TryGetPartAttributeBaseValue_Server(class UClass* AttributeSetClass, const struct FName& AttributeName, int PartID, float* OutBaseValue);//Offset:Discovery.exe+0x1A5CA70
	bool TryGetPartAttribute_Server(class UClass* AttributeSetClass, const struct FName& AttributeName, int PartID, struct FGameplayAttribute* OutGameplayAttribute);//Offset:Discovery.exe+0x1A5CD90
	void RemovePartTags(int PartID, const struct FGameplayTagContainer& TagsToRemove);//Offset:Discovery.exe+0x1A5BD10
	void RemovePartTag(int PartID, const struct FGameplayTag& TagToRemove);//Offset:Discovery.exe+0x1A5BE20
	void RegisterPartAttributeChangedCallbackForAllParts_Server(class UClass* AttributeSetClass, const struct FName& AttributeName, class UObject* CallbackObject, const struct FName& CallbackFunctionName_FOnAttributeChangeData);//Offset:Discovery.exe+0x1A5C760
	void RegisterPartAttributeChangedCallback_Server(class UClass* AttributeSetClass, const struct FName& AttributeName, int PartID, class UObject* CallbackObject, const struct FName& CallbackFunctionName_FOnAttributeChangeData);//Offset:Discovery.exe+0x1A5C590
	bool QueryPartTags(int PartID, struct FConstructablePartTagData* OutPartTagData);//Offset:Discovery.exe+0x1A5B7B0
	bool PartHasTag(int PartID, const struct FGameplayTag& RequiredTag);//Offset:Discovery.exe+0x1A5B9D0
	bool PartHasAnyTags(int PartID, const struct FGameplayTagContainer& RequiredTags);//Offset:Discovery.exe+0x1A5BAD0
	bool PartHasAllTags(int PartID, const struct FGameplayTagContainer& RequiredTags);//Offset:Discovery.exe+0x1A5BBF0
	int PartAttributeToPartID(const struct FGameplayAttribute& PartGameplayAttribute);//Offset:Discovery.exe+0x1A5C270
	bool PartAttributeToBaseData(const struct FGameplayAttribute& PartGameplayAttribute, struct FConstructablePartAttributeBaseData* OutBaseData);//Offset:Discovery.exe+0x1A5C110
	bool GiveAbilityToPart_Server(int PartID, class UClass* InAbilityClass, int Level, class UObject* OptionalSourceObject, struct FGameplayAbilitySpecHandle* OutHandle);//Offset:Discovery.exe+0x1A5B490
	int GetPartTagCount(int PartID, const struct FGameplayTag& TagToQuery);//Offset:Discovery.exe+0x1A5B8D0
	bool GetPartAbilityData(const struct FGameplayAbilitySpecHandle& PartAbilitySpecHandle, struct FConstructablePartAbilityData* OutData);//Offset:Discovery.exe+0x1A5B2D0
	class AConstructableBase* GetOwnerConstructable();//Offset:Discovery.exe+0x1A5B200
	void GetAndRegisterPartAttributeChangedCallback_Server(class UClass* AttributeSetClass, const struct FName& AttributeName, int PartID, class UObject* CallbackObject, const struct FName& CallbackFunctionName_FOnAttributeChangeData, float* OutCurrentValue);//Offset:Discovery.exe+0x1A5C360
	float CalcUtility(const struct FGameplayAbilitySpecHandle& AbilitySpecHandle);//Offset:Discovery.exe+0x1A5B230
	void AllocateAttributesForPart_Server(class UClass* AttributeSetClass, int PartID);//Offset:Discovery.exe+0x1A5CF80
	void AddPartTags(int PartID, const struct FGameplayTagContainer& TagsToAdd);//Offset:Discovery.exe+0x1A5BF10
	void AddPartTag(int PartID, const struct FGameplayTag& TagToAdd);//Offset:Discovery.exe+0x1A5C020
};


// Class EmbarkConstructable.ConstructableAbilitySystemGlobals
// 0x0000 (0x0260 - 0x0260)
class UConstructableAbilitySystemGlobals : public UAbilitySystemGlobals
{
public:

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class EmbarkConstructable.ConstructableAbilitySystemGlobals"));
		return ptr;
	}

};


// Class EmbarkConstructable.GameplayAbilityTargetDataHandleMixinLibrary
// 0x0000 (0x0028 - 0x0028)
class UGameplayAbilityTargetDataHandleMixinLibrary : public UObject
{
public:

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class EmbarkConstructable.GameplayAbilityTargetDataHandleMixinLibrary"));
		return ptr;
	}


	class AActor* STATIC_GetTargetActor(const struct FGameplayAbilityTargetDataHandle& Handle, int Index);//Offset:Discovery.exe+0x1A5EA40
	int STATIC_GetNum(struct FGameplayAbilityTargetDataHandle* Handle);//Offset:Discovery.exe+0x1A5ECA0
	class UReplicatedSubobject* STATIC_GetFirstReplicatedSubobject(struct FGameplayAbilityTargetDataHandle* Handle);//Offset:Discovery.exe+0x1A5E340
	void STATIC_ApplyGameplayEffectSpec(int Index, struct FGameplayAbilityTargetDataHandle* Handle, struct FGameplayEffectSpec* Spec);//Offset:Discovery.exe+0x1A5E740
	void STATIC_ApplyEffectToTargets(bool bApplyAffectedUNormAsEffectLevel, struct FGameplayAbilityTargetDataHandle* Handle, struct FGameplayEffectSpec* Spec, TArray<struct FActiveGameplayEffectHandle>* OutAppliedHandles);//Offset:Discovery.exe+0x1A5EDC0
	void STATIC_AddReplicatedSubobjectTarget(class UReplicatedSubobject* TargetedObject, struct FGameplayAbilityTargetDataHandle* Handle);//Offset:Discovery.exe+0x1A5E470
	void STATIC_AddConstructableTargetData(class AActor* TargetedActor, TArray<struct FConstructablePartDamageModelData> TargetedParts, int PrimaryTargetPartId, struct FGameplayAbilityTargetDataHandle* Handle);//Offset:Discovery.exe+0x1A5F360
	void STATIC_AddActorTargetData(class AActor* TargetedActor, float TargetedActorAffectedDegreeUNorm, struct FGameplayAbilityTargetDataHandle* Handle);//Offset:Discovery.exe+0x1A5F1A0
};


// Class EmbarkConstructable.GameplayEffectContextMixinLibrary
// 0x0000 (0x0028 - 0x0028)
class UGameplayEffectContextMixinLibrary : public UObject
{
public:

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class EmbarkConstructable.GameplayEffectContextMixinLibrary"));
		return ptr;
	}


	void STATIC_SetReplicateAffectedPartIDs(const struct FGameplayEffectContextHandle& Handle, bool bReplicate);//Offset:Discovery.exe+0x1A60E10
	void STATIC_SetRawDamage(const struct FGameplayEffectContextHandle& Handle, float RawDamage);//Offset:Discovery.exe+0x1A60600
	void STATIC_SetPrimaryTargetPartId(const struct FGameplayEffectContextHandle& Handle, int PrimaryAffectedPart);//Offset:Discovery.exe+0x1A60CE0
	void STATIC_SetOriginatorObject(const struct FGameplayEffectContextHandle& Handle, class UObject* Originator);//Offset:Discovery.exe+0x1A5FDA0
	void STATIC_SetEventID(int InEventID, struct FGameplayEffectContextHandle* Handle);//Offset:Discovery.exe+0x1A5FFB0
	void STATIC_SetDamageType(unsigned char DamageType, struct FGameplayEffectContextHandle* Handle);//Offset:Discovery.exe+0x1A601C0
	void STATIC_SetAttackingPartInfo(const struct FGameplayEffectContextHandle& Handle, struct FConstructablePartAttackerData* AttackingPartInfo);//Offset:Discovery.exe+0x1A60850
	void STATIC_SetAffectedParts(const struct FGameplayEffectContextHandle& Handle, TArray<struct FConstructablePartDamageModelData> AffectedParts);//Offset:Discovery.exe+0x1A61290
	void STATIC_SetAffectActorAttributes(const struct FGameplayEffectContextHandle& Handle, bool bShouldAffectActorAttributes);//Offset:Discovery.exe+0x1A61680
	void STATIC_SetActorRawTakenDamage(const struct FGameplayEffectContextHandle& Handle, float RawDamage);//Offset:Discovery.exe+0x1A60600
	void STATIC_SetActorAffectedDegreeUNorm(float ActorAffectedDegreeUNorm, struct FGameplayEffectContextHandle* Handle);//Offset:Discovery.exe+0x1A603E0
	bool STATIC_IsReplicatingAffectedPartIDs(const struct FGameplayEffectContextHandle& Handle);//Offset:Discovery.exe+0x1A60F40
	float STATIC_GetRawDamage(const struct FGameplayEffectContextHandle& Handle);//Offset:Discovery.exe+0x1A60510
	int STATIC_GetPrimaryTargetPartId(const struct FGameplayEffectContextHandle& Handle);//Offset:Discovery.exe+0x1A60C00
	class UObject* STATIC_GetOriginatorObject(const struct FGameplayEffectContextHandle& Handle);//Offset:Discovery.exe+0x1A5FCC0
	int STATIC_GetEventID(const struct FGameplayEffectContextHandle& Handle);//Offset:Discovery.exe+0x1A5FED0
	unsigned char STATIC_GetDamageType(const struct FGameplayEffectContextHandle& Handle);//Offset:Discovery.exe+0x1A600E0
	struct FConstructablePartAttackerData STATIC_GetAttackingPartInfo(const struct FGameplayEffectContextHandle& Handle);//Offset:Discovery.exe+0x1A60730
	int STATIC_GetAffectedPartsNum(const struct FGameplayEffectContextHandle& Handle);//Offset:Discovery.exe+0x1A60B20
	void STATIC_GetAffectedParts(const struct FGameplayEffectContextHandle& Handle, TArray<struct FConstructablePartDamageModelData>* AffectedParts);//Offset:Discovery.exe+0x1A61140
	TArray<int> STATIC_GetAffectedPartIDs(const struct FGameplayEffectContextHandle& Handle);//Offset:Discovery.exe+0x1A61020
	struct FConstructablePartDamageModelData STATIC_GetAffectedPart(const struct FGameplayEffectContextHandle& Handle, int PartIndex);//Offset:Discovery.exe+0x1A609E0
	bool STATIC_GetAffectActorAttributes(const struct FGameplayEffectContextHandle& Handle);//Offset:Discovery.exe+0x1A617B0
	float STATIC_GetActorRawTakenDamage(const struct FGameplayEffectContextHandle& Handle);//Offset:Discovery.exe+0x1A60510
	float STATIC_GetActorAffectedDegreeUNorm(const struct FGameplayEffectContextHandle& Handle);//Offset:Discovery.exe+0x1A602F0
	void STATIC_AddAffectedParts(const struct FGameplayEffectContextHandle& Handle, TArray<struct FConstructablePartDamageModelData> AffectedParts);//Offset:Discovery.exe+0x1A613E0
	void STATIC_AddAffectedPart(const struct FGameplayEffectContextHandle& Handle, const struct FConstructablePartDamageModelData& AffectedPart);//Offset:Discovery.exe+0x1A61530
};


// Class EmbarkConstructable.GrantedTagsMixinLibrary
// 0x0000 (0x0028 - 0x0028)
class UGrantedTagsMixinLibrary : public UObject
{
public:

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class EmbarkConstructable.GrantedTagsMixinLibrary"));
		return ptr;
	}


	void STATIC_AddGrantedTags(const struct FGameplayTagContainer& InGameplayTagsToAdd, struct FGameplayEffectSpecHandle* SpecHandle);//Offset:Discovery.exe+0x1A629B0
	void STATIC_AddGrantedTag(const struct FGameplayTag& InTagToAdd, struct FGameplayEffectSpecHandle* SpecHandle);//Offset:Discovery.exe+0x1A62880
};


// Class EmbarkConstructable.ConstructableAIControllerBase
// 0x0038 (0x04A8 - 0x0470)
class AConstructableAIControllerBase : public AEmbarkAIController
{
public:
	class UAIKnowledgeBaseInterface*                   KnowledgeBase;                                            // 0x0470(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	unsigned char                                      UnknownData00[0x30];                                      // 0x0478(0x0030) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class EmbarkConstructable.ConstructableAIControllerBase"));
		return ptr;
	}


	void SetDynamicSubtree(const struct FGameplayTag& Tag, class UBehaviorTree* BehaviorTree);//Offset:Discovery.exe+0x1A64820
	void RequestFocus_Internal(const struct FFocusRequest& Request);//Offset:Discovery.exe+0x1A64350
	void RequestFocus(const struct FFocusRequest& Request);//Offset:Discovery.exe+0x1A64460
	void RemovePartPerceptionComponent(int OwningPartID);//Offset:Discovery.exe+0x1A64910
	bool IsRequestValid_Internal(const struct FFocusRequest& Request);//Offset:Discovery.exe+0x1A64100
	bool IsRequestValid(const struct FFocusRequest& Request);//Offset:Discovery.exe+0x1A64100
	bool HasValidFocus_Internal();//Offset:Discovery.exe+0x1A64270
	bool HasValidFocus();//Offset:Discovery.exe+0x1A64270
	bool HasDynamicTreeTag(const struct FGameplayTag& Tag);//Offset:Discovery.exe+0x1A646C0
	struct FFocusTarget GetCurrentFocus_Internal();//Offset:Discovery.exe+0x1A641F0
	struct FFocusTarget GetCurrentFocus();//Offset:Discovery.exe+0x1A641F0
	void ClearFocus_Internal(enum class EAIFocusMode FocusMode);//Offset:Discovery.exe+0x1A642B0
	void ClearFocus(enum class EAIFocusMode FocusMode);//Offset:Discovery.exe+0x1A642B0
	void ClearDynamicSubTree(const struct FGameplayTag& Tag);//Offset:Discovery.exe+0x1A64770
	struct FRotator CalcFocusRotator_Internal();//Offset:Discovery.exe+0x1A645C0
	struct FRotator CalcFocusRotator();//Offset:Discovery.exe+0x1A645C0
	struct FVector CalcFocusLocation_Internal();//Offset:Discovery.exe+0x1A64640
	struct FVector CalcFocusLocation();//Offset:Discovery.exe+0x1A64640
	void AddPartPerceptionComponent(class USceneComponent* OwningComponent, TArray<class UAISenseConfig*> SenseConfigs, int OwningPartID);//Offset:Discovery.exe+0x1A649B0
};


// Class EmbarkConstructable.ConstructableBase
// 0x0180 (0x0520 - 0x03A0)
class AConstructableBase : public AEmbarkPawn
{
public:
	struct FScriptMulticastDelegate                    OnConstructionComplete;                                   // 0x03A0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnCollidedWithOtherActor;                                 // 0x03B0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnAnyServicePushedData;                                   // 0x03C0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnConstructableDestroyedEvent;                            // 0x03D0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	bool                                               bIsFullyConstructed;                                      // 0x03E0(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x03E1(0x0003) MISSED OFFSET
	struct FRandomStream                               ConstructionStream;                                       // 0x03E4(0x0008) (BlueprintVisible, ZeroConstructor)
	unsigned char                                      UnknownData01[0x4];                                       // 0x03EC(0x0004) MISSED OFFSET
	class UPrimaryDataAsset*                           EnemyType;                                                // 0x03F0(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UStateInterpolatorComponent*                 StateInterpolatorComponent;                               // 0x03F8(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	unsigned char                                      UnknownData02[0x110];                                     // 0x0400(0x0110) MISSED OFFSET
	class UConstructableStyleProxyContainer*           ProxyContainer;                                           // 0x0510(0x0008) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData03[0x8];                                       // 0x0518(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class EmbarkConstructable.ConstructableBase"));
		return ptr;
	}


	void QueryPartsNoParams(const struct FGameplayTagQuery& PartQuery, TArray<struct FConstructablePart>* OutParts);//Offset:Discovery.exe+0x1A669C0
	void QueryParts(const struct FGameplayTagQuery& PartQuery, const struct FConstructablePartQueryParams& QueryParams, TArray<struct FConstructablePart>* OutParts);//Offset:Discovery.exe+0x1A66B10
	void QueryPartIDs(const struct FGameplayTagQuery& PartQuery);//Offset:Discovery.exe+0x1A66CD0
	void PumpServiceDataToStyles_Client(float DeltaTimeSecs);//Offset:Discovery.exe+0x1A67250
	void OnActorFinalized();//Offset:Discovery.exe+0x327F8B0
	bool IsValidPartID(int PartID);//Offset:Discovery.exe+0x1A66920
	bool IsPartDestroyed(int PartID);//Offset:Discovery.exe+0x1A66880
	bool IsConstructableDestroyed();//Offset:Discovery.exe+0x1A65C20
	class UPrimitiveComponent* GetStyleComponentFromPartID(int PartID);//Offset:Discovery.exe+0x1A67080
	bool GetSocketRepIndex(int PartID, const struct FName& SocketName, int* OutSocketIndex);//Offset:Discovery.exe+0x1A65DA0
	bool GetSocketDataFromRepIndex(int SocketIndex, int* OutPartId, struct FName* OutSocketName);//Offset:Discovery.exe+0x1A65C50
	int GetRootPartID();//Offset:Discovery.exe+0x1A66820
	struct FConstructablePart GetRootPart();//Offset:Discovery.exe+0x1A667C0
	bool GetPartTags(int PartID, struct FGameplayTagContainer* OutGameplayTags);//Offset:Discovery.exe+0x1A65B00
	bool GetPartSocketGroupTransforms(int PartID, const struct FName& SocketGroupName, TEnumAsByte<ERelativeTransformSpace> TransformSpace, TArray<struct FTransform>* OutTransforms);//Offset:Discovery.exe+0x1A665D0
	bool GetPartSocketGroup(int PartID, const struct FName& SocketGroupName, TEnumAsByte<ERelativeTransformSpace> TransformSpace, TArray<struct FConstructableStyleSocket>* OutSocketList);//Offset:Discovery.exe+0x1A66410
	struct FConstructablePart GetPartFromID(int PartID);//Offset:Discovery.exe+0x1A66FC0
	int GetLastPartID();//Offset:Discovery.exe+0x1A66850
	bool GetFirstPartSocketGroupTransform(int PartID, const struct FName& SocketGroupName, TEnumAsByte<ERelativeTransformSpace> TransformSpace, struct FTransform* OutSocketTransform);//Offset:Discovery.exe+0x1A66020
	bool GetFirstPartSocketGroup(int PartID, const struct FName& SocketGroupName, TEnumAsByte<ERelativeTransformSpace> TransformSpace, struct FConstructableStyleSocket* OutSocket);//Offset:Discovery.exe+0x1A66220
	class UConstructableAbilitySystemComponent* GetConstructableASC();//Offset:Discovery.exe+0x1A66790
	TArray<class UPrimitiveComponent*> GetAllStyleComponents();//Offset:Discovery.exe+0x1A65FA0
	void GetAllParts(TArray<struct FConstructablePart>* OutAllParts);//Offset:Discovery.exe+0x1A66F10
	void GetAllPartIDs(TArray<int>* OutAllPartIDs);//Offset:Discovery.exe+0x1A65EF0
	void DestroyPart_Server(int PartID, int EventID, enum class EConstructableHealthChangeReason DestructionMethod);//Offset:Discovery.exe+0x1A67120
	bool CreateConstructablePart_Server(class UClass* StyleComponentClass, struct FConstructablePartIDRange* OutPartIDRange);//Offset:Discovery.exe+0x1A65A00
	void CompleteConstruction();//Offset:Discovery.exe+0x1A672F0
};


// Class EmbarkConstructable.ConstructableCapabilityBase
// 0x0008 (0x0030 - 0x0028)
class UConstructableCapabilityBase : public UObject
{
public:
	class UEmbarkSMInstance*                           StateMachine;                                             // 0x0028(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class EmbarkConstructable.ConstructableCapabilityBase"));
		return ptr;
	}

};


// Class EmbarkConstructable.ConstructableServiceComponentBase
// 0x0010 (0x00C8 - 0x00B8)
class UConstructableServiceComponentBase : public UActorComponent
{
public:
	bool                                               bOnlyPushChangedValues_Client;                            // 0x00B8(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bIsFullyConstructed;                                      // 0x00B9(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0xE];                                       // 0x00BA(0x000E) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class EmbarkConstructable.ConstructableServiceComponentBase"));
		return ptr;
	}


	class UClass* SimClassType();//Offset:Discovery.exe+0x1A83B10
	bool OnPumpDataToStyle(float DeltaTimeSecs);//Offset:Discovery.exe+0x1A83B90
	void OnFullyConstructed();//Offset:Discovery.exe+0x327F8B0
	class USimConstructableBaseClass* GetSimBaseStatePtr();//Offset:Discovery.exe+0x1A83B40
	class USimConstructableBaseClass* EditSimBaseStatePtr();//Offset:Discovery.exe+0x1A83B60
};


// Class EmbarkConstructable.ConstructableCapabilityServiceBase
// 0x0050 (0x0118 - 0x00C8)
class UConstructableCapabilityServiceBase : public UConstructableServiceComponentBase
{
public:
	TArray<struct FConstructableSMNetworkData>         CapabilityStateMachineRepData;                            // 0x00C8(0x0010) (BlueprintVisible, ZeroConstructor)
	TArray<struct FConstructableCapabilityEvent>       CapabilityEventRepData;                                   // 0x00D8(0x0010) (BlueprintVisible, ZeroConstructor)
	TArray<class UConstructableCapabilityBase*>        Capabilities;                                             // 0x00E8(0x0010) (BlueprintVisible, ZeroConstructor)
	unsigned char                                      UnknownData00[0x20];                                      // 0x00F8(0x0020) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class EmbarkConstructable.ConstructableCapabilityServiceBase"));
		return ptr;
	}


	void OnCapabilityEvent_Client(class UConstructableCapabilityBase* Capability, const struct FConstructableCapabilityEvent& EventData);//Offset:Discovery.exe+0x327F8B0
	void NetMulticast_StateMachine(TArray<struct FConstructableSMNetworkData> Data);//Offset:Discovery.exe+0x1A686D0
	void NetMulticast_EventData(TArray<struct FConstructableCapabilityEvent> Data);//Offset:Discovery.exe+0x1A68620
};


// Class EmbarkConstructable.ConstructableDynamicAttributes
// 0x0000 (0x0028 - 0x0028)
class UConstructableDynamicAttributes : public UBlueprintFunctionLibrary
{
public:

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class EmbarkConstructable.ConstructableDynamicAttributes"));
		return ptr;
	}


	bool STATIC_IsValidAttributeName(const struct FName& AttributeTypeName);//Offset:Discovery.exe+0x1A69100
	bool STATIC_GetSetClassesForAttributeName(const struct FName& AttributeTypeName, TArray<class UClass*>* OutAttributeSetClasses);//Offset:Discovery.exe+0x1A69000
	bool STATIC_GetPartAttributeSetMetaData(class UClass* BaseClass, struct FConstructablePartAttributeSetMetaData* OutMetaData);//Offset:Discovery.exe+0x1A691A0
	struct FName STATIC_GetMaxPrefixVersionName(const struct FName& Name);//Offset:Discovery.exe+0x1A68E10
	void STATIC_GetAllAttributeNames();//Offset:Discovery.exe+0x1A68EB0
};


// Class EmbarkConstructable.ConstructableGameplayAbility
// 0x0008 (0x03F0 - 0x03E8)
class UConstructableGameplayAbility : public UEmbarkGameplayAbility
{
public:
	bool                                               bApplyCostToPartIfApplicable;                             // 0x03E8(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x03E9(0x0007) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class EmbarkConstructable.ConstructableGameplayAbility"));
		return ptr;
	}


	bool CanActivateConstructableAbility(const struct FGameplayAbilitySpecHandle& Handle, const struct FGameplayAbilityActorInfo& ScopedActorInfo);//Offset:Discovery.exe+0x1A69760
	float CalculateUtility(const struct FGameplayAbilitySpecHandle& Handle, const struct FGameplayAbilityActorInfo& ScopedActorInfo);//Offset:Discovery.exe+0x327F8B0
	void ActivateConstructableAbility(const struct FGameplayAbilitySpecHandle& Handle, const struct FGameplayAbilityActorInfo& ScopedActorInfo);//Offset:Discovery.exe+0x327F8B0
};


// Class EmbarkConstructable.ConstructableGameplayCueNotify_Actor
// 0x0000 (0x0328 - 0x0328)
class AConstructableGameplayCueNotify_Actor : public AGameplayCueNotify_Actor
{
public:

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class EmbarkConstructable.ConstructableGameplayCueNotify_Actor"));
		return ptr;
	}


	bool OnConstructableDestroyed(class AConstructableBase* Constructable, class AActor* DamageInstigator);//Offset:Discovery.exe+0x1A69E60
	void Handle_OnConstructableDestroyed(class AConstructableBase* Constructable, class AActor* DamageInstigator);//Offset:Discovery.exe+0x1A69D80
};


// Class EmbarkConstructable.ConstructableGameplayEffect
// 0x00F8 (0x0928 - 0x0830)
class UConstructableGameplayEffect : public UEmbarkGameplayEffect
{
public:
	struct FGameplayTagQuery                           TargetPartQuery;                                          // 0x0830(0x0048) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	struct FGameplayTagQuery                           AffectedPartsFilter;                                      // 0x0878(0x0048) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	bool                                               bModifiersApplyToPartAttributes;                          // 0x08C0(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x08C1(0x0007) MISSED OFFSET
	struct FInheritedTagContainer                      TagsGrantedToAffectedParts;                               // 0x08C8(0x0060) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class EmbarkConstructable.ConstructableGameplayEffect"));
		return ptr;
	}

};


// Class EmbarkConstructable.SimConstructableBaseClass
// 0x0008 (0x0038 - 0x0030)
class USimConstructableBaseClass : public USimBaseClass
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0030(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class EmbarkConstructable.SimConstructableBaseClass"));
		return ptr;
	}


	class UConstructableServiceComponentBase* GetService();//Offset:Discovery.exe+0x1A83670
	void FindAndSetServiceForActor(class AActor* Actor, class UClass* ServiceClass);//Offset:Discovery.exe+0x1A83590
	void DeinitFromReplication();//Offset:Discovery.exe+0x1A83690
};


// Class EmbarkConstructable.ConstructableDamageDataArraySimState
// 0x0018 (0x0050 - 0x0038)
class UConstructableDamageDataArraySimState : public USimConstructableBaseClass
{
public:
	struct FABArraySizeLimiter                         ArraySize;                                                // 0x0038(0x0004)
	unsigned char                                      UnknownData00[0x4];                                       // 0x003C(0x0004) MISSED OFFSET
	TArray<struct FConstructableDamageData>            Items;                                                    // 0x0040(0x0010) (Net, ZeroConstructor)

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class EmbarkConstructable.ConstructableDamageDataArraySimState"));
		return ptr;
	}


	void OnRep_Items();//Offset:Discovery.exe+0x1A6B6A0
	void InitForActor(class AActor* Actor);//Offset:Discovery.exe+0x1A6B6C0
};


// Class EmbarkConstructable.ConstructableFastArrayReplicationServiceComponentBase
// 0x0040 (0x0108 - 0x00C8)
class UConstructableFastArrayReplicationServiceComponentBase : public UConstructableServiceComponentBase
{
public:
	float                                              AmortizationFrequencyHz;                                  // 0x00C8(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	int                                                AmortizationMaxEventsPerFrame;                            // 0x00CC(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x38];                                      // 0x00D0(0x0038) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class EmbarkConstructable.ConstructableFastArrayReplicationServiceComponentBase"));
		return ptr;
	}


	void StartDeferredEventProcessing_Server();//Offset:Discovery.exe+0x1A84130
};


// Class EmbarkConstructable.ConstructableHealthServiceComponent
// 0x02C8 (0x03D0 - 0x0108)
class UConstructableHealthServiceComponent : public UConstructableFastArrayReplicationServiceComponentBase
{
public:
	struct FScriptMulticastDelegate                    OnPartDamageDataUpdated_Interpolated;                     // 0x0108(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnPartDamageDataUpdated_Latest;                           // 0x0118(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnPartDestroyed;                                          // 0x0128(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	float                                              HealthInterpolationSpeed_Client;                          // 0x0138(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x013C(0x0004) MISSED OFFSET
	struct FConstructableDamageDataArray               PartDamageReplicationArray;                               // 0x0140(0x0128) (Net)
	unsigned char                                      UnknownData01[0x168];                                     // 0x0268(0x0168) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class EmbarkConstructable.ConstructableHealthServiceComponent"));
		return ptr;
	}


	void ReplicatePartDamageData_Server(const struct FConstructableDamageData& DamageData);//Offset:Discovery.exe+0x1A6C040
	bool PollLatestHealthData(int PartID, struct FConstructableDamageData* OutLatestHealthData);//Offset:Discovery.exe+0x1A6BDA0
	bool PollInterpolatedHealthData(int PartID, struct FConstructableDamageData* OutInterpolatedHealthData);//Offset:Discovery.exe+0x1A6BEF0
	void HandlePartDamaged(class UPrimitiveComponent* OwnerStyleComponent, const struct FConstructableDamageData& DamageData);//Offset:Discovery.exe+0x327F8B0
};


// Class EmbarkConstructable.ConstructableHoverMovementUtils
// 0x0000 (0x0028 - 0x0028)
class UConstructableHoverMovementUtils : public UBlueprintFunctionLibrary
{
public:

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class EmbarkConstructable.ConstructableHoverMovementUtils"));
		return ptr;
	}


	void STATIC_CalculateThrusterLocalForces(const struct FThrusterSimParams& ThrusterSimParams, TArray<struct FThrusterDefinition>* InOutThrusters);//Offset:Discovery.exe+0x1A6C6C0
};


// Class EmbarkConstructable.ConstructableMovementNetState
// 0x0090 (0x00C0 - 0x0030)
class UConstructableMovementNetState : public USimBaseClass
{
public:
	struct FABBLowCompressedWorldTransform             ReplicatedRootTransform;                                  // 0x0030(0x0060) (Edit, BlueprintVisible, DisableEditOnInstance)
	struct FABBHighCompressedVectorMaxLen2000          Velocity;                                                 // 0x0090(0x0018) (Edit, BlueprintVisible, DisableEditOnInstance)
	struct FABBHighCompressedVectorMaxLen2000          AngularVelocity;                                          // 0x00A8(0x0018) (Edit, BlueprintVisible, DisableEditOnInstance)

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class EmbarkConstructable.ConstructableMovementNetState"));
		return ptr;
	}

};


// Class EmbarkConstructable.ConstructableMovementComponentBase
// 0x00C8 (0x0298 - 0x01D0)
class UConstructableMovementComponentBase : public UEmbarkPawnMovementComponent
{
public:
	struct FReplicatedTransform                        ReplicatedRootTransform;                                  // 0x01D0(0x0068) (Edit, BlueprintVisible, BlueprintReadOnly, Net, DisableEditOnInstance)
	float                                              EstimatedGravity;                                         // 0x0238(0x0004) (ZeroConstructor, IsPlainOldData)
	bool                                               bSupportsMovementSupression;                              // 0x023C(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x023D(0x0003) MISSED OFFSET
	TArray<struct FName>                               MovementSuppressors;                                      // 0x0240(0x0010) (ZeroConstructor)
	unsigned char                                      UnknownData01[0x30];                                      // 0x0250(0x0030) MISSED OFFSET
	int                                                EmbarkID;                                                 // 0x0280(0x0004) (Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x14];                                      // 0x0284(0x0014) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class EmbarkConstructable.ConstructableMovementComponentBase"));
		return ptr;
	}


	void UpdateNetStateFromBaseMovementState_Server(class UConstructableMovementNetState* NetState);//Offset:Discovery.exe+0x1A6D000
	void UpdateBaseMovementStateFromNetState_Client(class UConstructableMovementNetState* NetState);//Offset:Discovery.exe+0x1A6D0A0
	void SetEnableStructDeltaCompression();//Offset:Discovery.exe+0x1A6D160
	void RemovePhysicsSuppressor(const struct FName& InName);//Offset:Discovery.exe+0x1A6CE50
	void RemoveMovementSuppressor(const struct FName& InName);//Offset:Discovery.exe+0x1A6CC70
	void OnRep_RootTransform();//Offset:Discovery.exe+0x1A6D140
	void OnPhysicsSuppressionChangeState(bool bNewSupressionState);//Offset:Discovery.exe+0x1A6CDB0
	float GetDesiredVelocity();//Offset:Discovery.exe+0x1A6CFE0
	struct FRotator GetCurrentLocalRotationOffset();//Offset:Discovery.exe+0x1A6CF90
	struct FVector GetAngularVelocity_Client();//Offset:Discovery.exe+0x1A6D190
	void AddPhysicsSuppressor(const struct FName& InName);//Offset:Discovery.exe+0x1A6CEF0
	void AddMovementSuppressor(const struct FName& InName);//Offset:Discovery.exe+0x1A6CD10
};


// Class EmbarkConstructable.ConstructablePartMixinLibrary
// 0x0000 (0x0028 - 0x0028)
class UConstructablePartMixinLibrary : public UObject
{
public:

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class EmbarkConstructable.ConstructablePartMixinLibrary"));
		return ptr;
	}


	void STATIC_SetPartTransform(bool bSetWorldTransform, const struct FTransform& NewTransform, struct FConstructablePart* ConstructablePart);//Offset:Discovery.exe+0x1A6F9F0
	void STATIC_SetPartSimulatePhysics(bool bSimulatePhysics, struct FConstructablePart* ConstructablePart);//Offset:Discovery.exe+0x1A6E4C0
	void STATIC_SetPartShouldAlwaysGenerateOverlaps(bool bShouldAlwaysGenerateOverlaps, struct FConstructablePart* ConstructablePart);//Offset:Discovery.exe+0x1A6DC00
	void STATIC_SetPartLinearVelocity(const struct FVector& LinearVelocity, struct FConstructablePart* ConstructablePart);//Offset:Discovery.exe+0x1A6F020
	void STATIC_SetPartCollisionProfileName(const struct FName& InCollisionProfileName, struct FConstructablePart* ConstructablePart);//Offset:Discovery.exe+0x1A6E6A0
	void STATIC_SetPartAngularVelocityInDegrees(const struct FVector& AngularVelocityDegrees, struct FConstructablePart* ConstructablePart);//Offset:Discovery.exe+0x1A6EB40
	void STATIC_SetDampingProperties(float LinearDamping, float AngularDamping, struct FConstructablePart* ConstructablePart);//Offset:Discovery.exe+0x1A6E2B0
	void STATIC_RefreshSocketGroups(struct FConstructablePart* ConstructablePart);//Offset:Discovery.exe+0x1A6FC70
	bool STATIC_IsValidPartIDForStyle(const struct FConstructablePart& ConstructablePart);//Offset:Discovery.exe+0x1A720F0
	bool STATIC_IsValid(const struct FConstructablePart& ConstructablePart);//Offset:Discovery.exe+0x1A72870
	bool STATIC_IsStaticMesh(const struct FConstructablePart& ConstructablePart);//Offset:Discovery.exe+0x1A6DF50
	bool STATIC_IsSkeletalMesh(const struct FConstructablePart& ConstructablePart);//Offset:Discovery.exe+0x1A6DE90
	bool STATIC_IsProxy(const struct FConstructablePart& ConstructablePart);//Offset:Discovery.exe+0x1A6DDD0
	bool STATIC_IsPointInsidePart(const struct FConstructablePart& ConstructablePart, const struct FVector& Point);//Offset:Discovery.exe+0x1A6E7B0
	bool STATIC_IsPartDestroyed(const struct FConstructablePart& ConstructablePart);//Offset:Discovery.exe+0x1A72030
	struct FTransform STATIC_GetWorldTransform(const struct FConstructablePart& ConstructablePart);//Offset:Discovery.exe+0x1A71750
	struct FQuat STATIC_GetWorldRotationQuat(const struct FConstructablePart& ConstructablePart);//Offset:Discovery.exe+0x1A713C0
	struct FRotator STATIC_GetWorldRotation(const struct FConstructablePart& ConstructablePart);//Offset:Discovery.exe+0x1A71490
	struct FVector STATIC_GetWorldLocation(const struct FConstructablePart& ConstructablePart);//Offset:Discovery.exe+0x1A71560
	class UPrimitiveComponent* STATIC_GetStyleComponent(const struct FConstructablePart& ConstructablePart);//Offset:Discovery.exe+0x1A71F70
	bool STATIC_GetSlotTransform(const struct FConstructablePart& ConstructablePart, const struct FGameplayTagContainer& GameplayTagContainer, bool bWantWorldTransform, struct FTransform* OutTransform);//Offset:Discovery.exe+0x1A70EE0
	int STATIC_GetRootPartID(const struct FConstructablePart& ConstructablePart);//Offset:Discovery.exe+0x1A6DD10
	struct FTransform STATIC_GetRelativeTransform(const struct FConstructablePart& ConstructablePart);//Offset:Discovery.exe+0x1A71630
	struct FQuat STATIC_GetRelativeRotationQuat(const struct FConstructablePart& ConstructablePart);//Offset:Discovery.exe+0x1A71150
	struct FRotator STATIC_GetRelativeRotation(const struct FConstructablePart& ConstructablePart);//Offset:Discovery.exe+0x1A71220
	struct FVector STATIC_GetRelativeLocation(const struct FConstructablePart& ConstructablePart);//Offset:Discovery.exe+0x1A712F0
	bool STATIC_GetPartTransform(const struct FConstructablePart& ConstructablePart, bool bWantWorldTransform, struct FTransform* OutTransform);//Offset:Discovery.exe+0x1A71870
	bool STATIC_GetPartTags(const struct FConstructablePart& ConstructablePart, struct FGameplayTagContainer* OutGameplayTags);//Offset:Discovery.exe+0x1A71CF0
	bool STATIC_GetPartSocketTransform(const struct FConstructablePart& ConstructablePart, const struct FName& SocketName, TEnumAsByte<ERelativeTransformSpace> TransformSpace, struct FTransform* OutTransform);//Offset:Discovery.exe+0x1A70CB0
	bool STATIC_GetPartSocketID(const struct FConstructablePart& ConstructablePart, const struct FName& SocketName, int* OutSocketID);//Offset:Discovery.exe+0x1A6FD30
	bool STATIC_GetPartSocketGroupTransforms(const struct FConstructablePart& ConstructablePart, const struct FName& SocketGroupName, TEnumAsByte<ERelativeTransformSpace> TransformSpace, TArray<struct FTransform>* OutTransformList);//Offset:Discovery.exe+0x1A70850
	bool STATIC_GetPartSocketGroupNames(const struct FConstructablePart& ConstructablePart, const struct FName& SocketGroupName, TArray<struct FName>* OutSocketGroupNameList);//Offset:Discovery.exe+0x1A706C0
	bool STATIC_GetPartSocketGroup(const struct FConstructablePart& ConstructablePart, const struct FName& SocketGroupName, TEnumAsByte<ERelativeTransformSpace> TransformSpace, TArray<struct FConstructableStyleSocket>* OutSocketList);//Offset:Discovery.exe+0x1A704E0
	void STATIC_GetPartsIntersectingSphere(const struct FConstructablePart& ConstructablePart, const struct FVector& SphereOrigin, float SphereRadius, TArray<int>* OutPartIDs);//Offset:Discovery.exe+0x1A6F4D0
	bool STATIC_GetPartSimulatePhysics(const struct FConstructablePart& ConstructablePart);//Offset:Discovery.exe+0x1A6E400
	bool STATIC_GetPartParent(const struct FConstructablePart& ConstructablePart, struct FConstructablePartParentInfo* OutParentInfo);//Offset:Discovery.exe+0x1A724D0
	struct FName STATIC_GetPartName(const struct FConstructablePart& ConstructablePart);//Offset:Discovery.exe+0x1A726E0
	bool STATIC_GetPartMass(const struct FConstructablePart& ConstructablePart, float* OutMass);//Offset:Discovery.exe+0x1A6F3B0
	bool STATIC_GetPartLinearVelocityAtLocation(const struct FConstructablePart& ConstructablePart, const struct FVector& Location, struct FVector* OutLinearVelocity);//Offset:Discovery.exe+0x1A6F130
	bool STATIC_GetPartLinearVelocity(const struct FConstructablePart& ConstructablePart, struct FVector* OutLinearVelocity);//Offset:Discovery.exe+0x1A6F2A0
	bool STATIC_GetPartInitialRelativeTransform(const struct FConstructablePart& ConstructablePart, struct FTransform* OutInitialRelativeTransform);//Offset:Discovery.exe+0x1A70A30
	bool STATIC_GetPartInitialRelativeRotation(const struct FConstructablePart& ConstructablePart, struct FRotator* OutInitialRelativeRotation);//Offset:Discovery.exe+0x1A70BA0
	void STATIC_GetPartIDsMatchingTagQuery(const struct FConstructablePart& ConstructablePart, const struct FGameplayTagQuery& Query);//Offset:Discovery.exe+0x1A71A40
	struct FConstructablePartIDRange STATIC_GetPartIDRange(const struct FConstructablePart& ConstructablePart);//Offset:Discovery.exe+0x1A727B0
	bool STATIC_GetPartIDFromPhysicsBodyIndex(const struct FConstructablePart& ConstructablePart, int PhysicsBodyIndex, int* OutPartId);//Offset:Discovery.exe+0x1A6E8C0
	int STATIC_GetPartIDFromHitResult(const struct FConstructablePart& ConstructablePart, const struct FHitResult& HitResult);//Offset:Discovery.exe+0x1A6F6A0
	struct FName STATIC_GetPartCollisionProfileName(const struct FConstructablePart& ConstructablePart);//Offset:Discovery.exe+0x1A6E5D0
	bool STATIC_GetPartChildren(const struct FConstructablePart& ConstructablePart, bool bIsRecursive, bool bAlsoGetDestroyedParts, TArray<struct FConstructablePart>* OutPartChildren);//Offset:Discovery.exe+0x1A72300
	bool STATIC_GetPartBounds(const struct FConstructablePart& ConstructablePart, struct FBox* OutBounds);//Offset:Discovery.exe+0x1A6EA20
	struct FBodyInstance STATIC_GetPartBodyInstance(const struct FConstructablePart& ConstructablePart);//Offset:Discovery.exe+0x1A6E010
	bool STATIC_GetPartAngularVelocityInDegrees(const struct FConstructablePart& ConstructablePart, struct FVector* OutAngularVelocityDegrees);//Offset:Discovery.exe+0x1A6EC50
	bool STATIC_GetNormalizedSocketGroupTransform(const struct FConstructablePart& ConstructablePart, const struct FName& SocketGroupName, struct FTransform* OutTransform);//Offset:Discovery.exe+0x1A6FEB0
	bool STATIC_GetFirstPartSocketGroupTransform(const struct FConstructablePart& ConstructablePart, const struct FName& SocketGroupName, TEnumAsByte<ERelativeTransformSpace> TransformSpace, struct FTransform* OutTransform);//Offset:Discovery.exe+0x1A702B0
	bool STATIC_GetFirstPartSocketGroup(const struct FConstructablePart& ConstructablePart, const struct FName& SocketGroupName, TEnumAsByte<ERelativeTransformSpace> TransformSpace, struct FConstructableStyleSocket* OutSocket);//Offset:Discovery.exe+0x1A70090
	struct FName STATIC_GetAttachSocketName(const struct FConstructablePart& ConstructablePart);//Offset:Discovery.exe+0x1A72610
	void STATIC_DestroyPart(int EventID, enum class EConstructableHealthChangeReason DestructionMethod, struct FConstructablePart* ConstructablePart);//Offset:Discovery.exe+0x1A721B0
	void STATIC_AttachActor(class AActor* ActorToAttach, enum class EAttachmentRule AttachmentRule, struct FConstructablePart* ConstructablePart);//Offset:Discovery.exe+0x1A6F8A0
	void STATIC_AddSocketData(struct FConstructablePart* ConstructablePart);//Offset:Discovery.exe+0x1A6FBB0
	void STATIC_AddPartTags(const struct FGameplayTagContainer& PartTags, struct FConstructablePart* ConstructablePart);//Offset:Discovery.exe+0x1A71E30
	void STATIC_AddPartImpulseAtLocation(const struct FVector& Location, const struct FVector& Impulse, struct FConstructablePart* ConstructablePart);//Offset:Discovery.exe+0x1A6ED60
	void STATIC_AddPartForceAtLocation(const struct FVector& Location, const struct FVector& Force, struct FConstructablePart* ConstructablePart);//Offset:Discovery.exe+0x1A6EEC0
};


// Class EmbarkConstructable.PioneerDamageModelAttributeSet_PartSet0
// 0x2400 (0x2440 - 0x0040)
class UPioneerDamageModelAttributeSet_PartSet0 : public UEmbarkAttributeSet
{
public:
	struct FAngelscriptGameplayAttributeData           Health_0;                                                 // 0x0040(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, EditConst)
	struct FAngelscriptGameplayAttributeData           MaxHealth_0;                                              // 0x0058(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, EditConst)
	struct FAngelscriptGameplayAttributeData           OutgoingHealingModifier_0;                                // 0x0070(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, EditConst)
	struct FAngelscriptGameplayAttributeData           IncomingHealingModifier_0;                                // 0x0088(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, EditConst)
	struct FAngelscriptGameplayAttributeData           PhysicalResistance_0;                                     // 0x00A0(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, EditConst)
	struct FAngelscriptGameplayAttributeData           ExplosiveResistance_0;                                    // 0x00B8(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, EditConst)
	struct FAngelscriptGameplayAttributeData           PoisonResistance_0;                                       // 0x00D0(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, EditConst)
	struct FAngelscriptGameplayAttributeData           FireResistance_0;                                         // 0x00E8(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, EditConst)
	struct FAngelscriptGameplayAttributeData           ElectricResistance_0;                                     // 0x0100(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, EditConst)
	struct FAngelscriptGameplayAttributeData           MeleeResistance_0;                                        // 0x0118(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, EditConst)
	struct FAngelscriptGameplayAttributeData           CollisionDamageMultiplier_0;                              // 0x0130(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, EditConst)
	struct FAngelscriptGameplayAttributeData           Damage_0;                                                 // 0x0148(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, EditConst)
	struct FAngelscriptGameplayAttributeData           Health_1;                                                 // 0x0160(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, EditConst)
	struct FAngelscriptGameplayAttributeData           MaxHealth_1;                                              // 0x0178(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, EditConst)
	struct FAngelscriptGameplayAttributeData           OutgoingHealingModifier_1;                                // 0x0190(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, EditConst)
	struct FAngelscriptGameplayAttributeData           IncomingHealingModifier_1;                                // 0x01A8(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, EditConst)
	struct FAngelscriptGameplayAttributeData           PhysicalResistance_1;                                     // 0x01C0(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, EditConst)
	struct FAngelscriptGameplayAttributeData           ExplosiveResistance_1;                                    // 0x01D8(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, EditConst)
	struct FAngelscriptGameplayAttributeData           PoisonResistance_1;                                       // 0x01F0(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, EditConst)
	struct FAngelscriptGameplayAttributeData           FireResistance_1;                                         // 0x0208(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, EditConst)
	struct FAngelscriptGameplayAttributeData           ElectricResistance_1;                                     // 0x0220(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, EditConst)
	struct FAngelscriptGameplayAttributeData           MeleeResistance_1;                                        // 0x0238(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, EditConst)
	struct FAngelscriptGameplayAttributeData           CollisionDamageMultiplier_1;                              // 0x0250(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, EditConst)
	struct FAngelscriptGameplayAttributeData           Damage_1;                                                 // 0x0268(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, EditConst)
	struct FAngelscriptGameplayAttributeData           Health_2;                                                 // 0x0280(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, EditConst)
	struct FAngelscriptGameplayAttributeData           MaxHealth_2;                                              // 0x0298(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, EditConst)
	struct FAngelscriptGameplayAttributeData           OutgoingHealingModifier_2;                                // 0x02B0(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, EditConst)
	struct FAngelscriptGameplayAttributeData           IncomingHealingModifier_2;                                // 0x02C8(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, EditConst)
	struct FAngelscriptGameplayAttributeData           PhysicalResistance_2;                                     // 0x02E0(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, EditConst)
	struct FAngelscriptGameplayAttributeData           ExplosiveResistance_2;                                    // 0x02F8(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, EditConst)
	struct FAngelscriptGameplayAttributeData           PoisonResistance_2;                                       // 0x0310(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, EditConst)
	struct FAngelscriptGameplayAttributeData           FireResistance_2;                                         // 0x0328(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, EditConst)
	struct FAngelscriptGameplayAttributeData           ElectricResistance_2;                                     // 0x0340(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, EditConst)
	struct FAngelscriptGameplayAttributeData           MeleeResistance_2;                                        // 0x0358(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, EditConst)
	struct FAngelscriptGameplayAttributeData           CollisionDamageMultiplier_2;                              // 0x0370(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, EditConst)
	struct FAngelscriptGameplayAttributeData           Damage_2;                                                 // 0x0388(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, EditConst)
	struct FAngelscriptGameplayAttributeData           Health_3;                                                 // 0x03A0(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, EditConst)
	struct FAngelscriptGameplayAttributeData           MaxHealth_3;                                              // 0x03B8(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, EditConst)
	struct FAngelscriptGameplayAttributeData           OutgoingHealingModifier_3;                                // 0x03D0(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, EditConst)
	struct FAngelscriptGameplayAttributeData           IncomingHealingModifier_3;                                // 0x03E8(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, EditConst)
	struct FAngelscriptGameplayAttributeData           PhysicalResistance_3;                                     // 0x0400(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, EditConst)
	struct FAngelscriptGameplayAttributeData           ExplosiveResistance_3;                                    // 0x0418(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, EditConst)
	struct FAngelscriptGameplayAttributeData           PoisonResistance_3;                                       // 0x0430(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, EditConst)
	struct FAngelscriptGameplayAttributeData           FireResistance_3;                                         // 0x0448(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, EditConst)
	struct FAngelscriptGameplayAttributeData           ElectricResistance_3;                                     // 0x0460(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, EditConst)
	struct FAngelscriptGameplayAttributeData           MeleeResistance_3;                                        // 0x0478(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, EditConst)
	struct FAngelscriptGameplayAttributeData           CollisionDamageMultiplier_3;                              // 0x0490(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, EditConst)
	struct FAngelscriptGameplayAttributeData           Damage_3;                                                 // 0x04A8(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, EditConst)
	struct FAngelscriptGameplayAttributeData           Health_4;                                                 // 0x04C0(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, EditConst)
	struct FAngelscriptGameplayAttributeData           MaxHealth_4;                                              // 0x04D8(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, EditConst)
