#pragma once

//   SDK By:if

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace sdk
{
//---------------------------------------------------------------------------
// Classes
//---------------------------------------------------------------------------

// Class Engine.Actor
// 0x02A0 (0x02C8 - 0x0028)
class AActor : public UObject
{
public:
	struct FActorTickFunction                          PrimaryActorTick;                                         // 0x0028(0x0030) (Edit, DisableEditOnInstance)
	unsigned char                                      bNetTemporary : 1;                                        // 0x0058(0x0001)
	unsigned char                                      bNetStartup : 1;                                          // 0x0058(0x0001)
	unsigned char                                      bOnlyRelevantToOwner : 1;                                 // 0x0058(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	unsigned char                                      bAlwaysRelevant : 1;                                      // 0x0058(0x0001) (Edit, BlueprintVisible, DisableEditOnInstance)
	unsigned char                                      bReplicateAttachment : 1;                                 // 0x0058(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bReplicateMovement : 1;                                   // 0x0058(0x0001) (Edit, Net, DisableEditOnInstance)
	unsigned char                                      bCallPreReplication : 1;                                  // 0x0058(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bCallPreReplicationForReplay : 1;                         // 0x0058(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bHidden : 1;                                              // 0x0059(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, Net)
	unsigned char                                      bTearOff : 1;                                             // 0x0059(0x0001) (Net)
	unsigned char                                      bForceNetAddressable : 1;                                 // 0x0059(0x0001)
	unsigned char                                      bExchangedRoles : 1;                                      // 0x0059(0x0001) (Transient)
	unsigned char                                      bNetLoadOnClient : 1;                                     // 0x0059(0x0001) (Edit)
	unsigned char                                      bNetUseOwnerRelevancy : 1;                                // 0x0059(0x0001) (Edit, BlueprintVisible, DisableEditOnInstance)
	unsigned char                                      bRelevantForNetworkReplays : 1;                           // 0x0059(0x0001)
	unsigned char                                      bRelevantForLevelBounds : 1;                              // 0x0059(0x0001) (Edit)
	unsigned char                                      bReplayRewindable : 1;                                    // 0x005A(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bAllowTickBeforeBeginPlay : 1;                            // 0x005A(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bAutoDestroyWhenFinished : 1;                             // 0x005A(0x0001) (BlueprintVisible)
	unsigned char                                      bCanBeDamaged : 1;                                        // 0x005A(0x0001) (Edit, BlueprintVisible, Net, SaveGame)
	unsigned char                                      bBlockInput : 1;                                          // 0x005A(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bCollideWhenPlacing : 1;                                  // 0x005A(0x0001)
	unsigned char                                      bFindCameraComponentWhenViewTarget : 1;                   // 0x005A(0x0001) (Edit, BlueprintVisible)
	unsigned char                                      bGenerateOverlapEventsDuringLevelStreaming : 1;           // 0x005A(0x0001) (Edit, BlueprintVisible)
	unsigned char                                      bIgnoresOriginShifting : 1;                               // 0x005B(0x0001) (Edit)
	unsigned char                                      bEnableAutoLODGeneration : 1;                             // 0x005B(0x0001) (Edit, BlueprintVisible)
	unsigned char                                      bIsEditorOnlyActor : 1;                                   // 0x005B(0x0001) (Edit)
	unsigned char                                      bActorSeamlessTraveled : 1;                               // 0x005B(0x0001)
	unsigned char                                      bReplicates : 1;                                          // 0x005B(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	unsigned char                                      bCanBeInCluster : 1;                                      // 0x005B(0x0001) (Edit)
	unsigned char                                      bAllowReceiveTickEventOnDedicatedServer : 1;              // 0x005B(0x0001)
	unsigned char                                      UnknownData00 : 1;                                        // 0x005B(0x0001)
	unsigned char                                      UnknownData01 : 6;                                        // 0x005C(0x0001)
	unsigned char                                      bActorEnableCollision : 1;                                // 0x005C(0x0001)
	unsigned char                                      bActorIsBeingDestroyed : 1;                               // 0x005C(0x0001) (Transient, DuplicateTransient)
	unsigned char                                      UnknownData02[0x1];                                       // 0x005D(0x0001) MISSED OFFSET
	enum class EActorUpdateOverlapsMethod              UpdateOverlapsMethodDuringLevelStreaming;                 // 0x005E(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	enum class EActorUpdateOverlapsMethod              DefaultUpdateOverlapsMethodDuringLevelStreaming;          // 0x005F(0x0001) (Edit, ZeroConstructor, Config, EditConst, IsPlainOldData)
	TEnumAsByte<ENetRole>                              RemoteRole;                                               // 0x0060(0x0001) (Net, ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData03[0x7];                                       // 0x0061(0x0007) MISSED OFFSET
	struct FRepMovement                                ReplicatedMovement;                                       // 0x0068(0x0068) (Edit, Net, DisableEditOnInstance)
	float                                              InitialLifeSpan;                                          // 0x00D0(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              CustomTimeDilation;                                       // 0x00D4(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData04[0x8];                                       // 0x00D8(0x0008) MISSED OFFSET
	struct FRepAttachment                              AttachmentReplication;                                    // 0x00E0(0x0060) (Net, Transient)
	class AActor*                                      Owner;                                                    // 0x0140(0x0008) (Net, ZeroConstructor, IsPlainOldData)
	struct FName                                       NetDriverName;                                            // 0x0148(0x0008) (ZeroConstructor, IsPlainOldData)
	TEnumAsByte<ENetRole>                              Role;                                                     // 0x0150(0x0001) (Net, ZeroConstructor, IsPlainOldData)
	TEnumAsByte<ENetDormancy>                          NetDormancy;                                              // 0x0151(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	enum class ESpawnActorCollisionHandlingMethod      SpawnCollisionHandlingMethod;                             // 0x0152(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TEnumAsByte<EAutoReceiveInput>                     AutoReceiveInput;                                         // 0x0153(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	int                                                InputPriority;                                            // 0x0154(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	class UInputComponent*                             InputComponent;                                           // 0x0158(0x0008) (ExportObject, ZeroConstructor, InstancedReference, DuplicateTransient, IsPlainOldData)
	float                                              NetCullDistanceSquared;                                   // 0x0160(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	int                                                NetTag;                                                   // 0x0164(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	float                                              NetUpdateFrequency;                                       // 0x0168(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              MinNetUpdateFrequency;                                    // 0x016C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              NetPriority;                                              // 0x0170(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData05[0x4];                                       // 0x0174(0x0004) MISSED OFFSET
	class APawn*                                       Instigator;                                               // 0x0178(0x0008) (BlueprintVisible, Net, ZeroConstructor, IsPlainOldData)
	TArray<class AActor*>                              Children;                                                 // 0x0180(0x0010) (ZeroConstructor, Transient)
	class USceneComponent*                             RootComponent;                                            // 0x0190(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData)
	unsigned char                                      UnknownData06[0x8];                                       // 0x0198(0x0008) MISSED OFFSET
	int                                                RayTracingGroupId;                                        // 0x01A0(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData07[0x4];                                       // 0x01A4(0x0004) MISSED OFFSET
	TArray<struct FName>                               Layers;                                                   // 0x01A8(0x0010) (Edit, ZeroConstructor)
	TWeakObjectPtr<class UChildActorComponent>         ParentComponent;                                          // 0x01B8(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	unsigned char                                      UnknownData08[0x8];                                       // 0x01C0(0x0008) MISSED OFFSET
	TArray<struct FName>                               Tags;                                                     // 0x01C8(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FScriptMulticastDelegate                    OnTakeAnyDamage;                                          // 0x01D8(0x0010) (InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnTakePointDamage;                                        // 0x01D9(0x0010) (InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnTakeRadialDamage;                                       // 0x01DA(0x0010) (InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnActorBeginOverlap;                                      // 0x01DB(0x0010) (InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnActorEndOverlap;                                        // 0x01DC(0x0010) (InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnBeginCursorOver;                                        // 0x01DD(0x0010) (InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnEndCursorOver;                                          // 0x01DE(0x0010) (InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnClicked;                                                // 0x01DF(0x0010) (InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnReleased;                                               // 0x01E0(0x0010) (InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnInputTouchBegin;                                        // 0x01E1(0x0010) (InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnInputTouchEnd;                                          // 0x01E2(0x0010) (InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnInputTouchEnter;                                        // 0x01E3(0x0010) (InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnInputTouchLeave;                                        // 0x01E4(0x0010) (InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnActorHit;                                               // 0x01E5(0x0010) (InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnDestroyed;                                              // 0x01E6(0x0010) (InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnEndPlay;                                                // 0x01E7(0x0010) (InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData09[0xB0];                                      // 0x01E8(0x00B0) MISSED OFFSET
	TArray<class UActorComponent*>                     InstanceComponents;                                       // 0x0298(0x0010) (ExportObject, ZeroConstructor)
	TArray<class UActorComponent*>                     BlueprintCreatedComponents;                               // 0x02A8(0x0010) (ExportObject, ZeroConstructor)
	unsigned char                                      UnknownData10[0x10];                                      // 0x02B8(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class Engine.Actor"));
		return ptr;
	}


	bool WasRecentlyRendered(float Tolerance);//Offset:Discovery.exe+0x5667CD0
	void UserConstructionScript();//Offset:Discovery.exe+0x327F8B0
	void TearOff();//Offset:Discovery.exe+0x14618E0
	void SetTickGroup(TEnumAsByte<ETickingGroup> NewTickGroup);//Offset:Discovery.exe+0x5667D70
	void SetTickableWhenPaused(bool bTickableWhenPaused);//Offset:Discovery.exe+0x56689F0
	void SetReplicates(bool bInReplicates);//Offset:Discovery.exe+0x566D5C0
	void SetReplicateMovement(bool bInReplicateMovement);//Offset:Discovery.exe+0x566D520
	void SetRayTracingGroupId(int InRaytracingGroupId);//Offset:Discovery.exe+0x566D460
	void SetOwner(class AActor* NewOwner);//Offset:Discovery.exe+0x56684C0
	void SetNetDormancy(TEnumAsByte<ENetDormancy> NewDormancy);//Offset:Discovery.exe+0x5668370
	void SetLifeSpan(float InLifespan);//Offset:Discovery.exe+0x5668730
	void SetAutoDestroyWhenFinished(bool bVal);//Offset:Discovery.exe+0x566D660
	void SetActorTickInterval(float TickInterval);//Offset:Discovery.exe+0x5668590
	void SetActorTickEnabled(bool bEnabled);//Offset:Discovery.exe+0x5668660
	void SetActorScale3D(const struct FVector& NewScale3D);//Offset:Discovery.exe+0x566C2B0
	void SetActorRelativeScale3D(const struct FVector& NewRelativeScale);//Offset:Discovery.exe+0x5669F30
	void SetActorHiddenInGame(bool bNewHidden);//Offset:Discovery.exe+0x5669E30
	void SetActorEnableCollision(bool bNewActorEnableCollision);//Offset:Discovery.exe+0x5669D90
	void RemoveTickPrerequisiteComponent(class UActorComponent* PrerequisiteComponent);//Offset:Discovery.exe+0x5668AC0
	void RemoveTickPrerequisiteActor(class AActor* PrerequisiteActor);//Offset:Discovery.exe+0x5668B60
	void ReceiveTick(float DeltaSeconds);//Offset:Discovery.exe+0x327F8B0
	void ReceiveRadialDamage(float DamageReceived, class UDamageType* DamageType, const struct FVector& Origin, const struct FHitResult& HitInfo, class AController* InstigatedBy, class AActor* DamageCauser);//Offset:Discovery.exe+0x327F8B0
	void ReceivePointDamage(float Damage, class UDamageType* DamageType, const struct FVector& HitLocation, const struct FVector& HitNormal, class UPrimitiveComponent* HitComponent, const struct FName& BoneName, const struct FVector& ShotFromDirection, class AController* InstigatedBy, class AActor* DamageCauser, const struct FHitResult& HitInfo);//Offset:Discovery.exe+0x327F8B0
	void ReceiveHit(class UPrimitiveComponent* MyComp, class AActor* Other, class UPrimitiveComponent* OtherComp, bool bSelfMoved, const struct FVector& HitLocation, const struct FVector& HitNormal, const struct FVector& NormalImpulse, const struct FHitResult& Hit);//Offset:Discovery.exe+0x327F8B0
	void ReceiveEndPlay(TEnumAsByte<EEndPlayReason> EndPlayReason);//Offset:Discovery.exe+0x327F8B0
	void ReceiveDestroyed();//Offset:Discovery.exe+0x327F8B0
	void ReceiveBeginPlay();//Offset:Discovery.exe+0x327F8B0
	void ReceiveAnyDamage(float Damage, class UDamageType* DamageType, class AController* InstigatedBy, class AActor* DamageCauser);//Offset:Discovery.exe+0x327F8B0
	void ReceiveActorOnReleased(const struct FKey& ButtonReleased);//Offset:Discovery.exe+0x327F8B0
	void ReceiveActorOnInputTouchLeave(TEnumAsByte<ETouchIndex> FingerIndex);//Offset:Discovery.exe+0x327F8B0
	void ReceiveActorOnInputTouchEnter(TEnumAsByte<ETouchIndex> FingerIndex);//Offset:Discovery.exe+0x327F8B0
	void ReceiveActorOnInputTouchEnd(TEnumAsByte<ETouchIndex> FingerIndex);//Offset:Discovery.exe+0x327F8B0
	void ReceiveActorOnInputTouchBegin(TEnumAsByte<ETouchIndex> FingerIndex);//Offset:Discovery.exe+0x327F8B0
	void ReceiveActorOnClicked(const struct FKey& ButtonPressed);//Offset:Discovery.exe+0x327F8B0
	void ReceiveActorEndOverlap(class AActor* OtherActor);//Offset:Discovery.exe+0x327F8B0
	void ReceiveActorEndCursorOver();//Offset:Discovery.exe+0x327F8B0
	void ReceiveActorBeginOverlap(class AActor* OtherActor);//Offset:Discovery.exe+0x327F8B0
	void ReceiveActorBeginCursorOver();//Offset:Discovery.exe+0x327F8B0
	void PrestreamTextures(float Seconds, bool bEnableStreaming, int CinematicTextureGroups);//Offset:Discovery.exe+0x5667B70
	void OnRep_ReplicateMovement();//Offset:Discovery.exe+0x191D9E0
	void OnRep_ReplicatedMovement();//Offset:Discovery.exe+0x304A0
	void OnRep_Owner();//Offset:Discovery.exe+0x11B97D0
	void OnRep_Instigator();//Offset:Discovery.exe+0x1DB6730
	void OnRep_AttachmentReplication();//Offset:Discovery.exe+0x1DC09C0
	void MakeNoise(float Loudness, class APawn* NoiseInstigator, const struct FVector& NoiseLocation, float MaxRange, const struct FName& Tag);//Offset:Discovery.exe+0x5667510
	bool K2_TeleportTo(const struct FVector& DestLocation, const struct FRotator& DestRotation);//Offset:Discovery.exe+0x56680A0
	bool K2_SetActorTransform(const struct FTransform& NewTransform, bool bSweep, bool bTeleport, struct FHitResult* SweepHitResult);//Offset:Discovery.exe+0x566B010
	bool K2_SetActorRotation(const struct FRotator& NewRotation, bool bTeleportPhysics);//Offset:Discovery.exe+0x566C660
	void K2_SetActorRelativeTransform(const struct FTransform& NewRelativeTransform, bool bSweep, bool bTeleport, struct FHitResult* SweepHitResult);//Offset:Discovery.exe+0x5669FD0
	void K2_SetActorRelativeRotation(const struct FRotator& NewRelativeRotation, bool bSweep, bool bTeleport, struct FHitResult* SweepHitResult);//Offset:Discovery.exe+0x566A2B0
	void K2_SetActorRelativeLocation(const struct FVector& NewRelativeLocation, bool bSweep, bool bTeleport, struct FHitResult* SweepHitResult);//Offset:Discovery.exe+0x566A550
	bool K2_SetActorLocationAndRotation(const struct FVector& NewLocation, const struct FRotator& NewRotation, bool bSweep, bool bTeleport, struct FHitResult* SweepHitResult);//Offset:Discovery.exe+0x566C350
	bool K2_SetActorLocation(const struct FVector& NewLocation, bool bSweep, bool bTeleport, struct FHitResult* SweepHitResult);//Offset:Discovery.exe+0x566CDC0
	void K2_OnReset();//Offset:Discovery.exe+0x327F8B0
	void K2_OnEndViewTarget(class APlayerController* PC);//Offset:Discovery.exe+0x327F8B0
	void K2_OnBecomeViewTarget(class APlayerController* PC);//Offset:Discovery.exe+0x327F8B0
	class USceneComponent* K2_GetRootComponent();//Offset:Discovery.exe+0x566C7C0
	TArray<class UActorComponent*> K2_GetComponentsByClass(class UClass* ComponentClass);//Offset:Discovery.exe+0x5667900
	struct FRotator K2_GetActorRotation();//Offset:Discovery.exe+0x566CBC0
	struct FVector K2_GetActorLocation();//Offset:Discovery.exe+0x566D060
	void K2_DetachFromActor(enum class EDetachmentRule LocationRule, enum class EDetachmentRule RotationRule, enum class EDetachmentRule ScaleRule);//Offset:Discovery.exe+0x5668E10
	void K2_DestroyActor();//Offset:Discovery.exe+0x5669D40
	void K2_AttachToComponent(class USceneComponent* Parent, const struct FName& SocketName, enum class EAttachmentRule LocationRule, enum class EAttachmentRule RotationRule, enum class EAttachmentRule ScaleRule, bool bWeldSimulatedBodies);//Offset:Discovery.exe+0x5669380
	void K2_AttachToActor(class AActor* ParentActor, const struct FName& SocketName, enum class EAttachmentRule LocationRule, enum class EAttachmentRule RotationRule, enum class EAttachmentRule ScaleRule, bool bWeldSimulatedBodies);//Offset:Discovery.exe+0x5668FE0
	void K2_AttachRootComponentToActor(class AActor* InParentActor, const struct FName& InSocketName, TEnumAsByte<EAttachLocation> AttachLocationType, bool bWeldSimulatedBodies);//Offset:Discovery.exe+0x5669200
	void K2_AttachRootComponentTo(class USceneComponent* InParent, const struct FName& InSocketName, TEnumAsByte<EAttachLocation> AttachLocationType, bool bWeldSimulatedBodies);//Offset:Discovery.exe+0x56695A0
	void K2_AddActorWorldTransformKeepScale(const struct FTransform& DeltaTransform, bool bSweep, bool bTeleport, struct FHitResult* SweepHitResult);//Offset:Discovery.exe+0x566B2F0
	void K2_AddActorWorldTransform(const struct FTransform& DeltaTransform, bool bSweep, bool bTeleport, struct FHitResult* SweepHitResult);//Offset:Discovery.exe+0x566B5D0
	void K2_AddActorWorldRotation(const struct FRotator& DeltaRotation, bool bSweep, bool bTeleport, struct FHitResult* SweepHitResult);//Offset:Discovery.exe+0x566B8B0
	void K2_AddActorWorldOffset(const struct FVector& DeltaLocation, bool bSweep, bool bTeleport, struct FHitResult* SweepHitResult);//Offset:Discovery.exe+0x566BB50
	void K2_AddActorLocalTransform(const struct FTransform& NewTransform, bool bSweep, bool bTeleport, struct FHitResult* SweepHitResult);//Offset:Discovery.exe+0x566A7F0
	void K2_AddActorLocalRotation(const struct FRotator& DeltaRotation, bool bSweep, bool bTeleport, struct FHitResult* SweepHitResult);//Offset:Discovery.exe+0x566AAD0
	void K2_AddActorLocalOffset(const struct FVector& DeltaLocation, bool bSweep, bool bTeleport, struct FHitResult* SweepHitResult);//Offset:Discovery.exe+0x566AD70
	bool IsOverlappingActor(class AActor* Other);//Offset:Discovery.exe+0x5668400
	bool IsChildActor();//Offset:Discovery.exe+0x5668320
	bool IsActorTickEnabled();//Offset:Discovery.exe+0x5668630
	bool IsActorBeingDestroyed();//Offset:Discovery.exe+0x5668990
	bool HasAuthority();//Offset:Discovery.exe+0x5669D10
	float GetVerticalDistanceTo(class AActor* OtherActor);//Offset:Discovery.exe+0x566BF30
	struct FVector GetVelocity();//Offset:Discovery.exe+0x566C760
	struct FTransform GetTransform();//Offset:Discovery.exe+0x566D0B0
	bool GetTickableWhenPaused();//Offset:Discovery.exe+0x5668A90
	float GetSquaredHorizontalDistanceTo(class AActor* OtherActor);//Offset:Discovery.exe+0x566BFD0
	float GetSquaredDistanceTo(class AActor* OtherActor);//Offset:Discovery.exe+0x566C110
	TEnumAsByte<ENetRole> GetRemoteRole();//Offset:Discovery.exe+0x566D500
	int GetRayTracingGroupId();//Offset:Discovery.exe+0x566D430
	class UChildActorComponent* GetParentComponent();//Offset:Discovery.exe+0x56681E0
	class AActor* GetParentActor();//Offset:Discovery.exe+0x56681B0
	class AActor* GetOwner();//Offset:Discovery.exe+0x56684A0
	void GetOverlappingComponents(TArray<class UPrimitiveComponent*>* OverlappingComponents);//Offset:Discovery.exe+0x56687D0
	void GetOverlappingActors(class UClass* ClassFilter, TArray<class AActor*>* OverlappingActors);//Offset:Discovery.exe+0x5668880
	TEnumAsByte<ENetRole> GetLocalRole();//Offset:Discovery.exe+0x1BB7DC0
	float GetLifeSpan();//Offset:Discovery.exe+0x5668700
	struct FTransform GetLevelTransform();//Offset:Discovery.exe+0x5667FE0
	class ULevel* GetLevel();//Offset:Discovery.exe+0x5668070
	class AController* GetInstigatorController();//Offset:Discovery.exe+0x566D140
	class APawn* GetInstigator();//Offset:Discovery.exe+0x566D170
	struct FVector GetInputVectorAxisValue(const struct FKey& InputAxisKey);//Offset:Discovery.exe+0x566D1A0
	float GetInputAxisValue(const struct FName& InputAxisName);//Offset:Discovery.exe+0x566D390
	float GetInputAxisKeyValue(const struct FKey& InputAxisKey);//Offset:Discovery.exe+0x566D2A0
	float GetHorizontalDotProductTo(class AActor* OtherActor);//Offset:Discovery.exe+0x566BDF0
	float GetHorizontalDistanceTo(class AActor* OtherActor);//Offset:Discovery.exe+0x566C070
	float GetGameTimeSinceCreation();//Offset:Discovery.exe+0x56689C0
	float GetDotProductTo(class AActor* OtherActor);//Offset:Discovery.exe+0x566BE90
	float GetDistanceTo(class AActor* OtherActor);//Offset:Discovery.exe+0x566C1B0
	TArray<class UActorComponent*> GetComponentsByTag(class UClass* ComponentClass, const struct FName& Tag);//Offset:Discovery.exe+0x56677E0
	TArray<class UActorComponent*> GetComponentsByInterface(class UClass* Interface);//Offset:Discovery.exe+0x5667700
	class UActorComponent* GetComponentByClass(class UClass* ComponentClass);//Offset:Discovery.exe+0x56679E0
	struct FName GetAttachParentSocketName();//Offset:Discovery.exe+0x5667F60
	class AActor* GetAttachParentActor();//Offset:Discovery.exe+0x5667FB0
	void GetAttachedActors(bool bResetArray, bool bRecursivelyIncludeAttachedActors, TArray<class AActor*>* OutActors);//Offset:Discovery.exe+0x5667E00
	void GetAllChildActors(bool bIncludeDescendants, TArray<class AActor*>* ChildActors);//Offset:Discovery.exe+0x5668210
	struct FVector GetActorUpVector();//Offset:Discovery.exe+0x566CA40
	float GetActorTimeDilation();//Offset:Discovery.exe+0x5668D40
	float GetActorTickInterval();//Offset:Discovery.exe+0x5668560
	struct FVector GetActorScale3D();//Offset:Discovery.exe+0x566C250
	struct FVector GetActorRightVector();//Offset:Discovery.exe+0x566C980
	struct FVector GetActorRelativeScale3D();//Offset:Discovery.exe+0x5669ED0
	struct FVector GetActorForwardVector();//Offset:Discovery.exe+0x566CB00
	void GetActorEyesViewPoint(struct FVector* OutLocation, struct FRotator* OutRotation);//Offset:Discovery.exe+0x5667A80
	bool GetActorEnableCollision();//Offset:Discovery.exe+0x5669D60
	void GetActorBounds(bool bOnlyCollidingComponents, bool bIncludeFromChildActors, struct FVector* Origin, struct FVector* BoxExtent);//Offset:Discovery.exe+0x566C7E0
	void ForceNetUpdate();//Offset:Discovery.exe+0x5667CB0
	void FlushNetDormancy();//Offset:Discovery.exe+0x5668350
	void FinishAddComponent(class UActorComponent* Component, bool bManualAttachment, const struct FTransform& RelativeTransform);//Offset:Discovery.exe+0x5669720
	void EnableInput(class APlayerController* PlayerController);//Offset:Discovery.exe+0x4B6E770
	void DisableInput(class APlayerController* PlayerController);//Offset:Discovery.exe+0x1DB91F0
	void DetachRootComponentFromParent(bool bMaintainWorldPosition);//Offset:Discovery.exe+0x5668F40
	void AddTickPrerequisiteComponent(class UActorComponent* PrerequisiteComponent);//Offset:Discovery.exe+0x5668C00
	void AddTickPrerequisiteActor(class AActor* PrerequisiteActor);//Offset:Discovery.exe+0x5668CA0
	class UActorComponent* AddComponentByClass(class UClass* Class, bool bManualAttachment, const struct FTransform& RelativeTransform, bool bDeferredFinish);//Offset:Discovery.exe+0x56698C0
	class UActorComponent* AddComponent(const struct FName& TemplateName, bool bManualAttachment, const struct FTransform& RelativeTransform, class UObject* ComponentTemplateContext, bool bDeferredFinish);//Offset:Discovery.exe+0x5669AC0
	bool ActorHasTag(const struct FName& Tag);//Offset:Discovery.exe+0x5668D70
};


// Class Engine.Pawn
// 0x0080 (0x0348 - 0x02C8)
class APawn : public AActor
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x02C8(0x0008) MISSED OFFSET
	unsigned char                                      bUseControllerRotationPitch : 1;                          // 0x02D0(0x0001) (Edit, BlueprintVisible)
	unsigned char                                      bUseControllerRotationYaw : 1;                            // 0x02D0(0x0001) (Edit, BlueprintVisible)
	unsigned char                                      bUseControllerRotationRoll : 1;                           // 0x02D0(0x0001) (Edit, BlueprintVisible)
	unsigned char                                      bCanAffectNavigationGeneration : 1;                       // 0x02D0(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      UnknownData01 : 2;                                        // 0x02D0(0x0001)
	unsigned char                                      bIsLocalViewTarget : 1;                                   // 0x02D0(0x0001) (Transient)
	unsigned char                                      UnknownData02[0x3];                                       // 0x02D1(0x0003) MISSED OFFSET
	float                                              BaseEyeHeight;                                            // 0x02D4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TEnumAsByte<EAutoReceiveInput>                     AutoPossessPlayer;                                        // 0x02D8(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	enum class EAutoPossessAI                          AutoPossessAI;                                            // 0x02D9(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      RemoteViewPitch;                                          // 0x02DA(0x0001) (Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData03[0x5];                                       // 0x02DB(0x0005) MISSED OFFSET
	class UClass*                                      AIControllerClass;                                        // 0x02E0(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class APlayerState*                                PlayerState;                                              // 0x02E8(0x0008) (BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData04[0x8];                                       // 0x02F0(0x0008) MISSED OFFSET
	class AController*                                 LastHitBy;                                                // 0x02F8(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	class AController*                                 Controller;                                               // 0x0300(0x0008) (Net, ZeroConstructor, IsPlainOldData)
	class AController*                                 PreviousController;                                       // 0x0308(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData05[0x4];                                       // 0x0310(0x0004) MISSED OFFSET
	struct FScriptMulticastDelegate                    ReceiveControllerChangedDelegate;                         // 0x0314(0x0010) (InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    ReceiveRestartedDelegate;                                 // 0x0315(0x0010) (InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData06[0x2];                                       // 0x0316(0x0002) MISSED OFFSET
	struct FVector                                     ControlInputVector;                                       // 0x0318(0x0018) (ZeroConstructor, Transient, IsPlainOldData)
	struct FVector                                     LastControlInputVector;                                   // 0x0330(0x0018) (ZeroConstructor, Transient, IsPlainOldData)

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class Engine.Pawn"));
		return ptr;
	}


	void SpawnDefaultController();//Offset:Discovery.exe+0x56DEE30
	void SetCanAffectNavigationGeneration(bool bNewValue, bool bForceUpdate);//Offset:Discovery.exe+0x5815E30
	void ReceiveUnpossessed(class AController* OldController);//Offset:Discovery.exe+0x327F8B0
	void ReceiveRestarted();//Offset:Discovery.exe+0x327F8B0
	void ReceivePossessed(class AController* NewController);//Offset:Discovery.exe+0x327F8B0
	void ReceiveControllerChanged(class AController* OldController, class AController* NewController);//Offset:Discovery.exe+0x327F8B0
	void PawnMakeNoise(float Loudness, const struct FVector& NoiseLocation, bool bUseNoiseMakerLocation, class AActor* NoiseMaker);//Offset:Discovery.exe+0x5816120
	void OnRep_PlayerState();//Offset:Discovery.exe+0x5815F20
	void OnRep_Controller();//Offset:Discovery.exe+0x1F9DD30
	bool IsPlayerControlled();//Offset:Discovery.exe+0x5815D60
	bool IsPawnControlled();//Offset:Discovery.exe+0x5815FC0
	bool IsMoveInputIgnored();//Offset:Discovery.exe+0x5815840
	bool IsLocallyViewed();//Offset:Discovery.exe+0x58160C0
	bool IsLocallyControlled();//Offset:Discovery.exe+0x5815D90
	bool IsControlled();//Offset:Discovery.exe+0x5815FF0
	bool IsBotControlled();//Offset:Discovery.exe+0x5815D30
	struct FVector GetPendingMovementInputVector();//Offset:Discovery.exe+0x5815B10
	struct FVector GetNavAgentLocation();//Offset:Discovery.exe+0x5815DC0
	class UPawnMovementComponent* GetMovementComponent();//Offset:Discovery.exe+0x56E9D70
	class AActor* STATIC_GetMovementBaseActor(class APawn* Pawn);//Offset:Discovery.exe+0x5816020
	class APlayerController* GetLocalViewingPlayerController();//Offset:Discovery.exe+0x58160F0
	struct FVector GetLastMovementInputVector();//Offset:Discovery.exe+0x5815AB0
	struct FRotator GetControlRotation();//Offset:Discovery.exe+0x5815F40
	class AController* GetController();//Offset:Discovery.exe+0x5815FA0
	struct FRotator GetBaseAimRotation();//Offset:Discovery.exe+0x5815CD0
	void DetachFromControllerPendingDestroy();//Offset:Discovery.exe+0x5815CB0
	struct FVector ConsumeMovementInputVector();//Offset:Discovery.exe+0x5815A50
	void AddMovementInput(const struct FVector& WorldDirection, float ScaleValue, bool bForce);//Offset:Discovery.exe+0x5815B70
	void AddControllerYawInput(float Val);//Offset:Discovery.exe+0x5815910
	void AddControllerRollInput(float Val);//Offset:Discovery.exe+0x5815870
	void AddControllerPitchInput(float Val);//Offset:Discovery.exe+0x58159B0
};


// Class Engine.Character
// 0x0308 (0x0650 - 0x0348)
class ACharacter : public APawn
{
public:
	class USkeletalMeshComponent*                      Mesh;                                                     // 0x0348(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	class UCharacterMovementComponent*                 CharacterMovement;                                        // 0x0350(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	class UCapsuleComponent*                           CapsuleComponent;                                         // 0x0358(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	struct FBasedMovementInfo                          BasedMovement;                                            // 0x0360(0x0048)
	struct FBasedMovementInfo                          ReplicatedBasedMovement;                                  // 0x03A8(0x0048) (Net)
	float                                              AnimRootMotionTranslationScale;                           // 0x03F0(0x0004) (Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x03F4(0x0004) MISSED OFFSET
	struct FVector                                     BaseTranslationOffset;                                    // 0x03F8(0x0018) (ZeroConstructor, IsPlainOldData)
	struct FQuat                                       BaseRotationOffset;                                       // 0x0410(0x0020) (IsPlainOldData)
	float                                              ReplicatedServerLastTransformUpdateTimeStamp;             // 0x0430(0x0004) (Net, ZeroConstructor, IsPlainOldData)
	float                                              ReplayLastTransformUpdateTimeStamp;                       // 0x0434(0x0004) (Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      ReplicatedMovementMode;                                   // 0x0438(0x0001) (Net, ZeroConstructor, IsPlainOldData)
	bool                                               bInBaseReplication;                                       // 0x0439(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x2];                                       // 0x043A(0x0002) MISSED OFFSET
	float                                              CrouchedEyeHeight;                                        // 0x043C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      bIsCrouched : 1;                                          // 0x0440(0x0001) (BlueprintVisible, BlueprintReadOnly, Net)
	unsigned char                                      bProxyIsJumpForceApplied : 1;                             // 0x0440(0x0001) (Net, Transient)
	unsigned char                                      bPressedJump : 1;                                         // 0x0440(0x0001) (BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bClientUpdating : 1;                                      // 0x0440(0x0001) (Transient)
	unsigned char                                      bClientWasFalling : 1;                                    // 0x0440(0x0001) (Transient)
	unsigned char                                      bClientResimulateRootMotion : 1;                          // 0x0440(0x0001) (Transient)
	unsigned char                                      bClientResimulateRootMotionSources : 1;                   // 0x0440(0x0001) (Transient)
	unsigned char                                      bSimGravityDisabled : 1;                                  // 0x0440(0x0001)
	unsigned char                                      bClientCheckEncroachmentOnNetUpdate : 1;                  // 0x0441(0x0001) (Transient)
	unsigned char                                      bServerMoveIgnoreRootMotion : 1;                          // 0x0441(0x0001) (Transient)
	unsigned char                                      bWasJumping : 1;                                          // 0x0441(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnTemplate, Transient, EditConst)
	unsigned char                                      UnknownData02[0x2];                                       // 0x0442(0x0002) MISSED OFFSET
	float                                              JumpKeyHoldTime;                                          // 0x0444(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData)
	float                                              JumpForceTimeRemaining;                                   // 0x0448(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData)
	float                                              ProxyJumpForceStartedTime;                                // 0x044C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData)
	float                                              JumpMaxHoldTime;                                          // 0x0450(0x0004) (Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData)
	int                                                JumpMaxCount;                                             // 0x0454(0x0004) (Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData)
	int                                                JumpCurrentCount;                                         // 0x0458(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData)
	int                                                JumpCurrentCountPreJump;                                  // 0x045C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData03[0x8];                                       // 0x0460(0x0008) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnReachedJumpApex;                                        // 0x0468(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData04[0x10];                                      // 0x0478(0x0010) MISSED OFFSET
	struct FScriptMulticastDelegate                    MovementModeChangedDelegate;                              // 0x0488(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnCharacterMovementUpdated;                               // 0x0498(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FRootMotionSourceGroup                      SavedRootMotion;                                          // 0x04A8(0x0048) (Transient)
	struct FRootMotionMovementParams                   ClientRootMotionParams;                                   // 0x04F0(0x0070) (Transient)
	TArray<struct FSimulatedRootMotionReplicatedMove>  RootMotionRepMoves;                                       // 0x0560(0x0010) (ZeroConstructor, Transient)
	struct FRepRootMotionMontage                       RepRootMotion;                                            // 0x0570(0x00D8) (Net)
	unsigned char                                      UnknownData05[0x8];                                       // 0x0648(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class Engine.Character"));
		return ptr;
	}


	void UnCrouch(bool bClientSimulation);//Offset:Discovery.exe+0x56C59E0
	void StopJumping();//Offset:Discovery.exe+0x56C60E0
	void StopAnimMontage(class UAnimMontage* AnimMontage);//Offset:Discovery.exe+0x56C5E70
	void ServerMovePacked(const struct FCharacterServerMovePackedBits& PackedBits);//Offset:Discovery.exe+0x56C9190
	void ServerMoveOld(float OldTimeStamp, const struct FVector_NetQuantize10& OldAccel, unsigned char OldMoveFlags);//Offset:Discovery.exe+0x56C7540
	void ServerMoveNoBase(float Timestamp, const struct FVector_NetQuantize10& InAccel, const struct FVector_NetQuantize100& ClientLoc, unsigned char CompressedMoveFlags, unsigned char ClientRoll, uint32_t View, unsigned char ClientMovementMode);//Offset:Discovery.exe+0x56C88B0
	void ServerMoveDualNoBase(float TimeStamp0, const struct FVector_NetQuantize10& InAccel0, unsigned char PendingFlags, uint32_t View0, float Timestamp, const struct FVector_NetQuantize10& InAccel, const struct FVector_NetQuantize100& ClientLoc, unsigned char NewFlags, unsigned char ClientRoll, uint32_t View, unsigned char ClientMovementMode);//Offset:Discovery.exe+0x56C7D00
	void ServerMoveDualHybridRootMotion(float TimeStamp0, const struct FVector_NetQuantize10& InAccel0, unsigned char PendingFlags, uint32_t View0, float Timestamp, const struct FVector_NetQuantize10& InAccel, const struct FVector_NetQuantize100& ClientLoc, unsigned char NewFlags, unsigned char ClientRoll, uint32_t View, class UPrimitiveComponent* ClientMovementBase, const struct FName& ClientBaseBoneName, unsigned char ClientMovementMode);//Offset:Discovery.exe+0x56C76C0
	void ServerMoveDual(float TimeStamp0, const struct FVector_NetQuantize10& InAccel0, unsigned char PendingFlags, uint32_t View0, float Timestamp, const struct FVector_NetQuantize10& InAccel, const struct FVector_NetQuantize100& ClientLoc, unsigned char NewFlags, unsigned char ClientRoll, uint32_t View, class UPrimitiveComponent* ClientMovementBase, const struct FName& ClientBaseBoneName, unsigned char ClientMovementMode);//Offset:Discovery.exe+0x56C8270
	void ServerMove(float Timestamp, const struct FVector_NetQuantize10& InAccel, const struct FVector_NetQuantize100& ClientLoc, unsigned char CompressedMoveFlags, unsigned char ClientRoll, uint32_t View, class UPrimitiveComponent* ClientMovementBase, const struct FName& ClientBaseBoneName, unsigned char ClientMovementMode);//Offset:Discovery.exe+0x56C8C30
	void RootMotionDebugClientPrintOnScreen(const struct FString& InString);//Offset:Discovery.exe+0x56C58A0
	float PlayAnimMontage(class UAnimMontage* AnimMontage, float InPlayRate, const struct FName& StartSectionName);//Offset:Discovery.exe+0x56C5F10
	void OnWalkingOffLedge(const struct FVector& PreviousFloorImpactNormal, const struct FVector& PreviousFloorContactNormal, const struct FVector& PreviousLocation, float TimeDelta);//Offset:Discovery.exe+0x56C5B20
	void OnRep_RootMotion();//Offset:Discovery.exe+0x56C5880
	void OnRep_ReplicatedBasedMovement();//Offset:Discovery.exe+0x56C6270
	void OnRep_ReplayLastTransformUpdateTimeStamp();//Offset:Discovery.exe+0x56C6250
	void OnRep_IsCrouched();//Offset:Discovery.exe+0x56C6120
	void OnLaunched(const struct FVector& LaunchVelocity, bool bXYOverride, bool bZOverride);//Offset:Discovery.exe+0x327F8B0
	void OnLanded(const struct FHitResult& Hit);//Offset:Discovery.exe+0x327F8B0
	void OnJumped();//Offset:Discovery.exe+0x56C5CD0
	void LaunchCharacter(const struct FVector& LaunchVelocity, bool bXYOverride, bool bZOverride);//Offset:Discovery.exe+0x56C5CF0
	void K2_UpdateCustomMovement(float DeltaTime);//Offset:Discovery.exe+0x327F8B0
	void K2_OnStartCrouch(float HalfHeightAdjust, float ScaledHalfHeightAdjust);//Offset:Discovery.exe+0x327F8B0
	void K2_OnMovementModeChanged(TEnumAsByte<EMovementMode> PrevMovementMode, TEnumAsByte<EMovementMode> NewMovementMode, unsigned char PrevCustomMode, unsigned char NewCustomMode);//Offset:Discovery.exe+0x327F8B0
	void K2_OnEndCrouch(float HalfHeightAdjust, float ScaledHalfHeightAdjust);//Offset:Discovery.exe+0x327F8B0
	void Jump();//Offset:Discovery.exe+0x56C6100
	bool IsPlayingRootMotion();//Offset:Discovery.exe+0x56C5850
	bool IsPlayingNetworkedRootMotionMontage();//Offset:Discovery.exe+0x56C57F0
	bool IsJumpProvidingForce();//Offset:Discovery.exe+0x56C6050
	bool HasAnyRootMotion();//Offset:Discovery.exe+0x56C5820
	class UAnimMontage* GetCurrentMontage();//Offset:Discovery.exe+0x56C5E40
	struct FVector GetBaseTranslationOffset();//Offset:Discovery.exe+0x56C6200
	struct FRotator GetBaseRotationOffsetRotator();//Offset:Discovery.exe+0x56C6140
	float GetAnimRootMotionTranslationScale();//Offset:Discovery.exe+0x56C57C0
	void Crouch(bool bClientSimulation);//Offset:Discovery.exe+0x56C5A80
	void ClientVeryShortAdjustPosition(float Timestamp, const struct FVector& NewLoc, class UPrimitiveComponent* NewBase, const struct FName& NewBaseBoneName, bool bHasBase, bool bBaseRelativePosition, unsigned char ServerMovementMode);//Offset:Discovery.exe+0x56C6EB0
	void ClientMoveResponsePacked(const struct FCharacterMoveResponsePackedBits& PackedBits);//Offset:Discovery.exe+0x56C9090
	void ClientCheatWalk();//Offset:Discovery.exe+0x56C5990
	void ClientCheatGhost();//Offset:Discovery.exe+0x56C5950
	void ClientCheatFly();//Offset:Discovery.exe+0x56C5970
	void ClientAdjustRootMotionSourcePosition(float Timestamp, const struct FRootMotionSourceGroup& ServerRootMotion, bool bHasAnimRootMotion, float ServerMontageTrackPosition, const struct FVector& ServerLoc, const struct FVector_NetQuantizeNormal& ServerRotation, float ServerVelZ, class UPrimitiveComponent* ServerBase, const struct FName& ServerBoneName, bool bHasBase, bool bBaseRelativePosition, unsigned char ServerMovementMode);//Offset:Discovery.exe+0x56C63A0
	void ClientAdjustRootMotionPosition(float Timestamp, float ServerMontageTrackPosition, const struct FVector& ServerLoc, const struct FVector_NetQuantizeNormal& ServerRotation, float ServerVelZ, class UPrimitiveComponent* ServerBase, const struct FName& ServerBoneName, bool bHasBase, bool bBaseRelativePosition, unsigned char ServerMovementMode);//Offset:Discovery.exe+0x56C6AA0
	void ClientAdjustPosition(float Timestamp, const struct FVector& NewLoc, const struct FVector& NewVel, class UPrimitiveComponent* NewBase, const struct FName& NewBaseBoneName, bool bHasBase, bool bBaseRelativePosition, unsigned char ServerMovementMode);//Offset:Discovery.exe+0x56C7150
	void ClientAckGoodMove(float Timestamp);//Offset:Discovery.exe+0x56C74A0
	bool CanJumpInternal();//Offset:Discovery.exe+0x56C6080
	bool CanJump();//Offset:Discovery.exe+0x56C60B0
	bool CanCrouch();//Offset:Discovery.exe+0x56C59B0
	void CacheInitialMeshOffset(const struct FVector& MeshRelativeLocation, const struct FRotator& MeshRelativeRotation);//Offset:Discovery.exe+0x56C6290
};


// Class Engine.ActorComponent
// 0x0090 (0x00B8 - 0x0028)
class UActorComponent : public UObject
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0028(0x0008) MISSED OFFSET
	struct FActorComponentTickFunction                 PrimaryComponentTick;                                     // 0x0030(0x0030) (Edit, DisableEditOnInstance)
	TArray<struct FName>                               ComponentTags;                                            // 0x0060(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<class UAssetUserData*>                      AssetUserData;                                            // 0x0070(0x0010) (Edit, ExportObject, ZeroConstructor)
	unsigned char                                      UnknownData01[0x4];                                       // 0x0080(0x0004) MISSED OFFSET
	int                                                UCSSerializationIndex;                                    // 0x0084(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x4];                                       // 0x0088(0x0004) MISSED OFFSET
	unsigned char                                      UnknownData03 : 6;                                        // 0x008C(0x0001)
	unsigned char                                      bNetAddressable : 1;                                      // 0x008C(0x0001)
	unsigned char                                      bReplicates : 1;                                          // 0x008C(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, Net, DisableEditOnInstance)
	unsigned char                                      bUseRepKeyForReplication : 1;                             // 0x008D(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	unsigned char                                      UnknownData04 : 7;                                        // 0x008D(0x0001)
	unsigned char                                      UnknownData05 : 4;                                        // 0x008E(0x0001)
	unsigned char                                      bAutoActivate : 1;                                        // 0x008E(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bIsActive : 1;                                            // 0x008E(0x0001) (Net, Transient)
	unsigned char                                      bEditableWhenInherited : 1;                               // 0x008E(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      UnknownData06 : 1;                                        // 0x008E(0x0001)
	unsigned char                                      bCanEverAffectNavigation : 1;                             // 0x008F(0x0001) (Edit, Config)
	unsigned char                                      UnknownData07 : 1;                                        // 0x008F(0x0001)
	unsigned char                                      bIsEditorOnly : 1;                                        // 0x008F(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      UnknownData08[0x1];                                       // 0x0090(0x0001) MISSED OFFSET
	enum class EComponentCreationMethod                CreationMethod;                                           // 0x0091(0x0001) (ZeroConstructor, IsPlainOldData)
	struct FScriptMulticastDelegate                    OnComponentActivated;                                     // 0x0092(0x0010) (InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnComponentDeactivated;                                   // 0x0093(0x0010) (InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData09[0x4];                                       // 0x0094(0x0004) MISSED OFFSET
	TArray<struct FSimpleMemberReference>              UCSModifiedProperties;                                    // 0x0098(0x0010) (ZeroConstructor)
	unsigned char                                      UnknownData10[0x10];                                      // 0x00A8(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class Engine.ActorComponent"));
		return ptr;
	}


	void ToggleActive();//Offset:Discovery.exe+0x11B97D0
	void SetUsesReplicationKeyForReplication(bool bNewUserRepKeyForReplication);//Offset:Discovery.exe+0x5673CC0
	void SetTickGroup(TEnumAsByte<ETickingGroup> NewTickGroup);//Offset:Discovery.exe+0x56739C0
	void SetTickableWhenPaused(bool bTickableWhenPaused);//Offset:Discovery.exe+0x5673E20
	void SetReplicationKeyDirty();//Offset:Discovery.exe+0x5673D60
	void SetIsReplicated(bool ShouldReplicate);//Offset:Discovery.exe+0x5673D80
	void SetComponentTickIntervalAndCooldown(float TickInterval);//Offset:Discovery.exe+0x5673B20
	void SetComponentTickInterval(float TickInterval);//Offset:Discovery.exe+0x2F31CF0
	void SetComponentTickEnabled(bool bEnabled);//Offset:Discovery.exe+0x5673BF0
	void SetAutoActivate(bool bNewAutoActivate);//Offset:Discovery.exe+0x566D520
	void SetActive(bool bNewActive, bool bReset);//Offset:Discovery.exe+0x5673EF0
	void RemoveTickPrerequisiteComponent(class UActorComponent* PrerequisiteComponent);//Offset:Discovery.exe+0x5673740
	void RemoveTickPrerequisiteActor(class AActor* PrerequisiteActor);//Offset:Discovery.exe+0x56737E0
	void ReceiveTick(float DeltaSeconds);//Offset:Discovery.exe+0x327F8B0
	void ReceiveEndPlay(TEnumAsByte<EEndPlayReason> EndPlayReason);//Offset:Discovery.exe+0x327F8B0
	void ReceiveBeginPlay();//Offset:Discovery.exe+0x327F8B0
	void OnRep_IsActive();//Offset:Discovery.exe+0x191D9E0
	void K2_DestroyComponent(class UObject* Object);//Offset:Discovery.exe+0x5673A50
	bool IsComponentTickEnabled();//Offset:Discovery.exe+0x5673BC0
	bool IsBeingDestroyed();//Offset:Discovery.exe+0x56740A0
	bool IsActive();//Offset:Discovery.exe+0x5673EC0
	bool GetUsesReplicationKeyForReplication();//Offset:Discovery.exe+0x5673C90
	class AActor* GetOwner();//Offset:Discovery.exe+0x5674080
	float GetComponentTickInterval();//Offset:Discovery.exe+0x5673AF0
	void Deactivate();//Offset:Discovery.exe+0x1DB5730
	bool ComponentHasTag(const struct FName& Tag);//Offset:Discovery.exe+0x5673FE0
	void AddTickPrerequisiteComponent(class UActorComponent* PrerequisiteComponent);//Offset:Discovery.exe+0x5673880
	void AddTickPrerequisiteActor(class AActor* PrerequisiteActor);//Offset:Discovery.exe+0x5673920
	void Activate(bool bReset);//Offset:Discovery.exe+0x4B7B580
};


// Class Engine.MovementComponent
// 0x0068 (0x0120 - 0x00B8)
class UMovementComponent : public UActorComponent
{
public:
	class USceneComponent*                             UpdatedComponent;                                         // 0x00B8(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, DuplicateTransient, IsPlainOldData)
	class UPrimitiveComponent*                         UpdatedPrimitive;                                         // 0x00C0(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x8];                                       // 0x00C8(0x0008) MISSED OFFSET
	struct FVector                                     Velocity;                                                 // 0x00D0(0x0018) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FVector                                     PlaneConstraintNormal;                                    // 0x00E8(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FVector                                     PlaneConstraintOrigin;                                    // 0x0100(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      bUpdateOnlyIfRendered : 1;                                // 0x0118(0x0001) (Edit, BlueprintVisible)
	unsigned char                                      bAutoUpdateTickRegistration : 1;                          // 0x0118(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bTickBeforeOwner : 1;                                     // 0x0118(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bAutoRegisterUpdatedComponent : 1;                        // 0x0118(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bConstrainToPlane : 1;                                    // 0x0118(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bSnapToPlaneAtStart : 1;                                  // 0x0118(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bAutoRegisterPhysicsVolumeUpdates : 1;                    // 0x0118(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
