#pragma once

//   SDK By:if

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace sdk
{
//---------------------------------------------------------------------------
// Classes
//---------------------------------------------------------------------------

// Class GameplayAbilities.AbilitySystemComponent
// 0x12B0 (0x13D8 - 0x0128)
class UAbilitySystemComponent : public UGameplayTasksComponent
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0128(0x0010) MISSED OFFSET
	TArray<struct FAttributeDefaults>                  DefaultStartingData;                                      // 0x0138(0x0010) (Edit, ZeroConstructor)
	TArray<class UAttributeSet*>                       SpawnedAttributes;                                        // 0x0148(0x0010) (ExportObject, Net, ZeroConstructor)
	struct FName                                       AffectedAnimInstanceTag;                                  // 0x0158(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x1A0];                                     // 0x0160(0x01A0) MISSED OFFSET
	float                                              OutgoingDuration;                                         // 0x0300(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              IncomingDuration;                                         // 0x0304(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x20];                                      // 0x0308(0x0020) MISSED OFFSET
	TArray<struct FString>                             ClientDebugStrings;                                       // 0x0328(0x0010) (Net, ZeroConstructor)
	TArray<struct FString>                             ServerDebugStrings;                                       // 0x0338(0x0010) (Net, ZeroConstructor)
	unsigned char                                      UnknownData03[0x60];                                      // 0x0348(0x0060) MISSED OFFSET
	bool                                               UserAbilityActivationInhibited;                           // 0x03A8(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               ReplicationProxyEnabled;                                  // 0x03A9(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               bSuppressGrantAbility;                                    // 0x03AA(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               bSuppressGameplayCues;                                    // 0x03AB(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData04[0x4];                                       // 0x03AC(0x0004) MISSED OFFSET
	TArray<class AGameplayAbilityTargetActor*>         SpawnedTargetActors;                                      // 0x03B0(0x0010) (ZeroConstructor)
	unsigned char                                      UnknownData05[0x28];                                      // 0x03C0(0x0028) MISSED OFFSET
	class AActor*                                      OwnerActor;                                               // 0x03E8(0x0008) (Net, ZeroConstructor, IsPlainOldData)
	class AActor*                                      AvatarActor;                                              // 0x03F0(0x0008) (Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData06[0x10];                                      // 0x03F8(0x0010) MISSED OFFSET
	struct FGameplayAbilitySpecContainer               ActivatableAbilities;                                     // 0x0408(0x0128) (BlueprintVisible, BlueprintReadOnly, Net)
	unsigned char                                      UnknownData07[0x30];                                      // 0x0530(0x0030) MISSED OFFSET
	TArray<class UGameplayAbility*>                    AllReplicatedInstancedAbilities;                          // 0x0560(0x0010) (ZeroConstructor)
	unsigned char                                      UnknownData08[0x210];                                     // 0x0570(0x0210) MISSED OFFSET
	struct FGameplayAbilityRepAnimMontage              RepAnimMontageInfo;                                       // 0x0780(0x0038) (Net)
	bool                                               bCachedIsNetSimulated;                                    // 0x07B8(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               bPendingMontageRep;                                       // 0x07B9(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData09[0x6];                                       // 0x07BA(0x0006) MISSED OFFSET
	struct FGameplayAbilityLocalAnimMontage            LocalAnimMontageInfo;                                     // 0x07C0(0x0030)
	unsigned char                                      UnknownData10[0xA0];                                      // 0x07F0(0x00A0) MISSED OFFSET
	struct FActiveGameplayEffectsContainer             ActiveGameplayEffects;                                    // 0x0890(0x0480) (Net)
	struct FActiveGameplayCueContainer                 ActiveGameplayCues;                                       // 0x0D10(0x0130) (Net)
	struct FActiveGameplayCueContainer                 MinimalReplicationGameplayCues;                           // 0x0E40(0x0130) (Net)
	unsigned char                                      UnknownData11[0x128];                                     // 0x0F70(0x0128) MISSED OFFSET
	TArray<unsigned char>                              BlockedAbilityBindings;                                   // 0x1098(0x0010) (Net, ZeroConstructor, Transient)
	unsigned char                                      UnknownData12[0x128];                                     // 0x10A8(0x0128) MISSED OFFSET
	struct FMinimalReplicationTagCountMap              MinimalReplicationTags;                                   // 0x11D0(0x0060) (Net)
	unsigned char                                      UnknownData13[0x10];                                      // 0x1230(0x0010) MISSED OFFSET
	struct FMinimalReplicationTagCountMap              ReplicatedLooseTags;                                      // 0x1240(0x0060) (Net)
	unsigned char                                      UnknownData14[0x8];                                       // 0x12A0(0x0008) MISSED OFFSET
	struct FReplicatedPredictionKeyMap                 ReplicatedPredictionKeyMap;                               // 0x12A8(0x0120) (Net)
	unsigned char                                      UnknownData15[0x10];                                      // 0x13C8(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class GameplayAbilities.AbilitySystemComponent"));
		return ptr;
	}


	void UpdateActiveGameplayEffectSetByCallerMagnitudes(const struct FActiveGameplayEffectHandle& ActiveHandle, TMap<struct FGameplayTag, float> NewSetByCallerValues);//Offset:Discovery.exe+0x1552E20
	void UpdateActiveGameplayEffectSetByCallerMagnitude(const struct FActiveGameplayEffectHandle& ActiveHandle, const struct FGameplayTag& SetByCallerTag, float NewValue);//Offset:Discovery.exe+0x1552FD0
	bool TryActivateAbilityByClass(class UClass* InAbilityToActivate, bool bAllowRemoteActivation);//Offset:Discovery.exe+0x154FC10
	bool TryActivateAbility(const struct FGameplayAbilitySpecHandle& AbilityToActivate, bool bAllowRemoteActivation);//Offset:Discovery.exe+0x154FB20
	bool TryActivateAbilitiesByTag(const struct FGameplayTagContainer& GameplayTagContainer, bool bAllowRemoteActivation);//Offset:Discovery.exe+0x154FD00
	void TargetConfirm();//Offset:Discovery.exe+0x154EC80
	void TargetCancel();//Offset:Discovery.exe+0x154EC60
	void SetUserAbilityActivationInhibited(bool NewInhibit);//Offset:Discovery.exe+0x154EE20
	void SetActiveGameplayEffectLevelUsingQuery(const struct FGameplayEffectQuery& Query, int NewLevel);//Offset:Discovery.exe+0x1552C00
	void SetActiveGameplayEffectLevel(const struct FActiveGameplayEffectHandle& ActiveHandle, int NewLevel);//Offset:Discovery.exe+0x1552D30
	void ServerTryActivateAbilityWithEventData(const struct FGameplayAbilitySpecHandle& AbilityToActivate, bool InputPressed, const struct FPredictionKey& PredictionKey, const struct FGameplayEventData& TriggerEventData);//Offset:Discovery.exe+0x154D2C0
	void ServerTryActivateAbility(const struct FGameplayAbilitySpecHandle& AbilityToActivate, bool InputPressed, const struct FPredictionKey& PredictionKey);//Offset:Discovery.exe+0x154D9B0
	void ServerSetReplicatedTargetDataCancelled(const struct FGameplayAbilitySpecHandle& AbilityHandle, const struct FPredictionKey& AbilityOriginalPredictionKey, const struct FPredictionKey& CurrentPredictionKey);//Offset:Discovery.exe+0x154DD10
	void ServerSetReplicatedTargetData(const struct FGameplayAbilitySpecHandle& AbilityHandle, const struct FPredictionKey& AbilityOriginalPredictionKey, const struct FGameplayAbilityTargetDataHandle& ReplicatedTargetDataHandle, const struct FGameplayTag& ApplicationTag, const struct FPredictionKey& CurrentPredictionKey);//Offset:Discovery.exe+0x154DF40
	void ServerSetReplicatedEventWithPayload(TEnumAsByte<EAbilityGenericReplicatedEvent> EventType, const struct FGameplayAbilitySpecHandle& AbilityHandle, const struct FPredictionKey& AbilityOriginalPredictionKey, const struct FPredictionKey& CurrentPredictionKey, const struct FVector_NetQuantize100& VectorPayload);//Offset:Discovery.exe+0x154E440
	void ServerSetReplicatedEvent(TEnumAsByte<EAbilityGenericReplicatedEvent> EventType, const struct FGameplayAbilitySpecHandle& AbilityHandle, const struct FPredictionKey& AbilityOriginalPredictionKey, const struct FPredictionKey& CurrentPredictionKey);//Offset:Discovery.exe+0x154E780
	void ServerSetInputReleased(const struct FGameplayAbilitySpecHandle& AbilityHandle);//Offset:Discovery.exe+0x154DB90
	void ServerSetInputPressed(const struct FGameplayAbilitySpecHandle& AbilityHandle);//Offset:Discovery.exe+0x154DC50
	void ServerPrintDebug_RequestWithStrings(TArray<struct FString> Strings);//Offset:Discovery.exe+0x154F4F0
	void ServerPrintDebug_Request();//Offset:Discovery.exe+0x154F600
	void ServerEndAbility(const struct FGameplayAbilitySpecHandle& AbilityToEnd, const struct FGameplayAbilityActivationInfo& ActivationInfo, const struct FPredictionKey& PredictionKey);//Offset:Discovery.exe+0x154CFE0
	void ServerCurrentMontageSetPlayRate(class UAnimMontage* ClientAnimMontage, float InPlayRate);//Offset:Discovery.exe+0x154C250
	void ServerCurrentMontageSetNextSectionName(class UAnimMontage* ClientAnimMontage, float ClientPosition, const struct FName& SectionName, const struct FName& NextSectionName);//Offset:Discovery.exe+0x154C470
	void ServerCurrentMontageJumpToSectionName(class UAnimMontage* ClientAnimMontage, const struct FName& SectionName);//Offset:Discovery.exe+0x154C360
	void ServerCancelAbility(const struct FGameplayAbilitySpecHandle& AbilityToCancel, const struct FGameplayAbilityActivationInfo& ActivationInfo);//Offset:Discovery.exe+0x154CD60
	void ServerAbilityRPCBatch(const struct FServerAbilityRPCBatch& BatchInfo);//Offset:Discovery.exe+0x154EEF0
	void RemoveActiveGameplayEffectBySourceEffect(class UClass* GameplayEffect, class UAbilitySystemComponent* InstigatorAbilitySystemComponent, int StacksToRemove);//Offset:Discovery.exe+0x1553560
	bool RemoveActiveGameplayEffect(const struct FActiveGameplayEffectHandle& Handle, int StacksToRemove);//Offset:Discovery.exe+0x1553690
	int RemoveActiveEffectsWithTags(const struct FGameplayTagContainer& Tags);//Offset:Discovery.exe+0x1552340
	int RemoveActiveEffectsWithSourceTags(const struct FGameplayTagContainer& Tags);//Offset:Discovery.exe+0x1552260
	int RemoveActiveEffectsWithGrantedTags(const struct FGameplayTagContainer& Tags);//Offset:Discovery.exe+0x1552180
	int RemoveActiveEffectsWithAppliedTags(const struct FGameplayTagContainer& Tags);//Offset:Discovery.exe+0x1552180
	void ReleaseInputID(int InputID);//Offset:Discovery.exe+0x154ECE0
	void PressInputID(int InputID);//Offset:Discovery.exe+0x154ED80
	void OnSpawnedAttributesEndPlayed(class AActor* InActor, TEnumAsByte<EEndPlayReason> EndPlayReason);//Offset:Discovery.exe+0x154EA20
	void OnRep_ServerDebugString();//Offset:Discovery.exe+0x154F380
	void OnRep_ReplicatedAnimMontage();//Offset:Discovery.exe+0x154C630
	void OnRep_OwningActor();//Offset:Discovery.exe+0x154EC40
	void OnRep_ClientDebugString();//Offset:Discovery.exe+0x154F3A0
	void OnRep_ActivateAbilities();//Offset:Discovery.exe+0x154DB70
	void OnOwnerActorDestroyed(class AActor* InActor);//Offset:Discovery.exe+0x154EB00
	void OnAvatarActorDestroyed(class AActor* InActor);//Offset:Discovery.exe+0x154EBA0
	void NetMulticast_InvokeGameplayCuesExecuted_WithParams(const struct FGameplayTagContainer& GameplayCueTags, const struct FPredictionKey& PredictionKey, const struct FGameplayCueParameters& GameplayCueParameters);//Offset:Discovery.exe+0x1551280
	void NetMulticast_InvokeGameplayCuesExecuted(const struct FGameplayTagContainer& GameplayCueTags, const struct FPredictionKey& PredictionKey, const struct FGameplayEffectContextHandle& EffectContext);//Offset:Discovery.exe+0x1551B10
	void NetMulticast_InvokeGameplayCuesAddedAndWhileActive_WithParams(const struct FGameplayTagContainer& GameplayCueTags, const struct FPredictionKey& PredictionKey, const struct FGameplayCueParameters& GameplayCueParameters);//Offset:Discovery.exe+0x15502D0
	void NetMulticast_InvokeGameplayCueExecuted_WithParams(const struct FGameplayTag& GameplayCueTag, const struct FPredictionKey& PredictionKey, const struct FGameplayCueParameters& GameplayCueParameters);//Offset:Discovery.exe+0x15516F0
	void NetMulticast_InvokeGameplayCueExecuted_FromSpec(const struct FGameplayEffectSpecForRPC& Spec, const struct FPredictionKey& PredictionKey);//Offset:Discovery.exe+0x1551F20
	void NetMulticast_InvokeGameplayCueExecuted(const struct FGameplayTag& GameplayCueTag, const struct FPredictionKey& PredictionKey, const struct FGameplayEffectContextHandle& EffectContext);//Offset:Discovery.exe+0x1551D50
	void NetMulticast_InvokeGameplayCueAddedAndWhileActive_WithParams(const struct FGameplayTag& GameplayCueTag, const struct FPredictionKey& PredictionKey, const struct FGameplayCueParameters& GameplayCueParameters);//Offset:Discovery.exe+0x1550740
	void NetMulticast_InvokeGameplayCueAddedAndWhileActive_FromSpec(const struct FGameplayEffectSpecForRPC& Spec, const struct FPredictionKey& PredictionKey);//Offset:Discovery.exe+0x1550B60
	void NetMulticast_InvokeGameplayCueAdded_WithParams(const struct FGameplayTag& GameplayCueTag, const struct FPredictionKey& PredictionKey, const struct FGameplayCueParameters& Parameters);//Offset:Discovery.exe+0x1550C90
	void NetMulticast_InvokeGameplayCueAdded(const struct FGameplayTag& GameplayCueTag, const struct FPredictionKey& PredictionKey, const struct FGameplayEffectContextHandle& EffectContext);//Offset:Discovery.exe+0x15510B0
	struct FGameplayEffectSpecHandle MakeOutgoingSpec(class UClass* GameplayEffectClass, float Level, const struct FGameplayEffectContextHandle& Context);//Offset:Discovery.exe+0x1553320
	struct FGameplayEffectContextHandle MakeEffectContext();//Offset:Discovery.exe+0x1553250
	void K2_InitStats(class UClass* Attributes, class UDataTable* DataTable);//Offset:Discovery.exe+0x1553CA0
	struct FGameplayAbilitySpecHandle K2_GiveAbilityAndActivateOnce(class UClass* AbilityClass, int Level, int InputID);//Offset:Discovery.exe+0x154FFA0
	struct FGameplayAbilitySpecHandle K2_GiveAbility(class UClass* AbilityClass, int Level, int InputID);//Offset:Discovery.exe+0x15500E0
	bool IsGameplayCueActive(const struct FGameplayTag& GameplayCueTag);//Offset:Discovery.exe+0x1550220
	void InputConfirm();//Offset:Discovery.exe+0x154ECC0
	void InputCancel();//Offset:Discovery.exe+0x154ECA0
	bool GetUserAbilityActivationInhibited();//Offset:Discovery.exe+0x154EEC0
	int GetGameplayTagCount(const struct FGameplayTag& GameplayTag);//Offset:Discovery.exe+0x1552A00
	float GetGameplayEffectMagnitude(const struct FActiveGameplayEffectHandle& Handle, const struct FGameplayAttribute& Attribute);//Offset:Discovery.exe+0x1552AA0
	int GetGameplayEffectCount(class UClass* SourceGameplayEffect, class UAbilitySystemComponent* OptionalInstigatorFilterComponent, bool bEnforceOnGoingCheck);//Offset:Discovery.exe+0x1553110
	float GetGameplayAttributeValue(const struct FGameplayAttribute& Attribute, bool* bFound);//Offset:Discovery.exe+0x15539B0
	class UAttributeSet* GetAttributeSet(class UClass* AttributeSetClass);//Offset:Discovery.exe+0x1553B10
	void GetAllAttributes(TArray<struct FGameplayAttribute>* OutAttributes);//Offset:Discovery.exe+0x1553BB0
	void GetAllAbilities(TArray<struct FGameplayAbilitySpecHandle>* OutAbilityHandles);//Offset:Discovery.exe+0x154FA70
	TArray<struct FActiveGameplayEffectHandle> GetActiveEffectsWithAllTags(const struct FGameplayTagContainer& Tags);//Offset:Discovery.exe+0x1552420
	TArray<struct FActiveGameplayEffectHandle> GetActiveEffects(const struct FGameplayEffectQuery& Query);//Offset:Discovery.exe+0x1552540
	void FindAllAbilitiesWithTags(const struct FGameplayTagContainer& Tags, bool bExactMatch, TArray<struct FGameplayAbilitySpecHandle>* OutAbilityHandles);//Offset:Discovery.exe+0x154F8D0
	void FindAllAbilitiesWithInputID(int InputID, TArray<struct FGameplayAbilitySpecHandle>* OutAbilityHandles);//Offset:Discovery.exe+0x154F650
	void FindAllAbilitiesMatchingQuery(const struct FGameplayTagQuery& Query, TArray<struct FGameplayAbilitySpecHandle>* OutAbilityHandles);//Offset:Discovery.exe+0x154F750
	void ClientTryActivateAbility(const struct FGameplayAbilitySpecHandle& AbilityToActivate);//Offset:Discovery.exe+0x154D220
	void ClientSetReplicatedEvent(TEnumAsByte<EAbilityGenericReplicatedEvent> EventType, const struct FGameplayAbilitySpecHandle& AbilityHandle, const struct FPredictionKey& AbilityOriginalPredictionKey);//Offset:Discovery.exe+0x154E2E0
	void ClientPrintDebug_Response(TArray<struct FString> Strings, int GameFlags);//Offset:Discovery.exe+0x154F3C0
	void ClientEndAbility(const struct FGameplayAbilitySpecHandle& AbilityToEnd, const struct FGameplayAbilityActivationInfo& ActivationInfo);//Offset:Discovery.exe+0x154CED0
	void ClientCancelAbility(const struct FGameplayAbilitySpecHandle& AbilityToCancel, const struct FGameplayAbilityActivationInfo& ActivationInfo);//Offset:Discovery.exe+0x154CC50
	void ClientActivateAbilitySucceedWithEventData(const struct FGameplayAbilitySpecHandle& AbilityToActivate, const struct FPredictionKey& PredictionKey, const struct FGameplayEventData& TriggerEventData);//Offset:Discovery.exe+0x154C650
	void ClientActivateAbilitySucceed(const struct FGameplayAbilitySpecHandle& AbilityToActivate, const struct FPredictionKey& PredictionKey);//Offset:Discovery.exe+0x154CA50
	void ClientActivateAbilityFailed(const struct FGameplayAbilitySpecHandle& AbilityToActivate, int16_t PredictionKey);//Offset:Discovery.exe+0x154CB60
	void ClearAllAbilitiesWithInputID(int InputID);//Offset:Discovery.exe+0x154FEE0
	void ClearAllAbilities();//Offset:Discovery.exe+0x154FF80
	void ClearAbility(const struct FGameplayAbilitySpecHandle& Handle);//Offset:Discovery.exe+0x154FE30
	struct FActiveGameplayEffectHandle BP_ApplyGameplayEffectToTarget(class UClass* GameplayEffectClass, class UAbilitySystemComponent* Target, float Level, const struct FGameplayEffectContextHandle& Context);//Offset:Discovery.exe+0x15527F0
	struct FActiveGameplayEffectHandle BP_ApplyGameplayEffectToSelf(class UClass* GameplayEffectClass, float Level, const struct FGameplayEffectContextHandle& EffectContext);//Offset:Discovery.exe+0x1552640
	struct FActiveGameplayEffectHandle BP_ApplyGameplayEffectSpecToTarget(const struct FGameplayEffectSpecHandle& SpecHandle, class UAbilitySystemComponent* Target);//Offset:Discovery.exe+0x1553870
	struct FActiveGameplayEffectHandle BP_ApplyGameplayEffectSpecToSelf(const struct FGameplayEffectSpecHandle& SpecHandle);//Offset:Discovery.exe+0x1553780
	void AbilityConfirmOrCancel__DelegateSignature();//Offset:Discovery.exe+0x327F8B0
	void AbilityAbilityKey__DelegateSignature(int InputID);//Offset:Discovery.exe+0x327F8B0
};


// Class GameplayAbilities.AbilityTask
// 0x0018 (0x0080 - 0x0068)
class UAbilityTask : public UGameplayTask
{
public:
	class UGameplayAbility*                            Ability;                                                  // 0x0068(0x0008) (ZeroConstructor, IsPlainOldData)
	class UAbilitySystemComponent*                     AbilitySystemComponent;                                   // 0x0070(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0078(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class GameplayAbilities.AbilityTask"));
		return ptr;
	}

};


// Class GameplayAbilities.AttributeSet
// 0x0008 (0x0030 - 0x0028)
class UAttributeSet : public UObject
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0028(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class GameplayAbilities.AttributeSet"));
		return ptr;
	}

};


// Class GameplayAbilities.GameplayAbility
// 0x0390 (0x03B8 - 0x0028)
class UGameplayAbility : public UObject
{
public:
	unsigned char                                      UnknownData00[0x80];                                      // 0x0028(0x0080) MISSED OFFSET
	struct FGameplayTagContainer                       AbilityTags;                                              // 0x00A8(0x0020) (Edit, DisableEditOnInstance)
	bool                                               bReplicateInputDirectly;                                  // 0x00C8(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               RemoteInstanceEnded;                                      // 0x00C9(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x00CA(0x0004) MISSED OFFSET
	TEnumAsByte<EGameplayAbilityReplicationPolicy>     ReplicationPolicy;                                        // 0x00CE(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TEnumAsByte<EGameplayAbilityInstancingPolicy>      InstancingPolicy;                                         // 0x00CF(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bServerRespectsRemoteAbilityCancellation;                 // 0x00D0(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bRetriggerInstancedAbility;                               // 0x00D1(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData02[0x6];                                       // 0x00D2(0x0006) MISSED OFFSET
	struct FGameplayAbilityActivationInfo              CurrentActivationInfo;                                    // 0x00D8(0x0020) (BlueprintVisible, BlueprintReadOnly)
	struct FGameplayEventData                          CurrentEventData;                                         // 0x00F8(0x00B0) (BlueprintVisible, BlueprintReadOnly)
	TEnumAsByte<EGameplayAbilityNetExecutionPolicy>    NetExecutionPolicy;                                       // 0x01A8(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TEnumAsByte<EGameplayAbilityNetSecurityPolicy>     NetSecurityPolicy;                                        // 0x01A9(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData03[0x6];                                       // 0x01AA(0x0006) MISSED OFFSET
	class UClass*                                      CostGameplayEffectClass;                                  // 0x01B0(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TArray<struct FAbilityTriggerData>                 AbilityTriggers;                                          // 0x01B8(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	class UClass*                                      CooldownGameplayEffectClass;                              // 0x01C8(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FGameplayTagContainer                       CancelAbilitiesWithTag;                                   // 0x01D0(0x0020) (Edit, DisableEditOnInstance)
	struct FGameplayTagContainer                       BlockAbilitiesWithTag;                                    // 0x01F0(0x0020) (Edit, DisableEditOnInstance)
	struct FGameplayTagContainer                       ActivationOwnedTags;                                      // 0x0210(0x0020) (Edit, DisableEditOnInstance)
	struct FGameplayTagContainer                       ActivationRequiredTags;                                   // 0x0230(0x0020) (Edit, DisableEditOnInstance)
	struct FGameplayTagContainer                       ActivationBlockedTags;                                    // 0x0250(0x0020) (Edit, DisableEditOnInstance)
	struct FGameplayTagContainer                       SourceRequiredTags;                                       // 0x0270(0x0020) (Edit, DisableEditOnInstance)
	struct FGameplayTagContainer                       SourceBlockedTags;                                        // 0x0290(0x0020) (Edit, DisableEditOnInstance)
	struct FGameplayTagContainer                       TargetRequiredTags;                                       // 0x02B0(0x0020) (Edit, DisableEditOnInstance)
	struct FGameplayTagContainer                       TargetBlockedTags;                                        // 0x02D0(0x0020) (Edit, DisableEditOnInstance)
	unsigned char                                      UnknownData04[0x20];                                      // 0x02F0(0x0020) MISSED OFFSET
	TArray<class UGameplayTask*>                       ActiveTasks;                                              // 0x0310(0x0010) (ZeroConstructor)
	unsigned char                                      UnknownData05[0x10];                                      // 0x0320(0x0010) MISSED OFFSET
	class UAnimMontage*                                CurrentMontage;                                           // 0x0330(0x0008) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData06[0x60];                                      // 0x0338(0x0060) MISSED OFFSET
	bool                                               bIsActive;                                                // 0x0398(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               bIsAbilityEnding;                                         // 0x0399(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               bIsCancelable;                                            // 0x039A(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               bIsBlockingOtherAbilities;                                // 0x039B(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData07[0x14];                                      // 0x039C(0x0014) MISSED OFFSET
	bool                                               bMarkPendingKillOnAbilityEnd;                             // 0x03B0(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData08[0x7];                                       // 0x03B1(0x0007) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class GameplayAbilities.GameplayAbility"));
		return ptr;
	}


	void SetShouldBlockOtherAbilities(bool bShouldBlockAbilities);//Offset:Discovery.exe+0x1573D80
	void SetCanBeCanceled(bool bCanBeCanceled);//Offset:Discovery.exe+0x1573CC0
	void SendGameplayEvent(const struct FGameplayTag& EventTag, const struct FGameplayEventData& Payload);//Offset:Discovery.exe+0x1573420
	void RemoveGrantedByEffect();//Offset:Discovery.exe+0x15737A0
	void MontageStop(float OverrideBlendOutTime);//Offset:Discovery.exe+0x1571A50
	void MontageSetNextSectionName(const struct FName& FromSectionName, const struct FName& ToSectionName);//Offset:Discovery.exe+0x1571AF0
	void MontageJumpToSection(const struct FName& SectionName);//Offset:Discovery.exe+0x1571BD0
	struct FGameplayAbilityTargetingLocationInfo MakeTargetLocationInfoFromOwnerSkeletalMeshComponent(const struct FName& SocketName);//Offset:Discovery.exe+0x1571860
	struct FGameplayAbilityTargetingLocationInfo MakeTargetLocationInfoFromOwnerActor();//Offset:Discovery.exe+0x1571980
	struct FGameplayEffectSpecHandle MakeOutgoingGameplayEffectSpec(class UClass* GameplayEffectClass, float Level);//Offset:Discovery.exe+0x1573EB0
	bool K2_ShouldAbilityRespondToEvent(const struct FGameplayAbilityActorInfo& ActorInfo, const struct FGameplayEventData& Payload);//Offset:Discovery.exe+0x327F8B0
	void K2_RemoveGameplayCue(const struct FGameplayTag& GameplayCueTag);//Offset:Discovery.exe+0x1571F40
	void K2_OnEndAbility(bool bWasCancelled);//Offset:Discovery.exe+0x327F8B0
	bool K2_HasAuthority();//Offset:Discovery.exe+0x1573E50
	void K2_ExecuteGameplayCueWithParams(const struct FGameplayTag& GameplayCueTag, const struct FGameplayCueParameters& GameplayCueParameters);//Offset:Discovery.exe+0x15723F0
	void K2_ExecuteGameplayCue(const struct FGameplayTag& GameplayCueTag, const struct FGameplayEffectContextHandle& Context);//Offset:Discovery.exe+0x1572610
	void K2_EndAbilityLocally();//Offset:Discovery.exe+0x15733E0
	void K2_EndAbility();//Offset:Discovery.exe+0x1573400
	void K2_CommitExecute();//Offset:Discovery.exe+0x327F8B0
	bool K2_CommitAbilityCost(bool BroadcastCommitEvent);//Offset:Discovery.exe+0x1573AE0
	bool K2_CommitAbilityCooldown(bool BroadcastCommitEvent, bool ForceCooldown);//Offset:Discovery.exe+0x1573B90
	bool K2_CommitAbility();//Offset:Discovery.exe+0x1573C90
	bool K2_CheckAbilityCost();//Offset:Discovery.exe+0x11BB1D0
	bool K2_CheckAbilityCooldown();//Offset:Discovery.exe+0x1573AB0
	void K2_CancelAbility();//Offset:Discovery.exe+0x1573D60
	bool K2_CanActivateAbility(const struct FGameplayAbilityActorInfo& ActorInfo, const struct FGameplayAbilitySpecHandle& Handle, struct FGameplayTagContainer* RelevantTags);//Offset:Discovery.exe+0x327F8B0
	TArray<struct FActiveGameplayEffectHandle> K2_ApplyGameplayEffectSpecToTarget(const struct FGameplayEffectSpecHandle& EffectSpecHandle, const struct FGameplayAbilityTargetDataHandle& TargetData);//Offset:Discovery.exe+0x1572AB0
	struct FActiveGameplayEffectHandle K2_ApplyGameplayEffectSpecToOwner(const struct FGameplayEffectSpecHandle& EffectSpecHandle);//Offset:Discovery.exe+0x15731B0
	void K2_AddGameplayCueWithParams(const struct FGameplayTag& GameplayCueTag, const struct FGameplayCueParameters& GameplayCueParameter, bool bRemoveOnAbilityEnd);//Offset:Discovery.exe+0x1571FE0
	void K2_AddGameplayCue(const struct FGameplayTag& GameplayCueTag, const struct FGameplayEffectContextHandle& Context, bool bRemoveOnAbilityEnd);//Offset:Discovery.exe+0x1572250
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& EventData);//Offset:Discovery.exe+0x327F8B0
	void K2_ActivateAbility();//Offset:Discovery.exe+0x327F8B0
	bool IsLocallyControlled();//Offset:Discovery.exe+0x1573E80
	void InvalidateClientPredictionKey();//Offset:Discovery.exe+0x15737C0
	class UObject* GetSourceObject_BP(const struct FGameplayAbilitySpecHandle& Handle, const struct FGameplayAbilityActorInfo& ActorInfo);//Offset:Discovery.exe+0x15737E0
	class USkeletalMeshComponent* GetOwningComponentFromActorInfo();//Offset:Discovery.exe+0x1574410
	class AActor* GetOwningActorFromActorInfo();//Offset:Discovery.exe+0x1574470
	struct FGameplayEffectContextHandle GetGrantedByEffectContext();//Offset:Discovery.exe+0x1574310
	class UObject* GetCurrentSourceObject();//Offset:Discovery.exe+0x1573900
	class UAnimMontage* GetCurrentMontage();//Offset:Discovery.exe+0x1573A80
	float GetCooldownTimeRemaining();//Offset:Discovery.exe+0x1573E20
	struct FGameplayEffectContextHandle GetContextFromOwner(const struct FGameplayAbilityTargetDataHandle& OptionalTargetData);//Offset:Discovery.exe+0x1574030
	class AActor* GetAvatarActorFromActorInfo();//Offset:Discovery.exe+0x1574440
	struct FGameplayAbilityActorInfo GetActorInfo();//Offset:Discovery.exe+0x15744A0
	class UAbilitySystemComponent* GetAbilitySystemComponentFromActorInfo();//Offset:Discovery.exe+0x15743E0
	int GetAbilityLevel_BP(const struct FGameplayAbilitySpecHandle& Handle, const struct FGameplayAbilityActorInfo& ActorInfo);//Offset:Discovery.exe+0x1573930
	int GetAbilityLevel();//Offset:Discovery.exe+0x1573A50
	void EndTaskByInstanceName(const struct FName& InstanceName);//Offset:Discovery.exe+0x1571DB0
	void EndAbilityState(const struct FName& OptionalStateNameToEnd);//Offset:Discovery.exe+0x1571C70
	void ConfirmTaskByInstanceName(const struct FName& InstanceName, bool bEndTask);//Offset:Discovery.exe+0x1571E50
	void CancelTaskByInstanceName(const struct FName& InstanceName);//Offset:Discovery.exe+0x1571D10
	void BP_RemoveGameplayEffectFromOwnerWithHandle(const struct FActiveGameplayEffectHandle& Handle, int StacksToRemove);//Offset:Discovery.exe+0x1572760
	void BP_RemoveGameplayEffectFromOwnerWithGrantedTags(const struct FGameplayTagContainer& WithGrantedTags, int StacksToRemove);//Offset:Discovery.exe+0x1572850
	void BP_RemoveGameplayEffectFromOwnerWithAssetTags(const struct FGameplayTagContainer& WithAssetTags, int StacksToRemove);//Offset:Discovery.exe+0x1572980
	TArray<struct FActiveGameplayEffectHandle> BP_ApplyGameplayEffectToTarget(const struct FGameplayAbilityTargetDataHandle& TargetData, class UClass* GameplayEffectClass, int GameplayEffectLevel, int Stacks);//Offset:Discovery.exe+0x1572DF0
	struct FActiveGameplayEffectHandle BP_ApplyGameplayEffectToOwner(class UClass* GameplayEffectClass, int GameplayEffectLevel, int Stacks);//Offset:Discovery.exe+0x15732A0
};


// Class GameplayAbilities.AbilityAsync
// 0x0008 (0x0038 - 0x0030)
class UAbilityAsync : public UCancellableAsyncAction
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0030(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class GameplayAbilities.AbilityAsync"));
		return ptr;
	}


	void EndAction();//Offset:Discovery.exe+0x11B68C0
};


// Class GameplayAbilities.AbilityAsync_WaitAttributeChanged
// 0x0058 (0x0090 - 0x0038)
class UAbilityAsync_WaitAttributeChanged : public UAbilityAsync
{
public:
	struct FScriptMulticastDelegate                    Changed;                                                  // 0x0038(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData00[0x48];                                      // 0x0048(0x0048) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class GameplayAbilities.AbilityAsync_WaitAttributeChanged"));
		return ptr;
	}


	class UAbilityAsync_WaitAttributeChanged* STATIC_WaitForAttributeChanged(class AActor* TargetActor, const struct FGameplayAttribute& Attribute, bool OnlyTriggerOnce);//Offset:Discovery.exe+0x15383A0
	void AsyncWaitAttributeChangedDelegate__DelegateSignature(const struct FGameplayAttribute& Attribute, float NewValue, float OldValue);//Offset:Discovery.exe+0x327F8B0
};


// Class GameplayAbilities.AbilityAsync_WaitGameplayEffectApplied
// 0x00D0 (0x0108 - 0x0038)
class UAbilityAsync_WaitGameplayEffectApplied : public UAbilityAsync
{
public:
	struct FScriptMulticastDelegate                    OnApplied;                                                // 0x0038(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData00[0xC0];                                      // 0x0048(0x00C0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class GameplayAbilities.AbilityAsync_WaitGameplayEffectApplied"));
		return ptr;
	}


	class UAbilityAsync_WaitGameplayEffectApplied* STATIC_WaitGameplayEffectAppliedToActor(class AActor* TargetActor, const struct FGameplayTargetDataFilterHandle& SourceFilter, const struct FGameplayTagRequirements& SourceTagRequirements, const struct FGameplayTagRequirements& TargetTagRequirements, bool TriggerOnce, bool ListenForPeriodicEffect);//Offset:Discovery.exe+0x1538850
	void OnAppliedDelegate__DelegateSignature(class AActor* Source, const struct FGameplayEffectSpecHandle& SpecHandle, const struct FActiveGameplayEffectHandle& ActiveHandle);//Offset:Discovery.exe+0x327F8B0
};


// Class GameplayAbilities.AbilityAsync_WaitGameplayEvent
// 0x0028 (0x0060 - 0x0038)
class UAbilityAsync_WaitGameplayEvent : public UAbilityAsync
{
public:
	struct FScriptMulticastDelegate                    EventReceived;                                            // 0x0038(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData00[0x18];                                      // 0x0048(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class GameplayAbilities.AbilityAsync_WaitGameplayEvent"));
		return ptr;
	}


	class UAbilityAsync_WaitGameplayEvent* STATIC_WaitGameplayEventToActor(class AActor* TargetActor, const struct FGameplayTag& EventTag, bool OnlyTriggerOnce, bool OnlyMatchExact);//Offset:Discovery.exe+0x1538FF0
	void EventReceivedDelegate__DelegateSignature(const struct FGameplayEventData& Payload);//Offset:Discovery.exe+0x327F8B0
};


// Class GameplayAbilities.AbilityAsync_WaitGameplayTag
// 0x0018 (0x0050 - 0x0038)
class UAbilityAsync_WaitGameplayTag : public UAbilityAsync
{
public:
	unsigned char                                      UnknownData00[0x18];                                      // 0x0038(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class GameplayAbilities.AbilityAsync_WaitGameplayTag"));
		return ptr;
	}

};


// Class GameplayAbilities.AbilityAsync_WaitGameplayTagAdded
// 0x0010 (0x0060 - 0x0050)
class UAbilityAsync_WaitGameplayTagAdded : public UAbilityAsync_WaitGameplayTag
{
public:
	struct FScriptMulticastDelegate                    Added;                                                    // 0x0050(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class GameplayAbilities.AbilityAsync_WaitGameplayTagAdded"));
		return ptr;
	}


	class UAbilityAsync_WaitGameplayTagAdded* STATIC_WaitGameplayTagAddToActor(class AActor* TargetActor, const struct FGameplayTag& Tag, bool OnlyTriggerOnce);//Offset:Discovery.exe+0x1539570
};


// Class GameplayAbilities.AbilityAsync_WaitGameplayTagRemoved
// 0x0010 (0x0060 - 0x0050)
class UAbilityAsync_WaitGameplayTagRemoved : public UAbilityAsync_WaitGameplayTag
{
public:
	struct FScriptMulticastDelegate                    Removed;                                                  // 0x0050(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class GameplayAbilities.AbilityAsync_WaitGameplayTagRemoved"));
		return ptr;
	}


	class UAbilityAsync_WaitGameplayTagRemoved* STATIC_WaitGameplayTagRemoveFromActor(class AActor* TargetActor, const struct FGameplayTag& Tag, bool OnlyTriggerOnce);//Offset:Discovery.exe+0x1539970
};


// Class GameplayAbilities.AbilitySystemBlueprintLibrary
// 0x0000 (0x0028 - 0x0028)
class UAbilitySystemBlueprintLibrary : public UBlueprintFunctionLibrary
{
public:

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class GameplayAbilities.AbilitySystemBlueprintLibrary"));
		return ptr;
	}


	bool STATIC_TargetDataHasOrigin(const struct FGameplayAbilityTargetDataHandle& TargetData, int Index);//Offset:Discovery.exe+0x1541C70
	bool STATIC_TargetDataHasHitResult(const struct FGameplayAbilityTargetDataHandle& HitResult, int Index);//Offset:Discovery.exe+0x1541FB0
	bool STATIC_TargetDataHasEndPoint(const struct FGameplayAbilityTargetDataHandle& TargetData, int Index);//Offset:Discovery.exe+0x1541910
	bool STATIC_TargetDataHasActor(const struct FGameplayAbilityTargetDataHandle& TargetData, int Index);//Offset:Discovery.exe+0x1542120
	struct FGameplayEffectSpecHandle STATIC_SetStackCountToMax(const struct FGameplayEffectSpecHandle& SpecHandle);//Offset:Discovery.exe+0x153B0A0
	struct FGameplayEffectSpecHandle STATIC_SetStackCount(const struct FGameplayEffectSpecHandle& SpecHandle, int StackCount);//Offset:Discovery.exe+0x153B210
	struct FGameplayEffectSpecHandle STATIC_SetDuration(const struct FGameplayEffectSpecHandle& SpecHandle, float Duration);//Offset:Discovery.exe+0x153BF30
	void STATIC_SendGameplayEventToActor(class AActor* Actor, const struct FGameplayTag& EventTag, const struct FGameplayEventData& Payload);//Offset:Discovery.exe+0x1545030
	bool STATIC_RemoveLooseGameplayTags(class AActor* Actor, const struct FGameplayTagContainer& GameplayTags, bool bShouldReplicate);//Offset:Discovery.exe+0x153AAA0
	bool STATIC_NotEqual_GameplayAttributeGameplayAttribute(const struct FGameplayAttribute& AttributeA, const struct FGameplayAttribute& AttributeB);//Offset:Discovery.exe+0x1543EE0
	bool STATIC_NotEqual_GameplayAbilitySpecHandle(const struct FGameplayAbilitySpecHandle& A, const struct FGameplayAbilitySpecHandle& B);//Offset:Discovery.exe+0x1539D20
	bool STATIC_NotEqual_ActiveGameplayEffectHandle(const struct FActiveGameplayEffectHandle& A, const struct FActiveGameplayEffectHandle& B);//Offset:Discovery.exe+0x153A120
	struct FGameplayEffectSpecHandle STATIC_MakeSpecHandle(class UGameplayEffect* InGameplayEffect, class AActor* InInstigator, class AActor* InEffectCauser, float InLevel);//Offset:Discovery.exe+0x1542960
	struct FGameplayCueParameters STATIC_MakeGameplayCueParameters(float NormalizedMagnitude, float RawMagnitude, const struct FGameplayEffectContextHandle& EffectContext, const struct FGameplayTag& MatchedTagName, const struct FGameplayTag& OriginalTag, const struct FGameplayTagContainer& AggregatedSourceTags, const struct FGameplayTagContainer& AggregatedTargetTags, const struct FVector& Location, const struct FVector& Normal, class AActor* Instigator, class AActor* EffectCauser, class UObject* SourceObject, class UPhysicalMaterial* PhysicalMaterial, int GameplayEffectLevel, int AbilityLevel, class USceneComponent* TargetAttachComponent, bool bReplicateLocationWhenUsingMinimalRepProxy);//Offset:Discovery.exe+0x153CF10
	struct FGameplayTargetDataFilterHandle STATIC_MakeFilterHandle(const struct FGameplayTargetDataFilter& Filter, class AActor* FilterActor);//Offset:Discovery.exe+0x1542B70
	bool STATIC_IsValid(const struct FGameplayAttribute& Attribute);//Offset:Discovery.exe+0x1544F40
	bool STATIC_IsInstigatorLocallyControlledPlayer(const struct FGameplayCueParameters& Parameters);//Offset:Discovery.exe+0x1540190
	bool STATIC_IsInstigatorLocallyControlled(const struct FGameplayCueParameters& Parameters);//Offset:Discovery.exe+0x15404D0
	bool STATIC_HasHitResult(const struct FGameplayCueParameters& Parameters);//Offset:Discovery.exe+0x153F430
	struct FTransform STATIC_GetTargetDataOrigin(const struct FGameplayAbilityTargetDataHandle& TargetData, int Index);//Offset:Discovery.exe+0x1541A80
	struct FTransform STATIC_GetTargetDataEndPointTransform(const struct FGameplayAbilityTargetDataHandle& TargetData, int Index);//Offset:Discovery.exe+0x1541590
	struct FVector STATIC_GetTargetDataEndPoint(const struct FGameplayAbilityTargetDataHandle& TargetData, int Index);//Offset:Discovery.exe+0x1541780
	struct FVector STATIC_GetOrigin(const struct FGameplayCueParameters& Parameters);//Offset:Discovery.exe+0x153E630
	float STATIC_GetModifiedAttributeMagnitude(const struct FGameplayEffectSpecHandle& SpecHandle, const struct FGameplayAttribute& Attribute);//Offset:Discovery.exe+0x153A900
	struct FTransform STATIC_GetInstigatorTransform(const struct FGameplayCueParameters& Parameters);//Offset:Discovery.exe+0x153E980
	class AActor* STATIC_GetInstigatorActor(const struct FGameplayCueParameters& Parameters);//Offset:Discovery.exe+0x153ED00
	struct FHitResult STATIC_GetHitResultFromTargetData(const struct FGameplayAbilityTargetDataHandle& HitResult, int Index);//Offset:Discovery.exe+0x1541DE0
	struct FHitResult STATIC_GetHitResult(const struct FGameplayCueParameters& Parameters);//Offset:Discovery.exe+0x153F770
	class UGameplayEffectUIData* STATIC_GetGameplayEffectUIData(class UClass* EffectClass, class UClass* DataType);//Offset:Discovery.exe+0x153A340
	class UGameplayEffect* STATIC_GetGameplayEffectFromActiveEffectHandle(const struct FActiveGameplayEffectHandle& ActiveHandle);//Offset:Discovery.exe+0x153A070
	bool STATIC_GetGameplayCueEndLocationAndNormal(class AActor* TargetActor, const struct FGameplayCueParameters& Parameters, struct FVector* Location, struct FVector* Normal);//Offset:Discovery.exe+0x153E1E0
	bool STATIC_GetGameplayCueDirection(class AActor* TargetActor, const struct FGameplayCueParameters& Parameters, struct FVector* Direction);//Offset:Discovery.exe+0x153DDF0
	class UGameplayAbility* STATIC_GetGameplayAbilityFromSpecHandle(class UAbilitySystemComponent* AbilitySystem, const struct FGameplayAbilitySpecHandle& AbilitySpecHandle, bool* bIsInstance);//Offset:Discovery.exe+0x1539F20
	float STATIC_GetFloatAttributeFromAbilitySystemComponent(class UAbilitySystemComponent* AbilitySystem, const struct FGameplayAttribute& Attribute, bool* bSuccessfullyFoundAttribute);//Offset:Discovery.exe+0x1544BE0
	float STATIC_GetFloatAttributeBaseFromAbilitySystemComponent(class UAbilitySystemComponent* AbilitySystemComponent, const struct FGameplayAttribute& Attribute, bool* bSuccessfullyFoundAttribute);//Offset:Discovery.exe+0x1544880
	float STATIC_GetFloatAttributeBase(class AActor* Actor, const struct FGameplayAttribute& Attribute, bool* bSuccessfullyFoundAttribute);//Offset:Discovery.exe+0x1544A30
	float STATIC_GetFloatAttribute(class AActor* Actor, const struct FGameplayAttribute& Attribute, bool* bSuccessfullyFoundAttribute);//Offset:Discovery.exe+0x1544D90
	struct FGameplayEffectContextHandle STATIC_GetEffectContext(const struct FGameplayEffectSpecHandle& SpecHandle);//Offset:Discovery.exe+0x153AF40
	int STATIC_GetDataCountFromTargetData(const struct FGameplayAbilityTargetDataHandle& TargetData);//Offset:Discovery.exe+0x15433C0
	TArray<struct FGameplayEffectSpecHandle> STATIC_GetAllLinkedGameplayEffectSpecHandles(const struct FGameplayEffectSpecHandle& SpecHandle);//Offset:Discovery.exe+0x153AD80
	TArray<class AActor*> STATIC_GetAllActorsFromTargetData(const struct FGameplayAbilityTargetDataHandle& TargetData);//Offset:Discovery.exe+0x1542450
	TArray<class AActor*> STATIC_GetActorsFromTargetData(const struct FGameplayAbilityTargetDataHandle& TargetData, int Index);//Offset:Discovery.exe+0x15425B0
	int STATIC_GetActorCount(const struct FGameplayCueParameters& Parameters);//Offset:Discovery.exe+0x153FE50
	class AActor* STATIC_GetActorByIndex(const struct FGameplayCueParameters& Parameters, int Index);//Offset:Discovery.exe+0x153FAC0
	float STATIC_GetActiveGameplayEffectTotalDuration(const struct FActiveGameplayEffectHandle& ActiveHandle);//Offset:Discovery.exe+0x153A5E0
	float STATIC_GetActiveGameplayEffectStartTime(const struct FActiveGameplayEffectHandle& ActiveHandle);//Offset:Discovery.exe+0x153A720
	int STATIC_GetActiveGameplayEffectStackLimitCount(const struct FActiveGameplayEffectHandle& ActiveHandle);//Offset:Discovery.exe+0x153A7C0
	int STATIC_GetActiveGameplayEffectStackCount(const struct FActiveGameplayEffectHandle& ActiveHandle);//Offset:Discovery.exe+0x153A860
	float STATIC_GetActiveGameplayEffectRemainingDuration(class UObject* WorldContextObject, const struct FActiveGameplayEffectHandle& ActiveHandle);//Offset:Discovery.exe+0x153A4F0
	float STATIC_GetActiveGameplayEffectExpectedEndTime(const struct FActiveGameplayEffectHandle& ActiveHandle);//Offset:Discovery.exe+0x153A680
	struct FString STATIC_GetActiveGameplayEffectDebugString(const struct FActiveGameplayEffectHandle& ActiveHandle);//Offset:Discovery.exe+0x153A420
	class UAbilitySystemComponent* STATIC_GetAbilitySystemComponent(class AActor* Actor);//Offset:Discovery.exe+0x15453F0
	void STATIC_ForwardGameplayCueToTarget(const TScriptInterface<class UGameplayCueInterface>& TargetCueInterface, TEnumAsByte<EGameplayCueEvent> EventType, const struct FGameplayCueParameters& Parameters);//Offset:Discovery.exe+0x153F040
	struct FGameplayAbilityTargetDataHandle STATIC_FilterTargetData(const struct FGameplayAbilityTargetDataHandle& TargetDataHandle, const struct FGameplayTargetDataFilterHandle& ActorFilterClass);//Offset:Discovery.exe+0x1542D20
	float STATIC_EvaluateAttributeValueWithTagsAndBase(class UAbilitySystemComponent* AbilitySystem, const struct FGameplayAttribute& Attribute, const struct FGameplayTagContainer& SourceTags, const struct FGameplayTagContainer& TargetTags, float BaseValue, bool* bSuccess);//Offset:Discovery.exe+0x1544260
	float STATIC_EvaluateAttributeValueWithTags(class UAbilitySystemComponent* AbilitySystem, const struct FGameplayAttribute& Attribute, const struct FGameplayTagContainer& SourceTags, const struct FGameplayTagContainer& TargetTags, bool* bSuccess);//Offset:Discovery.exe+0x15445A0
	bool STATIC_EqualEqual_GameplayAttributeGameplayAttribute(const struct FGameplayAttribute& AttributeA, const struct FGameplayAttribute& AttributeB);//Offset:Discovery.exe+0x15440A0
	bool STATIC_EqualEqual_GameplayAbilitySpecHandle(const struct FGameplayAbilitySpecHandle& A, const struct FGameplayAbilitySpecHandle& B);//Offset:Discovery.exe+0x1539E20
	bool STATIC_EqualEqual_ActiveGameplayEffectHandle(const struct FActiveGameplayEffectHandle& A, const struct FActiveGameplayEffectHandle& B);//Offset:Discovery.exe+0x153A230
	void STATIC_EffectContextSetOrigin(const struct FGameplayEffectContextHandle& EffectContext, const struct FVector& Origin);//Offset:Discovery.exe+0x1540C10
	bool STATIC_EffectContextIsValid(const struct FGameplayEffectContextHandle& EffectContext);//Offset:Discovery.exe+0x1541490
	bool STATIC_EffectContextIsInstigatorLocallyControlled(const struct FGameplayEffectContextHandle& EffectContext);//Offset:Discovery.exe+0x1541390
	bool STATIC_EffectContextHasHitResult(const struct FGameplayEffectContextHandle& EffectContext);//Offset:Discovery.exe+0x1541160
	class UObject* STATIC_EffectContextGetSourceObject(const struct FGameplayEffectContextHandle& EffectContext);//Offset:Discovery.exe+0x1540810
	class AActor* STATIC_EffectContextGetOriginalInstigatorActor(const struct FGameplayEffectContextHandle& EffectContext);//Offset:Discovery.exe+0x1540A10
	struct FVector STATIC_EffectContextGetOrigin(const struct FGameplayEffectContextHandle& EffectContext);//Offset:Discovery.exe+0x1540D70
	class AActor* STATIC_EffectContextGetInstigatorActor(const struct FGameplayEffectContextHandle& EffectContext);//Offset:Discovery.exe+0x1540B10
	struct FHitResult STATIC_EffectContextGetHitResult(const struct FGameplayEffectContextHandle& EffectContext);//Offset:Discovery.exe+0x1541260
	class AActor* STATIC_EffectContextGetEffectCauser(const struct FGameplayEffectContextHandle& EffectContext);//Offset:Discovery.exe+0x1540910
	void STATIC_EffectContextAddHitResult(const struct FGameplayEffectContextHandle& EffectContext, const struct FHitResult& HitResult, bool bReset);//Offset:Discovery.exe+0x1540E80
	bool STATIC_DoesTargetDataContainActor(const struct FGameplayAbilityTargetDataHandle& TargetData, int Index, class AActor* Actor);//Offset:Discovery.exe+0x1542290
	bool STATIC_DoesGameplayCueMeetTagRequirements(const struct FGameplayCueParameters& Parameters, const struct FGameplayTagRequirements& SourceTagReqs, const struct FGameplayTagRequirements& TargetTagReqs);//Offset:Discovery.exe+0x153D910
	struct FGameplayEffectSpecHandle STATIC_CloneSpecHandle(class AActor* InNewInstigator, class AActor* InEffectCauser, const struct FGameplayEffectSpecHandle& GameplayEffectSpecHandle_Clone);//Offset:Discovery.exe+0x1542760
	void STATIC_BreakGameplayCueParameters(const struct FGameplayCueParameters& Parameters, float* NormalizedMagnitude, float* RawMagnitude, struct FGameplayEffectContextHandle* EffectContext, struct FGameplayTag* MatchedTagName, struct FGameplayTag* OriginalTag, struct FGameplayTagContainer* AggregatedSourceTags, struct FGameplayTagContainer* AggregatedTargetTags, struct FVector* Location, struct FVector* Normal, class AActor** Instigator, class AActor** EffectCauser, class UObject** SourceObject, class UPhysicalMaterial** PhysicalMaterial, int* GameplayEffectLevel, int* AbilityLevel, class USceneComponent** TargetAttachComponent, bool* bReplicateLocationWhenUsingMinimalRepProxy);//Offset:Discovery.exe+0x153C4F0
	struct FGameplayEffectSpecHandle STATIC_AssignTagSetByCallerMagnitude(const struct FGameplayEffectSpecHandle& SpecHandle, const struct FGameplayTag& DataTag, float Magnitude);//Offset:Discovery.exe+0x153C0F0
	struct FGameplayEffectSpecHandle STATIC_AssignSetByCallerMagnitude(const struct FGameplayEffectSpecHandle& SpecHandle, const struct FName& DataName, float Magnitude);//Offset:Discovery.exe+0x153C2F0
	struct FGameplayAbilityTargetDataHandle STATIC_AppendTargetDataHandle(const struct FGameplayAbilityTargetDataHandle& TargetHandle, const struct FGameplayAbilityTargetDataHandle& HandleToAdd);//Offset:Discovery.exe+0x1543A80
	bool STATIC_AddLooseGameplayTags(class AActor* Actor, const struct FGameplayTagContainer& GameplayTags, bool bShouldReplicate);//Offset:Discovery.exe+0x153AC10
	struct FGameplayEffectSpecHandle STATIC_AddLinkedGameplayEffectSpec(const struct FGameplayEffectSpecHandle& SpecHandle, const struct FGameplayEffectSpecHandle& LinkedGameplayEffectSpec);//Offset:Discovery.exe+0x153B590
	struct FGameplayEffectSpecHandle STATIC_AddLinkedGameplayEffect(const struct FGameplayEffectSpecHandle& SpecHandle, class UClass* LinkedGameplayEffect);//Offset:Discovery.exe+0x153B3D0
	struct FGameplayEffectSpecHandle STATIC_AddGrantedTags(const struct FGameplayEffectSpecHandle& SpecHandle, const struct FGameplayTagContainer& NewGameplayTags);//Offset:Discovery.exe+0x153BB60
	struct FGameplayEffectSpecHandle STATIC_AddGrantedTag(const struct FGameplayEffectSpecHandle& SpecHandle, const struct FGameplayTag& NewGameplayTag);//Offset:Discovery.exe+0x153BD70
	struct FGameplayEffectSpecHandle STATIC_AddAssetTags(const struct FGameplayEffectSpecHandle& SpecHandle, const struct FGameplayTagContainer& NewGameplayTags);//Offset:Discovery.exe+0x153B790
	struct FGameplayEffectSpecHandle STATIC_AddAssetTag(const struct FGameplayEffectSpecHandle& SpecHandle, const struct FGameplayTag& NewGameplayTag);//Offset:Discovery.exe+0x153B9A0
	struct FGameplayAbilityTargetDataHandle STATIC_AbilityTargetDataFromLocations(const struct FGameplayAbilityTargetingLocationInfo& SourceLocation, const struct FGameplayAbilityTargetingLocationInfo& TargetLocation);//Offset:Discovery.exe+0x1543780
	struct FGameplayAbilityTargetDataHandle STATIC_AbilityTargetDataFromHitResult(const struct FHitResult& HitResult);//Offset:Discovery.exe+0x15434E0
	struct FGameplayAbilityTargetDataHandle STATIC_AbilityTargetDataFromActorArray(TArray<class AActor*> ActorArray, bool OneTargetPerHandle);//Offset:Discovery.exe+0x1543010
	struct FGameplayAbilityTargetDataHandle STATIC_AbilityTargetDataFromActor(class AActor* Actor);//Offset:Discovery.exe+0x1543220
};


// Class GameplayAbilities.AbilitySystemDebugHUD
// 0x0000 (0x03B8 - 0x03B8)
class AAbilitySystemDebugHUD : public AHUD
{
public:

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class GameplayAbilities.AbilitySystemDebugHUD"));
		return ptr;
	}

};


// Class GameplayAbilities.AbilitySystemGlobals
// 0x0238 (0x0260 - 0x0028)
class UAbilitySystemGlobals : public UObject
{
public:
	struct FSoftClassPath                              AbilitySystemGlobalsClassName;                            // 0x0028(0x0018) (ZeroConstructor, Config)
	unsigned char                                      UnknownData00[0x28];                                      // 0x0040(0x0028) MISSED OFFSET
	bool                                               bUseDebugTargetFromHud;                                   // 0x0068(0x0001) (ZeroConstructor, Config, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x0069(0x0003) MISSED OFFSET
	struct FGameplayTag                                ActivateFailIsDeadTag;                                    // 0x006C(0x0008)
	struct FName                                       ActivateFailIsDeadName;                                   // 0x0074(0x0008) (ZeroConstructor, Config, IsPlainOldData)
	struct FGameplayTag                                ActivateFailCooldownTag;                                  // 0x007C(0x0008)
	struct FName                                       ActivateFailCooldownName;                                 // 0x0084(0x0008) (ZeroConstructor, Config, IsPlainOldData)
	struct FGameplayTag                                ActivateFailCostTag;                                      // 0x008C(0x0008)
	struct FName                                       ActivateFailCostName;                                     // 0x0094(0x0008) (ZeroConstructor, Config, IsPlainOldData)
	struct FGameplayTag                                ActivateFailTagsBlockedTag;                               // 0x009C(0x0008)
	struct FName                                       ActivateFailTagsBlockedName;                              // 0x00A4(0x0008) (ZeroConstructor, Config, IsPlainOldData)
	struct FGameplayTag                                ActivateFailTagsMissingTag;                               // 0x00AC(0x0008)
	struct FName                                       ActivateFailTagsMissingName;                              // 0x00B4(0x0008) (ZeroConstructor, Config, IsPlainOldData)
	struct FGameplayTag                                ActivateFailNetworkingTag;                                // 0x00BC(0x0008)
	struct FName                                       ActivateFailNetworkingName;                               // 0x00C4(0x0008) (ZeroConstructor, Config, IsPlainOldData)
	int                                                MinimalReplicationTagCountBits;                           // 0x00CC(0x0004) (ZeroConstructor, Config, IsPlainOldData)
	struct FNetSerializeScriptStructCache              TargetDataStructCache;                                    // 0x00D0(0x0010)
	bool                                               bAllowGameplayModEvaluationChannels;                      // 0x00E0(0x0001) (ZeroConstructor, Config, IsPlainOldData)
