#pragma once

//   SDK By:if

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace sdk
{
//---------------------------------------------------------------------------
// Classes
//---------------------------------------------------------------------------

// Class HoudiniEngineRuntime.HoudiniAsset
// 0x0028 (0x0050 - 0x0028)
class UHoudiniAsset : public UObject
{
public:
	struct FString                                     AssetFileName;                                            // 0x0028(0x0010) (ZeroConstructor)
	TArray<unsigned char>                              AssetBytes;                                               // 0x0038(0x0010) (ZeroConstructor)
	uint32_t                                           AssetBytesCount;                                          // 0x0048(0x0004) (ZeroConstructor, IsPlainOldData)
	bool                                               bAssetLimitedCommercial;                                  // 0x004C(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               bAssetNonCommercial;                                      // 0x004D(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               bAssetExpanded;                                           // 0x004E(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x1];                                       // 0x004F(0x0001) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class HoudiniEngineRuntime.HoudiniAsset"));
		return ptr;
	}

};


// Class HoudiniEngineRuntime.HoudiniAssetActor
// 0x0008 (0x02D0 - 0x02C8)
class AHoudiniAssetActor : public AActor
{
public:
	class UHoudiniAssetComponent*                      HoudiniAssetComponent;                                    // 0x02C8(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class HoudiniEngineRuntime.HoudiniAssetActor"));
		return ptr;
	}

};


// Class HoudiniEngineRuntime.HoudiniAssetComponent
// 0x0550 (0x0AE0 - 0x0590)
class UHoudiniAssetComponent : public UPrimitiveComponent
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0590(0x0008) MISSED OFFSET
	class UHoudiniAsset*                               HoudiniAsset;                                             // 0x0598(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bCookOnParameterChange;                                   // 0x05A0(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               bUploadTransformsToHoudiniEngine;                         // 0x05A1(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               bCookOnTransformChange;                                   // 0x05A2(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               bCookOnAssetInputCook;                                    // 0x05A3(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               bOutputless;                                              // 0x05A4(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               bOutputTemplateGeos;                                      // 0x05A5(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               bUseOutputNodes;                                          // 0x05A6(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x1];                                       // 0x05A7(0x0001) MISSED OFFSET
	struct FDirectoryPath                              TemporaryCookFolder;                                      // 0x05A8(0x0010)
	struct FDirectoryPath                              BakeFolder;                                               // 0x05B8(0x0010)
	enum class EHoudiniStaticMeshMethod                StaticMeshMethod;                                         // 0x05C8(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x7];                                       // 0x05C9(0x0007) MISSED OFFSET
	struct FHoudiniStaticMeshGenerationProperties      StaticMeshGenerationProperties;                           // 0x05D0(0x01E0) (Edit)
	struct FMeshBuildSettings                          StaticMeshBuildSettings;                                  // 0x07B0(0x0048) (Edit)
	bool                                               bOverrideGlobalProxyStaticMeshSettings;                   // 0x07F8(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bEnableProxyStaticMeshOverride;                           // 0x07F9(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bEnableProxyStaticMeshRefinementByTimerOverride;          // 0x07FA(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData03[0x1];                                       // 0x07FB(0x0001) MISSED OFFSET
	float                                              ProxyMeshAutoRefineTimeoutSecondsOverride;                // 0x07FC(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bEnableProxyStaticMeshRefinementOnPreSaveWorldOverride;   // 0x0800(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bEnableProxyStaticMeshRefinementOnPreBeginPIEOverride;    // 0x0801(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData04[0x2];                                       // 0x0802(0x0002) MISSED OFFSET
	int                                                AssetId;                                                  // 0x0804(0x0004) (ZeroConstructor, DuplicateTransient, IsPlainOldData)
	TArray<int>                                        NodeIdsToCook;                                            // 0x0808(0x0010) (ZeroConstructor, Transient, DuplicateTransient)
	TMap<int, int>                                     OutputNodeCookCounts;                                     // 0x0818(0x0050) (Transient, DuplicateTransient)
	unsigned char                                      UnknownData05[0x50];                                      // 0x0868(0x0050) UNKNOWN PROPERTY: DownstreamHoudiniAssets
	struct FGuid                                       ComponentGUID;                                            // 0x08B8(0x0010) (ZeroConstructor, DuplicateTransient, IsPlainOldData)
	struct FGuid                                       HapiGUID;                                                 // 0x08C8(0x0010) (ZeroConstructor, DuplicateTransient, IsPlainOldData)
	struct FString                                     HapiAssetName;                                            // 0x08D8(0x0010) (ZeroConstructor, DuplicateTransient)
	enum class EHoudiniAssetState                      AssetState;                                               // 0x08E8(0x0001) (ZeroConstructor, DuplicateTransient, IsPlainOldData)
	enum class EHoudiniAssetState                      DebugLastAssetState;                                      // 0x08E9(0x0001) (ZeroConstructor, DuplicateTransient, IsPlainOldData)
	enum class EHoudiniAssetStateResult                AssetStateResult;                                         // 0x08EA(0x0001) (ZeroConstructor, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData06[0x5];                                       // 0x08EB(0x0005) MISSED OFFSET
	struct FTransform                                  LastComponentTransform;                                   // 0x08F0(0x0060) (DuplicateTransient, IsPlainOldData)
	uint32_t                                           SubAssetIndex;                                            // 0x0950(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                AssetCookCount;                                           // 0x0954(0x0004) (ZeroConstructor, DuplicateTransient, IsPlainOldData)
	bool                                               bHasBeenLoaded;                                           // 0x0958(0x0001) (ZeroConstructor, DuplicateTransient, IsPlainOldData)
	bool                                               bHasBeenDuplicated;                                       // 0x0959(0x0001) (ZeroConstructor, DuplicateTransient, IsPlainOldData)
	bool                                               bPendingDelete;                                           // 0x095A(0x0001) (ZeroConstructor, DuplicateTransient, IsPlainOldData)
	bool                                               bRecookRequested;                                         // 0x095B(0x0001) (ZeroConstructor, DuplicateTransient, IsPlainOldData)
	bool                                               bRebuildRequested;                                        // 0x095C(0x0001) (ZeroConstructor, DuplicateTransient, IsPlainOldData)
	bool                                               bEnableCooking;                                           // 0x095D(0x0001) (ZeroConstructor, DuplicateTransient, IsPlainOldData)
	bool                                               bForceNeedUpdate;                                         // 0x095E(0x0001) (ZeroConstructor, DuplicateTransient, IsPlainOldData)
	bool                                               bLastCookSuccess;                                         // 0x095F(0x0001) (ZeroConstructor, DuplicateTransient, IsPlainOldData)
	bool                                               bParameterDefinitionUpdateNeeded;                         // 0x0960(0x0001) (ZeroConstructor, DuplicateTransient, IsPlainOldData)
	bool                                               bBlueprintStructureModified;                              // 0x0961(0x0001) (ZeroConstructor, DuplicateTransient, IsPlainOldData)
	bool                                               bBlueprintModified;                                       // 0x0962(0x0001) (ZeroConstructor, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData07[0x5];                                       // 0x0963(0x0005) MISSED OFFSET
	TArray<class UHoudiniParameter*>                   Parameters;                                               // 0x0968(0x0010) (ExportObject, ZeroConstructor)
	TArray<class UHoudiniInput*>                       Inputs;                                                   // 0x0978(0x0010) (ExportObject, ZeroConstructor)
	TArray<class UHoudiniOutput*>                      Outputs;                                                  // 0x0988(0x0010) (ExportObject, ZeroConstructor)
	TArray<struct FHoudiniBakedOutput>                 BakedOutputs;                                             // 0x0998(0x0010) (ZeroConstructor)
	TArray<TWeakObjectPtr<class AActor>>               UntrackedOutputs;                                         // 0x09A8(0x0010) (ZeroConstructor)
	TArray<class UHoudiniHandleComponent*>             HandleComponents;                                         // 0x09B8(0x0010) (ExportObject, ZeroConstructor)
	bool                                               bHasComponentTransformChanged;                            // 0x09C8(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               bFullyLoaded;                                             // 0x09C9(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData08[0x6];                                       // 0x09CA(0x0006) MISSED OFFSET
	class UHoudiniPDGAssetLink*                        PDGAssetLink;                                             // 0x09D0(0x0008) (ZeroConstructor, IsPlainOldData)
	struct FTimerHandle                                RefineMeshesTimer;                                        // 0x09D8(0x0008)
	unsigned char                                      UnknownData09[0x18];                                      // 0x09E0(0x0018) MISSED OFFSET
	bool                                               bNoProxyMeshNextCookRequested;                            // 0x09F8(0x0001) (ZeroConstructor, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData10[0x7];                                       // 0x09F9(0x0007) MISSED OFFSET
	TMap<class UObject*, int>                          InputPresets;                                             // 0x0A00(0x0050) (Transient, DuplicateTransient)
	bool                                               bBakeAfterNextCook;                                       // 0x0A50(0x0001) (ZeroConstructor, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData11[0x5F];                                      // 0x0A51(0x005F) MISSED OFFSET
	bool                                               bCachedIsPreview;                                         // 0x0AB0(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData12[0xF];                                       // 0x0AB1(0x000F) MISSED OFFSET
	double                                             LastTickTime;                                             // 0x0AC0(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData13[0x18];                                      // 0x0AC8(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class HoudiniEngineRuntime.HoudiniAssetComponent"));
		return ptr;
	}

};


// Class HoudiniEngineRuntime.HoudiniAssetBlueprintComponent
// 0x0100 (0x0BE0 - 0x0AE0)
class UHoudiniAssetBlueprintComponent : public UHoudiniAssetComponent
{
public:
	unsigned char                                      UnknownData00[0x48];                                      // 0x0AE0(0x0048) MISSED OFFSET
	bool                                               FauxBPProperty;                                           // 0x0B28(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               bHoudiniAssetChanged;                                     // 0x0B29(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               bUpdatedFromTemplate;                                     // 0x0B2A(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               bIsInBlueprintEditor;                                     // 0x0B2B(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               bCanDeleteHoudiniNodes;                                   // 0x0B2C(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               bHasRegisteredComponentTemplate;                          // 0x0B2D(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData01[0xA];                                       // 0x0B2E(0x000A) MISSED OFFSET
	TMap<struct FHoudiniOutputObjectIdentifier, struct FGuid> CachedOutputNodes;                                        // 0x0B38(0x0050)
	TMap<struct FGuid, struct FGuid>                   CachedInputNodes;                                         // 0x0B88(0x0050)
	unsigned char                                      UnknownData02[0x8];                                       // 0x0BD8(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class HoudiniEngineRuntime.HoudiniAssetBlueprintComponent"));
		return ptr;
	}


	void SetToggleValueAt(const struct FString& Name, bool Value, int Index);//Offset:Discovery.exe+0x2F12040
	void SetFloatParameter(const struct FString& Name, float Value, int Index);//Offset:Discovery.exe+0x2F121D0
	bool HasParameter(const struct FString& Name);//Offset:Discovery.exe+0x2F12370
};


// Class HoudiniEngineRuntime.HoudiniAssetParameter
// 0x0058 (0x0080 - 0x0028)
class UHoudiniAssetParameter : public UObject
{
public:
	unsigned char                                      UnknownData00[0x58];                                      // 0x0028(0x0058) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class HoudiniEngineRuntime.HoudiniAssetParameter"));
		return ptr;
	}

};


// Class HoudiniEngineRuntime.HoudiniAssetParameterButton
// 0x0000 (0x0080 - 0x0080)
class UHoudiniAssetParameterButton : public UHoudiniAssetParameter
{
public:

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class HoudiniEngineRuntime.HoudiniAssetParameterButton"));
		return ptr;
	}

};


// Class HoudiniEngineRuntime.HoudiniAssetParameterChoice
// 0x0038 (0x00B8 - 0x0080)
class UHoudiniAssetParameterChoice : public UHoudiniAssetParameter
{
public:
	unsigned char                                      UnknownData00[0x38];                                      // 0x0080(0x0038) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class HoudiniEngineRuntime.HoudiniAssetParameterChoice"));
		return ptr;
	}

};


// Class HoudiniEngineRuntime.HoudiniAssetParameterColor
// 0x0010 (0x0090 - 0x0080)
class UHoudiniAssetParameterColor : public UHoudiniAssetParameter
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0080(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class HoudiniEngineRuntime.HoudiniAssetParameterColor"));
		return ptr;
	}

};


// Class HoudiniEngineRuntime.HoudiniAssetParameterFile
// 0x0028 (0x00A8 - 0x0080)
class UHoudiniAssetParameterFile : public UHoudiniAssetParameter
{
public:
	unsigned char                                      UnknownData00[0x28];                                      // 0x0080(0x0028) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class HoudiniEngineRuntime.HoudiniAssetParameterFile"));
		return ptr;
	}

};


// Class HoudiniEngineRuntime.HoudiniAssetParameterFloat
// 0x0038 (0x00B8 - 0x0080)
class UHoudiniAssetParameterFloat : public UHoudiniAssetParameter
{
public:
	unsigned char                                      UnknownData00[0x38];                                      // 0x0080(0x0038) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class HoudiniEngineRuntime.HoudiniAssetParameterFloat"));
		return ptr;
	}

};


// Class HoudiniEngineRuntime.HoudiniAssetParameterFolder
// 0x0000 (0x0080 - 0x0080)
class UHoudiniAssetParameterFolder : public UHoudiniAssetParameter
{
public:

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class HoudiniEngineRuntime.HoudiniAssetParameterFolder"));
		return ptr;
	}

};


// Class HoudiniEngineRuntime.HoudiniAssetParameterFolderList
// 0x0000 (0x0080 - 0x0080)
class UHoudiniAssetParameterFolderList : public UHoudiniAssetParameter
{
public:

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class HoudiniEngineRuntime.HoudiniAssetParameterFolderList"));
		return ptr;
	}

};


// Class HoudiniEngineRuntime.HoudiniAssetParameterInt
// 0x0030 (0x00B0 - 0x0080)
class UHoudiniAssetParameterInt : public UHoudiniAssetParameter
{
public:
	unsigned char                                      UnknownData00[0x30];                                      // 0x0080(0x0030) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class HoudiniEngineRuntime.HoudiniAssetParameterInt"));
		return ptr;
	}

};


// Class HoudiniEngineRuntime.HoudiniAssetParameterLabel
// 0x0000 (0x0080 - 0x0080)
class UHoudiniAssetParameterLabel : public UHoudiniAssetParameter
{
public:

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class HoudiniEngineRuntime.HoudiniAssetParameterLabel"));
		return ptr;
	}

};


// Class HoudiniEngineRuntime.HoudiniAssetParameterMultiparm
// 0x0008 (0x0088 - 0x0080)
class UHoudiniAssetParameterMultiparm : public UHoudiniAssetParameter
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0080(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class HoudiniEngineRuntime.HoudiniAssetParameterMultiparm"));
		return ptr;
	}

};


// Class HoudiniEngineRuntime.HoudiniAssetParameterRamp
// 0x0018 (0x0098 - 0x0080)
class UHoudiniAssetParameterRamp : public UHoudiniAssetParameter
{
public:
	unsigned char                                      UnknownData00[0x18];                                      // 0x0080(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class HoudiniEngineRuntime.HoudiniAssetParameterRamp"));
		return ptr;
	}

};


// Class HoudiniEngineRuntime.HoudiniAssetParameterSeparator
// 0x0000 (0x0080 - 0x0080)
class UHoudiniAssetParameterSeparator : public UHoudiniAssetParameter
{
public:

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class HoudiniEngineRuntime.HoudiniAssetParameterSeparator"));
		return ptr;
	}

};


// Class HoudiniEngineRuntime.HoudiniAssetParameterString
// 0x0010 (0x0090 - 0x0080)
class UHoudiniAssetParameterString : public UHoudiniAssetParameter
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0080(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class HoudiniEngineRuntime.HoudiniAssetParameterString"));
		return ptr;
	}

};


// Class HoudiniEngineRuntime.HoudiniAssetParameterToggle
// 0x0010 (0x0090 - 0x0080)
class UHoudiniAssetParameterToggle : public UHoudiniAssetParameter
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0080(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class HoudiniEngineRuntime.HoudiniAssetParameterToggle"));
		return ptr;
	}

};


// Class HoudiniEngineRuntime.HoudiniAssetComponentMaterials_V1
// 0x00A0 (0x00C8 - 0x0028)
class UHoudiniAssetComponentMaterials_V1 : public UObject
{
public:
	unsigned char                                      UnknownData00[0xA0];                                      // 0x0028(0x00A0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class HoudiniEngineRuntime.HoudiniAssetComponentMaterials_V1"));
		return ptr;
	}

};


// Class HoudiniEngineRuntime.HoudiniHandleComponent_V1
// 0x0090 (0x0360 - 0x02D0)
class UHoudiniHandleComponent_V1 : public USceneComponent
{
public:
	unsigned char                                      UnknownData00[0x90];                                      // 0x02D0(0x0090) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class HoudiniEngineRuntime.HoudiniHandleComponent_V1"));
		return ptr;
	}

};


// Class HoudiniEngineRuntime.HoudiniSplineComponent_V1
// 0x0120 (0x03F0 - 0x02D0)
class UHoudiniSplineComponent_V1 : public USceneComponent
{
public:
	unsigned char                                      UnknownData00[0x120];                                     // 0x02D0(0x0120) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class HoudiniEngineRuntime.HoudiniSplineComponent_V1"));
		return ptr;
	}

};


// Class HoudiniEngineRuntime.HoudiniAssetInput
// 0x0150 (0x01D0 - 0x0080)
class UHoudiniAssetInput : public UHoudiniAssetParameter
{
public:
	unsigned char                                      UnknownData00[0x150];                                     // 0x0080(0x0150) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class HoudiniEngineRuntime.HoudiniAssetInput"));
		return ptr;
	}

};


// Class HoudiniEngineRuntime.HoudiniAssetInstanceInput
// 0x0110 (0x0190 - 0x0080)
class UHoudiniAssetInstanceInput : public UHoudiniAssetParameter
{
public:
	unsigned char                                      UnknownData00[0x110];                                     // 0x0080(0x0110) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class HoudiniEngineRuntime.HoudiniAssetInstanceInput"));
		return ptr;
	}

};


// Class HoudiniEngineRuntime.HoudiniAssetInstanceInputField
// 0x0198 (0x01C0 - 0x0028)
class UHoudiniAssetInstanceInputField : public UObject
{
public:
	unsigned char                                      UnknownData00[0x198];                                     // 0x0028(0x0198) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class HoudiniEngineRuntime.HoudiniAssetInstanceInputField"));
		return ptr;
	}

};


// Class HoudiniEngineRuntime.HoudiniAssetComponent_V1
// 0x0550 (0x0AE0 - 0x0590)
class UHoudiniAssetComponent_V1 : public UPrimitiveComponent
{
public:
	unsigned char                                      bGeneratedDoubleSidedGeometry : 1;                        // 0x0590(0x0001) (Edit)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0591(0x0007) MISSED OFFSET
	class UPhysicalMaterial*                           GeneratedPhysMaterial;                                    // 0x0598(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	struct FBodyInstance                               DefaultBodyInstance;                                      // 0x05A0(0x0190) (Edit)
	TEnumAsByte<ECollisionTraceFlag>                   GeneratedCollisionTraceFlag;                              // 0x0730(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x0731(0x0003) MISSED OFFSET
	int                                                GeneratedLightMapResolution;                              // 0x0734(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              GeneratedDistanceFieldResolutionScale;                    // 0x0738(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	struct FWalkableSlopeOverride                      GeneratedWalkableSlopeOverride;                           // 0x073C(0x0010) (Edit, IsPlainOldData)
	int                                                GeneratedLightMapCoordinateIndex;                         // 0x074C(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      bGeneratedUseMaximumStreamingTexelRatio : 1;              // 0x0750(0x0001) (Edit)
	unsigned char                                      UnknownData02[0x3];                                       // 0x0751(0x0003) MISSED OFFSET
	float                                              GeneratedStreamingDistanceMultiplier;                     // 0x0754(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	class UFoliageType_InstancedStaticMesh*            GeneratedFoliageDefaultSettings;                          // 0x0758(0x0008) (Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	TArray<class UAssetUserData*>                      GeneratedAssetUserData;                                   // 0x0760(0x0010) (Edit, ExportObject, ZeroConstructor)
	struct FText                                       BakeFolder;                                               // 0x0770(0x0018)
	struct FText                                       TempCookFolder;                                           // 0x0788(0x0018)
	unsigned char                                      UnknownData03[0x340];                                     // 0x07A0(0x0340) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class HoudiniEngineRuntime.HoudiniAssetComponent_V1"));
		return ptr;
	}

};


// Class HoudiniEngineRuntime.HoudiniInstancedActorComponent_V1
// 0x0020 (0x02F0 - 0x02D0)
class UHoudiniInstancedActorComponent_V1 : public USceneComponent
{
public:
	unsigned char                                      UnknownData00[0x20];                                      // 0x02D0(0x0020) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class HoudiniEngineRuntime.HoudiniInstancedActorComponent_V1"));
		return ptr;
	}

};


// Class HoudiniEngineRuntime.HoudiniMeshSplitInstancerComponent_V1
// 0x0020 (0x02F0 - 0x02D0)
class UHoudiniMeshSplitInstancerComponent_V1 : public USceneComponent
{
public:
	unsigned char                                      UnknownData00[0x20];                                      // 0x02D0(0x0020) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class HoudiniEngineRuntime.HoudiniMeshSplitInstancerComponent_V1"));
		return ptr;
	}

};


// Class HoudiniEngineRuntime.HoudiniEngineCopyPropertiesInterface
// 0x0000 (0x0028 - 0x0028)
class UHoudiniEngineCopyPropertiesInterface : public UInterface
{
public:

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class HoudiniEngineRuntime.HoudiniEngineCopyPropertiesInterface"));
		return ptr;
	}

};


// Class HoudiniEngineRuntime.HoudiniHandleParameter
// 0x0010 (0x0038 - 0x0028)
class UHoudiniHandleParameter : public UObject
{
public:
	class UHoudiniParameter*                           AssetParameter;                                           // 0x0028(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	int                                                TupleIndex;                                               // 0x0030(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0034(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class HoudiniEngineRuntime.HoudiniHandleParameter"));
		return ptr;
	}

};


// Class HoudiniEngineRuntime.HoudiniHandleComponent
// 0x0040 (0x0310 - 0x02D0)
class UHoudiniHandleComponent : public USceneComponent
{
public:
	TArray<class UHoudiniHandleParameter*>             XformParms;                                               // 0x02D0(0x0010) (ZeroConstructor)
	class UHoudiniHandleParameter*                     RSTParm;                                                  // 0x02E0(0x0008) (ZeroConstructor, IsPlainOldData)
	class UHoudiniHandleParameter*                     RotOrderParm;                                             // 0x02E8(0x0008) (ZeroConstructor, IsPlainOldData)
	enum class EHoudiniHandleType                      HandleType;                                               // 0x02F0(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x02F1(0x0007) MISSED OFFSET
	struct FString                                     HandleName;                                               // 0x02F8(0x0010) (ZeroConstructor)
	unsigned char                                      UnknownData01[0x8];                                       // 0x0308(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class HoudiniEngineRuntime.HoudiniHandleComponent"));
		return ptr;
	}

};


// Class HoudiniEngineRuntime.HoudiniInput
// 0x0220 (0x0248 - 0x0028)
class UHoudiniInput : public UObject
{
public:
	struct FString                                     Name;                                                     // 0x0028(0x0010) (ZeroConstructor)
	struct FString                                     Label;                                                    // 0x0038(0x0010) (ZeroConstructor)
	enum class EHoudiniInputType                       Type;                                                     // 0x0048(0x0001) (ZeroConstructor, IsPlainOldData)
	enum class EHoudiniInputType                       PreviousType;                                             // 0x0049(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x2];                                       // 0x004A(0x0002) MISSED OFFSET
	int                                                AssetNodeId;                                              // 0x004C(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	int                                                InputNodeId;                                              // 0x0050(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	int                                                InputIndex;                                               // 0x0054(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                ParmId;                                                   // 0x0058(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               bIsObjectPathParameter;                                   // 0x005C(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x005D(0x0003) MISSED OFFSET
	TArray<int>                                        CreatedDataNodeIds;                                       // 0x0060(0x0010) (ZeroConstructor, Transient, DuplicateTransient)
	bool                                               bHasChanged;                                              // 0x0070(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               bNeedsToTriggerUpdate;                                    // 0x0071(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData02[0x6];                                       // 0x0072(0x0006) MISSED OFFSET
	struct FBox                                        CachedBounds;                                             // 0x0078(0x0038) (ZeroConstructor, IsPlainOldData)
	struct FString                                     Help;                                                     // 0x00B0(0x0010) (ZeroConstructor)
	enum class EHoudiniXformType                       KeepWorldTransform;                                       // 0x00C0(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               bPackBeforeMerge;                                         // 0x00C1(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               bImportAsReference;                                       // 0x00C2(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               bImportAsReferenceRotScaleEnabled;                        // 0x00C3(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               bImportAsReferenceBboxEnabled;                            // 0x00C4(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               bImportAsReferenceMaterialEnabled;                        // 0x00C5(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               bExportLODs;                                              // 0x00C6(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               bExportSockets;                                           // 0x00C7(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               bPreferNaniteFallbackMesh;                                // 0x00C8(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               bExportColliders;                                         // 0x00C9(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               bExportMaterialParameters;                                // 0x00CA(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               bCookOnCurveChanged;                                      // 0x00CB(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData03[0x4];                                       // 0x00CC(0x0004) MISSED OFFSET
	TArray<class UHoudiniInputObject*>                 GeometryInputObjects;                                     // 0x00D0(0x0010) (ZeroConstructor)
	bool                                               bStaticMeshChanged;                                       // 0x00E0(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData04[0x7];                                       // 0x00E1(0x0007) MISSED OFFSET
	TArray<class UHoudiniInputObject*>                 AssetInputObjects;                                        // 0x00E8(0x0010) (ZeroConstructor)
	bool                                               bInputAssetConnectedInHoudini;                            // 0x00F8(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData05[0x7];                                       // 0x00F9(0x0007) MISSED OFFSET
	TArray<class UHoudiniInputObject*>                 CurveInputObjects;                                        // 0x0100(0x0010) (ZeroConstructor)
	float                                              DefaultCurveOffset;                                       // 0x0110(0x0004) (ZeroConstructor, IsPlainOldData)
	bool                                               bAddRotAndScaleAttributesOnCurves;                        // 0x0114(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               bUseLegacyInputCurves;                                    // 0x0115(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData06[0x2];                                       // 0x0116(0x0002) MISSED OFFSET
	TArray<class UHoudiniInputObject*>                 LandscapeInputObjects;                                    // 0x0118(0x0010) (ZeroConstructor)
	bool                                               bLandscapeHasExportTypeChanged;                           // 0x0128(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData07[0x7];                                       // 0x0129(0x0007) MISSED OFFSET
	TArray<class UHoudiniInputObject*>                 WorldInputObjects;                                        // 0x0130(0x0010) (ZeroConstructor)
	TArray<class AActor*>                              WorldInputBoundSelectorObjects;                           // 0x0140(0x0010) (ZeroConstructor)
	bool                                               bIsWorldInputBoundSelector;                               // 0x0150(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               bWorldInputBoundSelectorAutoUpdate;                       // 0x0151(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData08[0x2];                                       // 0x0152(0x0002) MISSED OFFSET
	float                                              UnrealSplineResolution;                                   // 0x0154(0x0004) (ZeroConstructor, IsPlainOldData)
	TArray<class UHoudiniInputObject*>                 SkeletalInputObjects;                                     // 0x0158(0x0010) (ZeroConstructor)
	TArray<class UHoudiniInputObject*>                 GeometryCollectionInputObjects;                           // 0x0168(0x0010) (ZeroConstructor)
	unsigned char                                      UnknownData09[0x50];                                      // 0x0178(0x0050) UNKNOWN PROPERTY: LandscapeSelectedComponents
	unsigned char                                      UnknownData10[0x50];                                      // 0x01C8(0x0050) UNKNOWN PROPERTY: InputNodesPendingDelete
	TArray<class UHoudiniInputHoudiniSplineComponent*> LastInsertedInputs;                                       // 0x0218(0x0010) (ZeroConstructor, Transient, DuplicateTransient)
	TArray<class UHoudiniInputObject*>                 LastUndoDeletedInputs;                                    // 0x0228(0x0010) (ZeroConstructor, Transient, DuplicateTransient)
	bool                                               bUpdateInputLandscape;                                    // 0x0238(0x0001) (ZeroConstructor, IsPlainOldData)
	enum class EHoudiniLandscapeExportType             LandscapeExportType;                                      // 0x0239(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               bLandscapeExportSelectionOnly;                            // 0x023A(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               bLandscapeAutoSelectComponent;                            // 0x023B(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               bLandscapeExportMaterials;                                // 0x023C(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               bLandscapeExportLighting;                                 // 0x023D(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               bLandscapeExportNormalizedUVs;                            // 0x023E(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               bLandscapeExportTileUVs;                                  // 0x023F(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               bCanDeleteHoudiniNodes;                                   // 0x0240(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData11[0x7];                                       // 0x0241(0x0007) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class HoudiniEngineRuntime.HoudiniInput"));
		return ptr;
	}

};


// Class HoudiniEngineRuntime.HoudiniInputObject
// 0x00F8 (0x0120 - 0x0028)
class UHoudiniInputObject : public UObject
{
public:
	unsigned char                                      UnknownData00[0x28];                                      // 0x0028(0x0028) UNKNOWN PROPERTY: InputObject
	struct FTransform                                  Transform;                                                // 0x0050(0x0060) (IsPlainOldData)
	enum class EHoudiniInputObjectType                 Type;                                                     // 0x00B0(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x00B1(0x0003) MISSED OFFSET
	int                                                InputNodeId;                                              // 0x00B4(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	int                                                InputObjectNodeId;                                        // 0x00B8(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	struct FGuid                                       Guid;                                                     // 0x00BC(0x0010) (ZeroConstructor, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData02[0x2C];                                      // 0x00CC(0x002C) MISSED OFFSET
	bool                                               bHasChanged;                                              // 0x00F8(0x0001) (ZeroConstructor, DuplicateTransient, IsPlainOldData)
	bool                                               bNeedsToTriggerUpdate;                                    // 0x00F9(0x0001) (ZeroConstructor, DuplicateTransient, IsPlainOldData)
	bool                                               bTransformChanged;                                        // 0x00FA(0x0001) (ZeroConstructor, DuplicateTransient, IsPlainOldData)
	bool                                               bImportAsReference;                                       // 0x00FB(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               bImportAsReferenceRotScaleEnabled;                        // 0x00FC(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               bImportAsReferenceBboxEnabled;                            // 0x00FD(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               bImportAsReferenceMaterialEnabled;                        // 0x00FE(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData03[0x1];                                       // 0x00FF(0x0001) MISSED OFFSET
	TArray<struct FString>                             MaterialReferences;                                       // 0x0100(0x0010) (ZeroConstructor)
	bool                                               bCanDeleteHoudiniNodes;                                   // 0x0110(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData04[0xF];                                       // 0x0111(0x000F) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class HoudiniEngineRuntime.HoudiniInputObject"));
		return ptr;
	}

};


// Class HoudiniEngineRuntime.HoudiniInputStaticMesh
// 0x0000 (0x0120 - 0x0120)
class UHoudiniInputStaticMesh : public UHoudiniInputObject
{
public:

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class HoudiniEngineRuntime.HoudiniInputStaticMesh"));
		return ptr;
	}

};


// Class HoudiniEngineRuntime.HoudiniInputSkeletalMesh
// 0x0000 (0x0120 - 0x0120)
class UHoudiniInputSkeletalMesh : public UHoudiniInputObject
{
public:

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class HoudiniEngineRuntime.HoudiniInputSkeletalMesh"));
		return ptr;
	}

};


// Class HoudiniEngineRuntime.HoudiniInputGeometryCollection
// 0x0000 (0x0120 - 0x0120)
class UHoudiniInputGeometryCollection : public UHoudiniInputObject
{
public:

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class HoudiniEngineRuntime.HoudiniInputGeometryCollection"));
		return ptr;
	}

};


// Class HoudiniEngineRuntime.HoudiniInputSceneComponent
// 0x0060 (0x0180 - 0x0120)
class UHoudiniInputSceneComponent : public UHoudiniInputObject
{
public:
	struct FTransform                                  ActorTransform;                                           // 0x0120(0x0060) (IsPlainOldData)

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class HoudiniEngineRuntime.HoudiniInputSceneComponent"));
		return ptr;
	}

};


// Class HoudiniEngineRuntime.HoudiniInputMeshComponent
// 0x0030 (0x01B0 - 0x0180)
class UHoudiniInputMeshComponent : public UHoudiniInputSceneComponent
{
public:
	unsigned char                                      UnknownData00[0x28];                                      // 0x0180(0x0028) UNKNOWN PROPERTY: StaticMesh
	unsigned char                                      UnknownData01[0x8];                                       // 0x01A8(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class HoudiniEngineRuntime.HoudiniInputMeshComponent"));
		return ptr;
	}

};


// Class HoudiniEngineRuntime.HoudiniInputInstancedMeshComponent
// 0x0010 (0x01C0 - 0x01B0)
class UHoudiniInputInstancedMeshComponent : public UHoudiniInputMeshComponent
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x01B0(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class HoudiniEngineRuntime.HoudiniInputInstancedMeshComponent"));
		return ptr;
	}

};


// Class HoudiniEngineRuntime.HoudiniInputSplineComponent
// 0x0020 (0x01A0 - 0x0180)
class UHoudiniInputSplineComponent : public UHoudiniInputSceneComponent
{
public:
	int                                                NumberOfSplineControlPoints;                              // 0x0180(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              SplineLength;                                             // 0x0184(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              SplineResolution;                                         // 0x0188(0x0004) (ZeroConstructor, IsPlainOldData)
	bool                                               SplineClosed;                                             // 0x018C(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x018D(0x0003) MISSED OFFSET
	TArray<struct FTransform>                          SplineControlPoints;                                      // 0x0190(0x0010) (ZeroConstructor)

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class HoudiniEngineRuntime.HoudiniInputSplineComponent"));
		return ptr;
	}

};


// Class HoudiniEngineRuntime.HoudiniInputGeometryCollectionComponent
// 0x0000 (0x0180 - 0x0180)
class UHoudiniInputGeometryCollectionComponent : public UHoudiniInputSceneComponent
{
public:

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class HoudiniEngineRuntime.HoudiniInputGeometryCollectionComponent"));
		return ptr;
	}

};


// Class HoudiniEngineRuntime.HoudiniInputSkeletalMeshComponent
// 0x0000 (0x0180 - 0x0180)
class UHoudiniInputSkeletalMeshComponent : public UHoudiniInputSceneComponent
{
public:

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class HoudiniEngineRuntime.HoudiniInputSkeletalMeshComponent"));
		return ptr;
	}

};


// Class HoudiniEngineRuntime.HoudiniInputHoudiniSplineComponent
// 0x0010 (0x0130 - 0x0120)
class UHoudiniInputHoudiniSplineComponent : public UHoudiniInputObject
{
public:
	class UHoudiniSplineComponent*                     CachedComponent;                                          // 0x0120(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0128(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class HoudiniEngineRuntime.HoudiniInputHoudiniSplineComponent"));
		return ptr;
	}

};


// Class HoudiniEngineRuntime.HoudiniInputCameraComponent
// 0x0020 (0x01A0 - 0x0180)
class UHoudiniInputCameraComponent : public UHoudiniInputSceneComponent
{
public:
	float                                              FOV;                                                      // 0x0180(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              AspectRatio;                                              // 0x0184(0x0004) (ZeroConstructor, IsPlainOldData)
	bool                                               bIsOrthographic;                                          // 0x0188(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0189(0x0003) MISSED OFFSET
	float                                              OrthoWidth;                                               // 0x018C(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              OrthoNearClipPlane;                                       // 0x0190(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              OrthoFarClipPlane;                                        // 0x0194(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x8];                                       // 0x0198(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class HoudiniEngineRuntime.HoudiniInputCameraComponent"));
		return ptr;
	}

};


// Class HoudiniEngineRuntime.HoudiniInputHoudiniAsset
// 0x0000 (0x0120 - 0x0120)
class UHoudiniInputHoudiniAsset : public UHoudiniInputObject
{
public:

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class HoudiniEngineRuntime.HoudiniInputHoudiniAsset"));
		return ptr;
	}

};


// Class HoudiniEngineRuntime.HoudiniInputActor
// 0x0060 (0x0180 - 0x0120)
class UHoudiniInputActor : public UHoudiniInputObject
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0120(0x0008) MISSED OFFSET
	unsigned char                                      UnknownData01[0x50];                                      // 0x0120(0x0050) UNKNOWN PROPERTY: ActorSceneComponents
	int                                                LastUpdateNumComponentsAdded;                             // 0x0178(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                LastUpdateNumComponentsRemoved;                           // 0x017C(0x0004) (ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class HoudiniEngineRuntime.HoudiniInputActor"));
		return ptr;
	}

};


// Class HoudiniEngineRuntime.HoudiniInputLandscape
// 0x0070 (0x01F0 - 0x0180)
class UHoudiniInputLandscape : public UHoudiniInputActor
{
public:
	struct FTransform                                  CachedInputLandscapeTraqnsform;                           // 0x0180(0x0060) (IsPlainOldData)
	int                                                CachedNumLandscapeComponents;                             // 0x01E0(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0xC];                                       // 0x01E4(0x000C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class HoudiniEngineRuntime.HoudiniInputLandscape"));
		return ptr;
	}

};


// Class HoudiniEngineRuntime.HoudiniInputBrush
// 0x0020 (0x01A0 - 0x0180)
class UHoudiniInputBrush : public UHoudiniInputActor
{
public:
	TArray<struct FHoudiniBrushInfo>                   BrushesInfo;                                              // 0x0180(0x0010) (ZeroConstructor)
	class UModel*                                      CombinedModel;                                            // 0x0190(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               bIgnoreInputObject;                                       // 0x0198(0x0001) (ZeroConstructor, IsPlainOldData)
	TEnumAsByte<EBrushType>                            CachedInputBrushType;                                     // 0x0199(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x6];                                       // 0x019A(0x0006) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class HoudiniEngineRuntime.HoudiniInputBrush"));
		return ptr;
	}

};


// Class HoudiniEngineRuntime.HoudiniInputDataTable
// 0x0000 (0x0120 - 0x0120)
class UHoudiniInputDataTable : public UHoudiniInputObject
{
public:

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class HoudiniEngineRuntime.HoudiniInputDataTable"));
		return ptr;
	}

};


// Class HoudiniEngineRuntime.HoudiniInputFoliageType_InstancedStaticMesh
// 0x0000 (0x0120 - 0x0120)
class UHoudiniInputFoliageType_InstancedStaticMesh : public UHoudiniInputStaticMesh
{
public:

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class HoudiniEngineRuntime.HoudiniInputFoliageType_InstancedStaticMesh"));
		return ptr;
	}

};


// Class HoudiniEngineRuntime.HoudiniInputBlueprint
// 0x0060 (0x0180 - 0x0120)
class UHoudiniInputBlueprint : public UHoudiniInputObject
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0120(0x0008) MISSED OFFSET
	unsigned char                                      UnknownData01[0x50];                                      // 0x0120(0x0050) UNKNOWN PROPERTY: BPSceneComponents
	int                                                LastUpdateNumComponentsAdded;                             // 0x0178(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                LastUpdateNumComponentsRemoved;                           // 0x017C(0x0004) (ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class HoudiniEngineRuntime.HoudiniInputBlueprint"));
		return ptr;
	}

};


// Class HoudiniEngineRuntime.HoudiniInstancedActorComponent
// 0x0020 (0x02F0 - 0x02D0)
class UHoudiniInstancedActorComponent : public USceneComponent
{
public:
	class UObject*                                     InstancedObject;                                          // 0x02D0(0x0008) (Edit, ZeroConstructor, EditConst, IsPlainOldData)
	TArray<class AActor*>                              InstancedActors;                                          // 0x02D8(0x0010) (Edit, ZeroConstructor, DisableEditOnTemplate, EditConst)
