#pragma once

//   SDK By:if

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace sdk
{
//---------------------------------------------------------------------------
// Classes
//---------------------------------------------------------------------------

// Class Niagara.MovieSceneNiagaraTrack
// 0x0010 (0x00A0 - 0x0090)
class UMovieSceneNiagaraTrack : public UMovieSceneNameableTrack
{
public:
	TArray<class UMovieSceneSection*>                  Sections;                                                 // 0x0090(0x0010) (ExportObject, ZeroConstructor)

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class Niagara.MovieSceneNiagaraTrack"));
		return ptr;
	}

};


// Class Niagara.MovieSceneNiagaraParameterTrack
// 0x0020 (0x00C0 - 0x00A0)
class UMovieSceneNiagaraParameterTrack : public UMovieSceneNiagaraTrack
{
public:
	struct FNiagaraVariable                            Parameter;                                                // 0x00A0(0x0020)

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class Niagara.MovieSceneNiagaraParameterTrack"));
		return ptr;
	}

};


// Class Niagara.MovieSceneNiagaraBoolParameterTrack
// 0x0008 (0x00C8 - 0x00C0)
class UMovieSceneNiagaraBoolParameterTrack : public UMovieSceneNiagaraParameterTrack
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x00C0(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class Niagara.MovieSceneNiagaraBoolParameterTrack"));
		return ptr;
	}

};


// Class Niagara.MovieSceneNiagaraColorParameterTrack
// 0x0008 (0x00C8 - 0x00C0)
class UMovieSceneNiagaraColorParameterTrack : public UMovieSceneNiagaraParameterTrack
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x00C0(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class Niagara.MovieSceneNiagaraColorParameterTrack"));
		return ptr;
	}

};


// Class Niagara.MovieSceneNiagaraFloatParameterTrack
// 0x0008 (0x00C8 - 0x00C0)
class UMovieSceneNiagaraFloatParameterTrack : public UMovieSceneNiagaraParameterTrack
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x00C0(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class Niagara.MovieSceneNiagaraFloatParameterTrack"));
		return ptr;
	}

};


// Class Niagara.MovieSceneNiagaraIntegerParameterTrack
// 0x0008 (0x00C8 - 0x00C0)
class UMovieSceneNiagaraIntegerParameterTrack : public UMovieSceneNiagaraParameterTrack
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x00C0(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class Niagara.MovieSceneNiagaraIntegerParameterTrack"));
		return ptr;
	}

};


// Class Niagara.MovieSceneNiagaraSystemSpawnSection
// 0x0010 (0x00F8 - 0x00E8)
class UMovieSceneNiagaraSystemSpawnSection : public UMovieSceneSection
{
public:
	enum class ENiagaraSystemSpawnSectionStartBehavior SectionStartBehavior;                                     // 0x00E8(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x00E8(0x0003) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
	enum class ENiagaraSystemSpawnSectionEvaluateBehavior SectionEvaluateBehavior;                                  // 0x00EC(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x00EC(0x0003) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
	enum class ENiagaraSystemSpawnSectionEndBehavior   SectionEndBehavior;                                       // 0x00F0(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x3];                                       // 0x00F0(0x0003) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
	enum class ENiagaraAgeUpdateMode                   AgeUpdateMode;                                            // 0x00F4(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bAllowScalability;                                        // 0x00F5(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData03[0x2];                                       // 0x00F6(0x0002) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class Niagara.MovieSceneNiagaraSystemSpawnSection"));
		return ptr;
	}

};


// Class Niagara.MovieSceneNiagaraSystemTrack
// 0x0008 (0x00A8 - 0x00A0)
class UMovieSceneNiagaraSystemTrack : public UMovieSceneNiagaraTrack
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x00A0(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class Niagara.MovieSceneNiagaraSystemTrack"));
		return ptr;
	}

};


// Class Niagara.MovieSceneNiagaraVectorParameterTrack
// 0x0010 (0x00D0 - 0x00C0)
class UMovieSceneNiagaraVectorParameterTrack : public UMovieSceneNiagaraParameterTrack
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x00C0(0x0008) MISSED OFFSET
	int                                                ChannelsUsed;                                             // 0x00C8(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x00CC(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class Niagara.MovieSceneNiagaraVectorParameterTrack"));
		return ptr;
	}

};


// Class Niagara.NiagaraActor
// 0x0010 (0x02D8 - 0x02C8)
class ANiagaraActor : public AActor
{
public:
	class UNiagaraComponent*                           NiagaraComponent;                                         // 0x02C8(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	unsigned char                                      bDestroyOnSystemFinish : 1;                               // 0x02D0(0x0001)
	unsigned char                                      UnknownData00[0x7];                                       // 0x02D1(0x0007) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class Niagara.NiagaraActor"));
		return ptr;
	}


	void SetDestroyOnSystemFinish(bool bShouldDestroyOnSystemFinish);//Offset:Discovery.exe+0x184E020
	void OnNiagaraSystemFinished(class UNiagaraComponent* FinishedComponent);//Offset:Discovery.exe+0x184DF80
};


// Class Niagara.NiagaraBakerSettings
// 0x0198 (0x01C0 - 0x0028)
class UNiagaraBakerSettings : public UObject
{
public:
	float                                              StartSeconds;                                             // 0x0028(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              DurationSeconds;                                          // 0x002C(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	int                                                FramesPerSecond;                                          // 0x0030(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      bPreviewLooping : 1;                                      // 0x0034(0x0001) (Edit)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0035(0x0003) MISSED OFFSET
	struct FIntPoint                                   FramesPerDimension;                                       // 0x0038(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	TArray<struct FNiagaraBakerTextureSettings>        OutputTextures;                                           // 0x0040(0x0010) (Edit, ZeroConstructor)
	enum class ENiagaraBakerViewMode                   CameraViewportMode;                                       // 0x0050(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x0050(0x0003) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
	unsigned char                                      UnknownData02[0x4];                                       // 0x0054(0x0004) MISSED OFFSET
	struct FVector                                     CameraViewportLocation[0x7];                              // 0x0058(0x0018) (Edit, ZeroConstructor, IsPlainOldData)
	struct FRotator                                    CameraViewportRotation[0x7];                              // 0x0100(0x0018) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              CameraOrbitDistance;                                      // 0x01A8(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              CameraFOV;                                                // 0x01AC(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              CameraOrthoWidth;                                         // 0x01B0(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      bUseCameraAspectRatio : 1;                                // 0x01B4(0x0001) (Edit)
	unsigned char                                      UnknownData03[0x3];                                       // 0x01B5(0x0003) MISSED OFFSET
	float                                              CameraAspectRatio;                                        // 0x01B8(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      bRenderComponentOnly : 1;                                 // 0x01BC(0x0001) (Edit)
	unsigned char                                      UnknownData04[0x3];                                       // 0x01BD(0x0003) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class Niagara.NiagaraBakerSettings"));
		return ptr;
	}

};


// Class Niagara.NiagaraComponent
// 0x0290 (0x0820 - 0x0590)
class UNiagaraComponent : public UFXSystemComponent
{
public:
	class UNiagaraSystem*                              Asset;                                                    // 0x0590(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	enum class ENiagaraTickBehavior                    TickBehavior;                                             // 0x0598(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0599(0x0003) MISSED OFFSET
	int                                                RandomSeedOffset;                                         // 0x059C(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	struct FNiagaraUserRedirectionParameterStore       OverrideParameters;                                       // 0x05A0(0x00D8)
	unsigned char                                      bForceSolo : 1;                                           // 0x0678(0x0001) (Edit)
	unsigned char                                      bEnableGpuComputeDebug : 1;                               // 0x0678(0x0001) (Edit)
	unsigned char                                      UnknownData01[0x37];                                      // 0x0679(0x0037) MISSED OFFSET
	unsigned char                                      bAutoDestroy : 1;                                         // 0x06B0(0x0001)
	unsigned char                                      bRenderingEnabled : 1;                                    // 0x06B0(0x0001)
	unsigned char                                      bAutoManageAttachment : 1;                                // 0x06B0(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bAutoAttachWeldSimulatedBodies : 1;                       // 0x06B0(0x0001) (Edit, BlueprintVisible)
	unsigned char                                      UnknownData02[0x3];                                       // 0x06B1(0x0003) MISSED OFFSET
	float                                              MaxTimeBeforeForceUpdateTransform;                        // 0x06B4(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData03[0x8];                                       // 0x06B8(0x0008) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnSystemFinished;                                         // 0x06C0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	TWeakObjectPtr<class USceneComponent>              AutoAttachParent;                                         // 0x06D0(0x0008) (Edit, BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, IsPlainOldData)
	struct FName                                       AutoAttachSocketName;                                     // 0x06D8(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	enum class EAttachmentRule                         AutoAttachLocationRule;                                   // 0x06E0(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	enum class EAttachmentRule                         AutoAttachRotationRule;                                   // 0x06E1(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	enum class EAttachmentRule                         AutoAttachScaleRule;                                      // 0x06E2(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData04[0x9];                                       // 0x06E3(0x0009) MISSED OFFSET
	unsigned char                                      UnknownData05 : 4;                                        // 0x06EC(0x0001)
	unsigned char                                      bAllowScalability : 1;                                    // 0x06EC(0x0001) (Edit, BlueprintVisible)
	unsigned char                                      UnknownData06[0x123];                                     // 0x06ED(0x0123) MISSED OFFSET
	class UNiagaraCullProxyComponent*                  CullProxy;                                                // 0x0810(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	unsigned char                                      UnknownData07[0x8];                                       // 0x0818(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class Niagara.NiagaraComponent"));
		return ptr;
	}


	void SetVariableVec4(const struct FName& InVariableName, const struct FVector4& InValue);//Offset:Discovery.exe+0x18540C0
	void SetVariableVec3(const struct FName& InVariableName, const struct FVector& InValue);//Offset:Discovery.exe+0x1853CE0
	void SetVariableVec2(const struct FName& InVariableName, const struct FVector2D& InValue);//Offset:Discovery.exe+0x1853910
	void SetVariableTextureRenderTarget(const struct FName& InVariableName, class UTextureRenderTarget* TextureRenderTarget);//Offset:Discovery.exe+0x1852D50
	void SetVariableTexture(const struct FName& InVariableName, class UTexture* Texture);//Offset:Discovery.exe+0x1852E30
	void SetVariableStaticMesh(const struct FName& InVariableName, class UStaticMesh* InValue);//Offset:Discovery.exe+0x1852F10
	void SetVariableQuat(const struct FName& InVariableName, const struct FQuat& InValue);//Offset:Discovery.exe+0x1853ED0
	void SetVariablePosition(const struct FName& InVariableName, const struct FVector& InValue);//Offset:Discovery.exe+0x1853AF0
	void SetVariableObject(const struct FName& InVariableName, class UObject* Object);//Offset:Discovery.exe+0x18530D0
	void SetVariableMaterial(const struct FName& InVariableName, class UMaterialInterface* Object);//Offset:Discovery.exe+0x1852FF0
	void SetVariableLinearColor(const struct FName& InVariableName, const struct FLinearColor& InValue);//Offset:Discovery.exe+0x18542F0
	void SetVariableInt(const struct FName& InVariableName, int InValue);//Offset:Discovery.exe+0x1853570
	void SetVariableFloat(const struct FName& InVariableName, float InValue);//Offset:Discovery.exe+0x1853740
	void SetVariableBool(const struct FName& InVariableName, bool InValue);//Offset:Discovery.exe+0x1853380
	void SetVariableActor(const struct FName& InVariableName, class AActor* Actor);//Offset:Discovery.exe+0x18532A0
	void SetTickBehavior(enum class ENiagaraTickBehavior NewTickBehavior);//Offset:Discovery.exe+0x18549D0
	void SetSystemFixedBounds(const struct FBox& LocalBounds);//Offset:Discovery.exe+0x18548D0
	void SetSeekDelta(float InSeekDelta);//Offset:Discovery.exe+0x1854CA0
	void SetRenderingEnabled(bool bInRenderingEnabled);//Offset:Discovery.exe+0x1852900
	void SetRandomSeedOffset(int NewRandomSeedOffset);//Offset:Discovery.exe+0x1854510
	void SetPreviewLODDistance(bool bEnablePreviewLODDistance, float PreviewLODDistance, float PreviewMaxDistance);//Offset:Discovery.exe+0x1852480
	void SetPaused(bool bInPaused);//Offset:Discovery.exe+0x18526A0
	void SetNiagaraVariableVec4(const struct FString& InVariableName, const struct FVector4& InValue);//Offset:Discovery.exe+0x18541D0
	void SetNiagaraVariableVec3(const struct FString& InVariableName, const struct FVector& InValue);//Offset:Discovery.exe+0x1853DD0
	void SetNiagaraVariableVec2(const struct FString& InVariableName, const struct FVector2D& InValue);//Offset:Discovery.exe+0x1853A00
	void SetNiagaraVariableQuat(const struct FString& InVariableName, const struct FQuat& InValue);//Offset:Discovery.exe+0x1853FC0
	void SetNiagaraVariablePosition(const struct FString& InVariableName, const struct FVector& InValue);//Offset:Discovery.exe+0x1853BE0
	void SetNiagaraVariableObject(const struct FString& InVariableName, class UObject* Object);//Offset:Discovery.exe+0x18531B0
	void SetNiagaraVariableLinearColor(const struct FString& InVariableName, const struct FLinearColor& InValue);//Offset:Discovery.exe+0x18543E0
	void SetNiagaraVariableInt(const struct FString& InVariableName, int InValue);//Offset:Discovery.exe+0x1853650
	void SetNiagaraVariableFloat(const struct FString& InVariableName, float InValue);//Offset:Discovery.exe+0x1853820
	void SetNiagaraVariableBool(const struct FString& InVariableName, bool InValue);//Offset:Discovery.exe+0x1853470
	void SetNiagaraVariableActor(const struct FString& InVariableName, class AActor* Actor);//Offset:Discovery.exe+0x18531B0
	void SetMaxSimTime(float InMaxTime);//Offset:Discovery.exe+0x1854B00
	void SetLockDesiredAgeDeltaTimeToSeekDelta(bool bLock);//Offset:Discovery.exe+0x1854BD0
	void SetGpuComputeDebug(bool bEnableDebug);//Offset:Discovery.exe+0x1855110
	void SetForceSolo(bool bInForceSolo);//Offset:Discovery.exe+0x18551E0
	void SetForceLocalPlayerEffect(bool bIsPlayerEffect);//Offset:Discovery.exe+0x1852270
	void SetEmitterFixedBounds(const struct FName& EmitterName, const struct FBox& LocalBounds);//Offset:Discovery.exe+0x1854720
	void SetDesiredAge(float InDesiredAge);//Offset:Discovery.exe+0x1854EB0
	void SetCustomTimeDilation(float Dilation);//Offset:Discovery.exe+0x1855070
	void SetCanRenderWhileSeeking(bool bInCanRenderWhileSeeking);//Offset:Discovery.exe+0x1854D70
	void SetAutoDestroy(bool bInAutoDestroy);//Offset:Discovery.exe+0x1854A60
	void SetAsset(class UNiagaraSystem* InAsset, bool bResetExistingOverrideParameters);//Offset:Discovery.exe+0x18552A0
	void SetAllowScalability(bool bAllow);//Offset:Discovery.exe+0x1852340
	void SetAgeUpdateMode(enum class ENiagaraAgeUpdateMode InAgeUpdateMode);//Offset:Discovery.exe+0x1854F80
	void SeekToDesiredAge(float InDesiredAge);//Offset:Discovery.exe+0x1854E10
	void ResetSystem();//Offset:Discovery.exe+0x18529C0
	void ReinitializeSystem();//Offset:Discovery.exe+0x18529A0
	bool IsPaused();//Offset:Discovery.exe+0x1852670
	void InitForPerformanceBaseline();//Offset:Discovery.exe+0x18523E0
	enum class ENiagaraTickBehavior GetTickBehavior();//Offset:Discovery.exe+0x18549A0
	struct FBox GetSystemFixedBounds();//Offset:Discovery.exe+0x1854860
	float GetSeekDelta();//Offset:Discovery.exe+0x1854D40
	int GetRandomSeedOffset();//Offset:Discovery.exe+0x18544E0
	bool GetPreviewLODDistanceEnabled();//Offset:Discovery.exe+0x1852450
	float GetPreviewLODDistance();//Offset:Discovery.exe+0x1852400
	TArray<struct FVector> GetNiagaraParticleValueVec3_DebugOnly(const struct FString& InEmitterName, const struct FString& InValueName);//Offset:Discovery.exe+0x18529E0
	TArray<float> GetNiagaraParticleValues_DebugOnly(const struct FString& InEmitterName, const struct FString& InValueName);//Offset:Discovery.exe+0x1852B20
	TArray<struct FVector> GetNiagaraParticlePositions_DebugOnly(const struct FString& InEmitterName);//Offset:Discovery.exe+0x1852C60
	float GetMaxSimTime();//Offset:Discovery.exe+0x1854BA0
	bool GetLockDesiredAgeDeltaTimeToSeekDelta();//Offset:Discovery.exe+0x1854C70
	bool GetForceSolo();//Offset:Discovery.exe+0x18551B0
	bool GetForceLocalPlayerEffect();//Offset:Discovery.exe+0x1852240
	struct FBox GetEmitterFixedBounds(const struct FName& EmitterName);//Offset:Discovery.exe+0x1854650
	float GetDesiredAge();//Offset:Discovery.exe+0x1854F50
	class UNiagaraDataInterface* GetDataInterface(const struct FString& Name);//Offset:Discovery.exe+0x18525C0
	float GetCustomTimeDilation();//Offset:Discovery.exe+0x1855040
	class UNiagaraSystem* GetAsset();//Offset:Discovery.exe+0x1855280
	bool GetAllowScalability();//Offset:Discovery.exe+0x1852310
	enum class ENiagaraAgeUpdateMode GetAgeUpdateMode();//Offset:Discovery.exe+0x1855010
	void ClearSystemFixedBounds();//Offset:Discovery.exe+0x1854840
	void ClearEmitterFixedBounds(const struct FName& EmitterName);//Offset:Discovery.exe+0x18545B0
	void AdvanceSimulationByTime(float SimulateTime, float TickDeltaSeconds);//Offset:Discovery.exe+0x1852740
	void AdvanceSimulation(int TickCount, float TickDeltaSeconds);//Offset:Discovery.exe+0x1852820
};


// Class Niagara.NiagaraComponentPool
// 0x0058 (0x0080 - 0x0028)
class UNiagaraComponentPool : public UObject
{
public:
	TMap<class UNiagaraSystem*, struct FNCPool>        WorldParticleSystemPools;                                 // 0x0028(0x0050)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0078(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class Niagara.NiagaraComponentPool"));
		return ptr;
	}

};


// Class Niagara.NiagaraRendererProperties
// 0x00A8 (0x00D0 - 0x0028)
class UNiagaraRendererProperties : public UNiagaraMergeable
{
public:
	struct FNiagaraPlatformSet                         Platforms;                                                // 0x0028(0x0030) (Edit)
	int                                                SortOrderHint;                                            // 0x0058(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	enum class ENiagaraRendererMotionVectorSetting     MotionVectorSetting;                                      // 0x005C(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x005C(0x0003) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
	struct FNiagaraVariableAttributeBinding            RendererEnabledBinding;                                   // 0x0060(0x0058) (Edit)
	bool                                               bIsEnabled;                                               // 0x00B8(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               bAllowInCullProxies;                                      // 0x00B9(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bMotionBlurEnabled;                                       // 0x00BA(0x0001) (ZeroConstructor, Deprecated, IsPlainOldData)
	unsigned char                                      UnknownData01[0x15];                                      // 0x00BB(0x0015) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class Niagara.NiagaraRendererProperties"));
		return ptr;
	}

};


// Class Niagara.NiagaraComponentRendererProperties
// 0x0140 (0x0210 - 0x00D0)
class UNiagaraComponentRendererProperties : public UNiagaraRendererProperties
{
public:
	class UClass*                                      ComponentType;                                            // 0x00D0(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	uint32_t                                           ComponentCountLimit;                                      // 0x00D8(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x00DC(0x0004) MISSED OFFSET
	struct FNiagaraVariableAttributeBinding            EnabledBinding;                                           // 0x00E0(0x0058) (Edit)
	struct FNiagaraVariableAttributeBinding            RendererVisibilityTagBinding;                             // 0x0138(0x0058) (Edit)
	bool                                               bAssignComponentsOnParticleID;                            // 0x0190(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bOnlyCreateComponentsOnParticleSpawn;                     // 0x0191(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bOnlyActivateNewlyAquiredComponents;                      // 0x0192(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x1];                                       // 0x0193(0x0001) MISSED OFFSET
	int                                                RendererVisibility;                                       // 0x0194(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	class USceneComponent*                             TemplateComponent;                                        // 0x0198(0x0008) (Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	TArray<struct FNiagaraComponentPropertyBinding>    PropertyBindings;                                         // 0x01A0(0x0010) (ZeroConstructor)
	unsigned char                                      UnknownData02[0x60];                                      // 0x01B0(0x0060) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class Niagara.NiagaraComponentRendererProperties"));
		return ptr;
	}

};


// Class Niagara.NiagaraComponentSettings
// 0x0190 (0x01B8 - 0x0028)
class UNiagaraComponentSettings : public UObject
{
public:
	unsigned char                                      UnknownData00[0x50];                                      // 0x0028(0x0050) UNKNOWN PROPERTY: SuppressActivationList
	unsigned char                                      UnknownData01[0x50];                                      // 0x0078(0x0050) UNKNOWN PROPERTY: ForceAutoPooolingList
	unsigned char                                      UnknownData02[0x50];                                      // 0x00C8(0x0050) UNKNOWN PROPERTY: SuppressEmitterList
	unsigned char                                      UnknownData03[0x50];                                      // 0x0118(0x0050) UNKNOWN PROPERTY: GPUEmitterAllowList
	unsigned char                                      UnknownData04[0x50];                                      // 0x0168(0x0050) UNKNOWN PROPERTY: GpuDataInterfaceDenyList

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class Niagara.NiagaraComponentSettings"));
		return ptr;
	}

};


// Class Niagara.NiagaraConvertInPlaceUtilityBase
// 0x0000 (0x0028 - 0x0028)
class UNiagaraConvertInPlaceUtilityBase : public UObject
{
public:

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class Niagara.NiagaraConvertInPlaceUtilityBase"));
		return ptr;
	}

};


// Class Niagara.NiagaraCullProxyComponent
// 0x0010 (0x0830 - 0x0820)
class UNiagaraCullProxyComponent : public UNiagaraComponent
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0820(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class Niagara.NiagaraCullProxyComponent"));
		return ptr;
	}

};


// Class Niagara.NiagaraDataInterface
// 0x0010 (0x0038 - 0x0028)
class UNiagaraDataInterface : public UNiagaraDataInterfaceBase
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0028(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class Niagara.NiagaraDataInterface"));
		return ptr;
	}

};


// Class Niagara.NiagaraDataInterface2DArrayTexture
// 0x0028 (0x0060 - 0x0038)
class UNiagaraDataInterface2DArrayTexture : public UNiagaraDataInterface
{
public:
	class UTexture2DArray*                             Texture;                                                  // 0x0038(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	struct FNiagaraUserParameterBinding                TextureUserParameter;                                     // 0x0040(0x0020) (Edit)

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class Niagara.NiagaraDataInterface2DArrayTexture"));
		return ptr;
	}

};


// Class Niagara.NiagaraDataInterfaceActorComponent
// 0x0040 (0x0078 - 0x0038)
class UNiagaraDataInterfaceActorComponent : public UNiagaraDataInterface
{
public:
	bool                                               bRequireCurrentFrameData;                                 // 0x0038(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0039(0x0003) MISSED OFFSET
	TLazyObjectPtr<class AActor>                       SourceActor;                                              // 0x003C(0x001C) (Edit, IsPlainOldData)
	struct FNiagaraUserParameterBinding                ActorOrComponentParameter;                                // 0x0058(0x0020) (Edit)

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class Niagara.NiagaraDataInterfaceActorComponent"));
		return ptr;
	}

};


// Class Niagara.NiagaraDataInterfaceRWBase
// 0x0000 (0x0038 - 0x0038)
class UNiagaraDataInterfaceRWBase : public UNiagaraDataInterface
{
public:

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class Niagara.NiagaraDataInterfaceRWBase"));
		return ptr;
	}

};


// Class Niagara.NiagaraDataInterfaceArray
// 0x0010 (0x0048 - 0x0038)
class UNiagaraDataInterfaceArray : public UNiagaraDataInterfaceRWBase
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0038(0x0008) MISSED OFFSET
	enum class ENiagaraGpuSyncMode                     GpuSyncMode;                                              // 0x0040(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x0038(0x0003) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
	int                                                MaxElements;                                              // 0x0044(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class Niagara.NiagaraDataInterfaceArray"));
		return ptr;
	}

};


// Class Niagara.NiagaraDataInterfaceArrayFloat
// 0x0010 (0x0058 - 0x0048)
class UNiagaraDataInterfaceArrayFloat : public UNiagaraDataInterfaceArray
{
public:
	TArray<float>                                      FloatData;                                                // 0x0048(0x0010) (Edit, BlueprintVisible, ZeroConstructor)

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class Niagara.NiagaraDataInterfaceArrayFloat"));
		return ptr;
	}

};


// Class Niagara.NiagaraDataInterfaceArrayFloat2
// 0x0010 (0x0058 - 0x0048)
class UNiagaraDataInterfaceArrayFloat2 : public UNiagaraDataInterfaceArray
{
public:
	TArray<struct FVector2D>                           FloatData;                                                // 0x0048(0x0010) (Edit, BlueprintVisible, ZeroConstructor)

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class Niagara.NiagaraDataInterfaceArrayFloat2"));
		return ptr;
	}

};


// Class Niagara.NiagaraDataInterfaceArrayFloat3
// 0x0010 (0x0058 - 0x0048)
class UNiagaraDataInterfaceArrayFloat3 : public UNiagaraDataInterfaceArray
{
public:
	TArray<struct FVector>                             FloatData;                                                // 0x0048(0x0010) (Edit, BlueprintVisible, ZeroConstructor)

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class Niagara.NiagaraDataInterfaceArrayFloat3"));
		return ptr;
	}

};


// Class Niagara.NiagaraDataInterfaceArrayPosition
// 0x0010 (0x0058 - 0x0048)
class UNiagaraDataInterfaceArrayPosition : public UNiagaraDataInterfaceArray
{
public:
	TArray<struct FNiagaraPosition>                    PositionData;                                             // 0x0048(0x0010) (Edit, BlueprintVisible, ZeroConstructor)

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class Niagara.NiagaraDataInterfaceArrayPosition"));
		return ptr;
	}

};


// Class Niagara.NiagaraDataInterfaceArrayFloat4
// 0x0010 (0x0058 - 0x0048)
class UNiagaraDataInterfaceArrayFloat4 : public UNiagaraDataInterfaceArray
{
public:
	TArray<struct FVector4>                            FloatData;                                                // 0x0048(0x0010) (Edit, BlueprintVisible, ZeroConstructor)

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class Niagara.NiagaraDataInterfaceArrayFloat4"));
		return ptr;
	}

};


// Class Niagara.NiagaraDataInterfaceArrayColor
// 0x0010 (0x0058 - 0x0048)
class UNiagaraDataInterfaceArrayColor : public UNiagaraDataInterfaceArray
{
public:
	TArray<struct FLinearColor>                        ColorData;                                                // 0x0048(0x0010) (Edit, BlueprintVisible, ZeroConstructor)

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class Niagara.NiagaraDataInterfaceArrayColor"));
		return ptr;
	}

};


// Class Niagara.NiagaraDataInterfaceArrayQuat
// 0x0010 (0x0058 - 0x0048)
class UNiagaraDataInterfaceArrayQuat : public UNiagaraDataInterfaceArray
{
public:
	TArray<struct FQuat>                               QuatData;                                                 // 0x0048(0x0010) (Edit, BlueprintVisible, ZeroConstructor)

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class Niagara.NiagaraDataInterfaceArrayQuat"));
		return ptr;
	}

};


// Class Niagara.NiagaraDataInterfaceArrayFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UNiagaraDataInterfaceArrayFunctionLibrary : public UBlueprintFunctionLibrary
{
public:

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class Niagara.NiagaraDataInterfaceArrayFunctionLibrary"));
		return ptr;
	}


	void STATIC_SetNiagaraArrayVectorValue(class UNiagaraComponent* NiagaraSystem, const struct FName& OverrideName, int Index, const struct FVector& Value, bool bSizeToFit);//Offset:Discovery.exe+0x185B300
	void STATIC_SetNiagaraArrayVector4Value(class UNiagaraComponent* NiagaraSystem, const struct FName& OverrideName, int Index, const struct FVector4& Value, bool bSizeToFit);//Offset:Discovery.exe+0x185AF40
	void STATIC_SetNiagaraArrayVector4(class UNiagaraComponent* NiagaraSystem, const struct FName& OverrideName, TArray<struct FVector4> ArrayData);//Offset:Discovery.exe+0x185C780
	void STATIC_SetNiagaraArrayVector2DValue(class UNiagaraComponent* NiagaraSystem, const struct FName& OverrideName, int Index, const struct FVector2D& Value, bool bSizeToFit);//Offset:Discovery.exe+0x185B4D0
	void STATIC_SetNiagaraArrayVector2D(class UNiagaraComponent* NiagaraSystem, const struct FName& OverrideName, TArray<struct FVector2D> ArrayData);//Offset:Discovery.exe+0x185CB40
	void STATIC_SetNiagaraArrayVector(class UNiagaraComponent* NiagaraSystem, const struct FName& OverrideName, TArray<struct FVector> ArrayData);//Offset:Discovery.exe+0x185CA00
	void STATIC_SetNiagaraArrayQuatValue(class UNiagaraComponent* NiagaraSystem, const struct FName& OverrideName, int Index, const struct FQuat& Value, bool bSizeToFit);//Offset:Discovery.exe+0x185ABA0
	void STATIC_SetNiagaraArrayQuat(class UNiagaraComponent* NiagaraSystem, const struct FName& OverrideName, TArray<struct FQuat> ArrayData);//Offset:Discovery.exe+0x185C500
	void STATIC_SetNiagaraArrayPositionValue(class UNiagaraComponent* NiagaraSystem, const struct FName& OverrideName, int Index, const struct FVector& Value, bool bSizeToFit);//Offset:Discovery.exe+0x185B130
	void STATIC_SetNiagaraArrayPosition(class UNiagaraComponent* NiagaraSystem, const struct FName& OverrideName, TArray<struct FVector> ArrayData);//Offset:Discovery.exe+0x185C8C0
	void STATIC_SetNiagaraArrayInt32Value(class UNiagaraComponent* NiagaraSystem, const struct FName& OverrideName, int Index, int Value, bool bSizeToFit);//Offset:Discovery.exe+0x185A9E0
	void STATIC_SetNiagaraArrayInt32(class UNiagaraComponent* NiagaraSystem, const struct FName& OverrideName, TArray<int> ArrayData);//Offset:Discovery.exe+0x185C3C0
	void STATIC_SetNiagaraArrayFloatValue(class UNiagaraComponent* NiagaraSystem, const struct FName& OverrideName, int Index, float Value, bool bSizeToFit);//Offset:Discovery.exe+0x185B6A0
	void STATIC_SetNiagaraArrayFloat(class UNiagaraComponent* NiagaraSystem, const struct FName& OverrideName, TArray<float> ArrayData);//Offset:Discovery.exe+0x185CC80
	void STATIC_SetNiagaraArrayColorValue(class UNiagaraComponent* NiagaraSystem, const struct FName& OverrideName, int Index, const struct FLinearColor& Value, bool bSizeToFit);//Offset:Discovery.exe+0x185AD70
	void STATIC_SetNiagaraArrayColor(class UNiagaraComponent* NiagaraSystem, const struct FName& OverrideName, TArray<struct FLinearColor> ArrayData);//Offset:Discovery.exe+0x185C640
	void STATIC_SetNiagaraArrayBoolValue(class UNiagaraComponent* NiagaraSystem, const struct FName& OverrideName, int Index, bool Value, bool bSizeToFit);//Offset:Discovery.exe+0x185A810
	void STATIC_SetNiagaraArrayBool(class UNiagaraComponent* NiagaraSystem, const struct FName& OverrideName, TArray<bool> ArrayData);//Offset:Discovery.exe+0x185C280
	struct FVector STATIC_GetNiagaraArrayVectorValue(class UNiagaraComponent* NiagaraSystem, const struct FName& OverrideName, int Index);//Offset:Discovery.exe+0x185A460
	struct FVector4 STATIC_GetNiagaraArrayVector4Value(class UNiagaraComponent* NiagaraSystem, const struct FName& OverrideName, int Index);//Offset:Discovery.exe+0x185A1E0
	TArray<struct FVector4> STATIC_GetNiagaraArrayVector4(class UNiagaraComponent* NiagaraSystem, const struct FName& OverrideName);//Offset:Discovery.exe+0x185BCE0
	struct FVector2D STATIC_GetNiagaraArrayVector2DValue(class UNiagaraComponent* NiagaraSystem, const struct FName& OverrideName, int Index);//Offset:Discovery.exe+0x185A5A0
	TArray<struct FVector2D> STATIC_GetNiagaraArrayVector2D(class UNiagaraComponent* NiagaraSystem, const struct FName& OverrideName);//Offset:Discovery.exe+0x185C040
	TArray<struct FVector> STATIC_GetNiagaraArrayVector(class UNiagaraComponent* NiagaraSystem, const struct FName& OverrideName);//Offset:Discovery.exe+0x185BF20
	struct FQuat STATIC_GetNiagaraArrayQuatValue(class UNiagaraComponent* NiagaraSystem, const struct FName& OverrideName, int Index);//Offset:Discovery.exe+0x1859F60
	TArray<struct FQuat> STATIC_GetNiagaraArrayQuat(class UNiagaraComponent* NiagaraSystem, const struct FName& OverrideName);//Offset:Discovery.exe+0x185BAA0
	struct FVector STATIC_GetNiagaraArrayPositionValue(class UNiagaraComponent* NiagaraSystem, const struct FName& OverrideName, int Index);//Offset:Discovery.exe+0x185A320
	TArray<struct FVector> STATIC_GetNiagaraArrayPosition(class UNiagaraComponent* NiagaraSystem, const struct FName& OverrideName);//Offset:Discovery.exe+0x185BE00
	int STATIC_GetNiagaraArrayInt32Value(class UNiagaraComponent* NiagaraSystem, const struct FName& OverrideName, int Index);//Offset:Discovery.exe+0x1859E30
	TArray<int> STATIC_GetNiagaraArrayInt32(class UNiagaraComponent* NiagaraSystem, const struct FName& OverrideName);//Offset:Discovery.exe+0x185B980
	float STATIC_GetNiagaraArrayFloatValue(class UNiagaraComponent* NiagaraSystem, const struct FName& OverrideName, int Index);//Offset:Discovery.exe+0x185A6E0
	TArray<float> STATIC_GetNiagaraArrayFloat(class UNiagaraComponent* NiagaraSystem, const struct FName& OverrideName);//Offset:Discovery.exe+0x185C160
	struct FLinearColor STATIC_GetNiagaraArrayColorValue(class UNiagaraComponent* NiagaraSystem, const struct FName& OverrideName, int Index);//Offset:Discovery.exe+0x185A0A0
	TArray<struct FLinearColor> STATIC_GetNiagaraArrayColor(class UNiagaraComponent* NiagaraSystem, const struct FName& OverrideName);//Offset:Discovery.exe+0x185BBC0
	bool STATIC_GetNiagaraArrayBoolValue(class UNiagaraComponent* NiagaraSystem, const struct FName& OverrideName, int Index);//Offset:Discovery.exe+0x1859D00
	TArray<bool> STATIC_GetNiagaraArrayBool(class UNiagaraComponent* NiagaraSystem, const struct FName& OverrideName);//Offset:Discovery.exe+0x185B860
};


// Class Niagara.NiagaraDataInterfaceArrayInt32
// 0x0010 (0x0058 - 0x0048)
class UNiagaraDataInterfaceArrayInt32 : public UNiagaraDataInterfaceArray
{
public:
	TArray<int>                                        IntData;                                                  // 0x0048(0x0010) (Edit, BlueprintVisible, ZeroConstructor)

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class Niagara.NiagaraDataInterfaceArrayInt32"));
		return ptr;
	}

};


// Class Niagara.NiagaraDataInterfaceArrayBool
// 0x0010 (0x0058 - 0x0048)
class UNiagaraDataInterfaceArrayBool : public UNiagaraDataInterfaceArray
{
public:
	TArray<bool>                                       BoolData;                                                 // 0x0048(0x0010) (Edit, BlueprintVisible, ZeroConstructor)

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class Niagara.NiagaraDataInterfaceArrayBool"));
		return ptr;
	}

};


// Class Niagara.NiagaraDataInterfaceArrayNiagaraID
// 0x0010 (0x0058 - 0x0048)
class UNiagaraDataInterfaceArrayNiagaraID : public UNiagaraDataInterfaceArray
{
public:
	TArray<struct FNiagaraID>                          IntData;                                                  // 0x0048(0x0010) (Edit, BlueprintVisible, ZeroConstructor)

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class Niagara.NiagaraDataInterfaceArrayNiagaraID"));
		return ptr;
	}

};


// Class Niagara.NiagaraDataInterfaceAsyncGpuTrace
// 0x0010 (0x0048 - 0x0038)
class UNiagaraDataInterfaceAsyncGpuTrace : public UNiagaraDataInterface
{
public:
	int                                                MaxTracesPerParticle;                                     // 0x0038(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	int                                                MaxRetraces;                                              // 0x003C(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	TEnumAsByte<ENDICollisionQuery_AsyncGpuTraceProvider> TraceProvider;                                            // 0x0040(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0041(0x0007) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class Niagara.NiagaraDataInterfaceAsyncGpuTrace"));
		return ptr;
	}

};


// Class Niagara.NiagaraDataInterfaceAudioSubmix
// 0x0008 (0x0040 - 0x0038)
class UNiagaraDataInterfaceAudioSubmix : public UNiagaraDataInterface
{
public:
	class USoundSubmix*                                Submix;                                                   // 0x0038(0x0008) (Edit, ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class Niagara.NiagaraDataInterfaceAudioSubmix"));
		return ptr;
	}

};


// Class Niagara.NiagaraDataInterfaceAudioOscilloscope
// 0x0010 (0x0048 - 0x0038)
class UNiagaraDataInterfaceAudioOscilloscope : public UNiagaraDataInterface
{
public:
	class USoundSubmix*                                Submix;                                                   // 0x0038(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	int                                                Resolution;                                               // 0x0040(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              ScopeInMilliseconds;                                      // 0x0044(0x0004) (Edit, ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class Niagara.NiagaraDataInterfaceAudioOscilloscope"));
		return ptr;
	}

};


// Class Niagara.NiagaraDataInterfaceAudioPlayer
// 0x0038 (0x0070 - 0x0038)
class UNiagaraDataInterfaceAudioPlayer : public UNiagaraDataInterface
{
public:
	class USoundBase*                                  SoundToPlay;                                              // 0x0038(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class USoundAttenuation*                           Attenuation;                                              // 0x0040(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class USoundConcurrency*                           Concurrency;                                              // 0x0048(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	TArray<struct FName>                               ParameterNames;                                           // 0x0050(0x0010) (Edit, ZeroConstructor)
	bool                                               bLimitPlaysPerTick;                                       // 0x0060(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0061(0x0003) MISSED OFFSET
	int                                                MaxPlaysPerTick;                                          // 0x0064(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bStopWhenComponentIsDestroyed;                            // 0x0068(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0069(0x0007) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class Niagara.NiagaraDataInterfaceAudioPlayer"));
		return ptr;
	}

};


// Class Niagara.NiagaraDataInterfaceAudioSpectrum
// 0x0010 (0x0050 - 0x0040)
class UNiagaraDataInterfaceAudioSpectrum : public UNiagaraDataInterfaceAudioSubmix
{
public:
	int                                                Resolution;                                               // 0x0040(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              MinimumFrequency;                                         // 0x0044(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              MaximumFrequency;                                         // 0x0048(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              NoiseFloorDb;                                             // 0x004C(0x0004) (Edit, ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class Niagara.NiagaraDataInterfaceAudioSpectrum"));
		return ptr;
	}

};


// Class Niagara.NiagaraDataInterfaceCamera
// 0x0008 (0x0040 - 0x0038)
class UNiagaraDataInterfaceCamera : public UNiagaraDataInterface
{
public:
	int                                                PlayerControllerIndex;                                    // 0x0038(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bRequireCurrentFrameData;                                 // 0x003C(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x003D(0x0003) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class Niagara.NiagaraDataInterfaceCamera"));
		return ptr;
	}

};


// Class Niagara.NiagaraDataInterfaceCollisionQuery
// 0x0008 (0x0040 - 0x0038)
class UNiagaraDataInterfaceCollisionQuery : public UNiagaraDataInterface
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0038(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class Niagara.NiagaraDataInterfaceCollisionQuery"));
		return ptr;
	}

};


// Class Niagara.NiagaraDataInterfaceCurveBase
// 0x0038 (0x0070 - 0x0038)
class UNiagaraDataInterfaceCurveBase : public UNiagaraDataInterface
{
public:
	TArray<float>                                      ShaderLUT;                                                // 0x0038(0x0010) (ZeroConstructor)
	float                                              LUTMinTime;                                               // 0x0048(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              LUTMaxTime;                                               // 0x004C(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              LUTInvTimeRange;                                          // 0x0050(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              LUTNumSamplesMinusOne;                                    // 0x0054(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0058(0x0004) MISSED OFFSET
	unsigned char                                      bUseLUT : 1;                                              // 0x005C(0x0001) (Edit)
	unsigned char                                      bExposeCurve : 1;                                         // 0x005C(0x0001) (Edit)
	unsigned char                                      UnknownData01[0x3];                                       // 0x005D(0x0003) MISSED OFFSET
	struct FName                                       ExposedName;                                              // 0x0060(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UTexture2D*                                  ExposedTexture;                                           // 0x0068(0x0008) (ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class Niagara.NiagaraDataInterfaceCurveBase"));
		return ptr;
	}

};


// Class Niagara.NiagaraDataInterfaceColorCurve
// 0x0200 (0x0270 - 0x0070)
class UNiagaraDataInterfaceColorCurve : public UNiagaraDataInterfaceCurveBase
{
public:
	struct FRichCurve                                  RedCurve;                                                 // 0x0070(0x0080) (Edit)
	struct FRichCurve                                  GreenCurve;                                               // 0x00F0(0x0080) (Edit)
	struct FRichCurve                                  BlueCurve;                                                // 0x0170(0x0080) (Edit)
	struct FRichCurve                                  AlphaCurve;                                               // 0x01F0(0x0080) (Edit)

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class Niagara.NiagaraDataInterfaceColorCurve"));
		return ptr;
	}

};


// Class Niagara.NiagaraDataInterfaceCubeTexture
// 0x0028 (0x0060 - 0x0038)
class UNiagaraDataInterfaceCubeTexture : public UNiagaraDataInterface
{
public:
	class UTextureCube*                                Texture;                                                  // 0x0038(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	struct FNiagaraUserParameterBinding                TextureUserParameter;                                     // 0x0040(0x0020) (Edit)

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class Niagara.NiagaraDataInterfaceCubeTexture"));
		return ptr;
	}

};


// Class Niagara.NiagaraDataInterfaceCurlNoise
// 0x0020 (0x0058 - 0x0038)
class UNiagaraDataInterfaceCurlNoise : public UNiagaraDataInterface
{
public:
	uint32_t                                           Seed;                                                     // 0x0038(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x1C];                                      // 0x003C(0x001C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class Niagara.NiagaraDataInterfaceCurlNoise"));
		return ptr;
	}

};


// Class Niagara.NiagaraDataInterfaceCurve
// 0x0080 (0x00F0 - 0x0070)
class UNiagaraDataInterfaceCurve : public UNiagaraDataInterfaceCurveBase
{
public:
	struct FRichCurve                                  Curve;                                                    // 0x0070(0x0080) (Edit)

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class Niagara.NiagaraDataInterfaceCurve"));
		return ptr;
	}

};


// Class Niagara.NiagaraDataInterfaceDebugDraw
// 0x0008 (0x0040 - 0x0038)
class UNiagaraDataInterfaceDebugDraw : public UNiagaraDataInterface
{
public:
	uint32_t                                           OverrideMaxLineInstances;                                 // 0x0038(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x003C(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class Niagara.NiagaraDataInterfaceDebugDraw"));
		return ptr;
	}

};


// Class Niagara.NiagaraDataInterfaceEmitterProperties
// 0x0010 (0x0048 - 0x0038)
class UNiagaraDataInterfaceEmitterProperties : public UNiagaraDataInterface
{
public:
	struct FNiagaraDataInterfaceEmitterBinding         EmitterBinding;                                           // 0x0038(0x000C) (Edit)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0044(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class Niagara.NiagaraDataInterfaceEmitterProperties"));
		return ptr;
	}

};


// Class Niagara.NiagaraParticleCallbackHandler
// 0x0000 (0x0028 - 0x0028)
class UNiagaraParticleCallbackHandler : public UInterface
{
public:

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class Niagara.NiagaraParticleCallbackHandler"));
		return ptr;
	}


	void ReceiveParticleData(TArray<struct FBasicParticleData> Data, class UNiagaraSystem* NiagaraSystem, const struct FVector& SimulationPositionOffset);//Offset:Discovery.exe+0x18600A0
};


// Class Niagara.NiagaraDataInterfaceExport
// 0x0030 (0x0068 - 0x0038)
class UNiagaraDataInterfaceExport : public UNiagaraDataInterface
{
public:
	struct FNiagaraUserParameterBinding                CallbackHandlerParameter;                                 // 0x0038(0x0020) (Edit)
	enum class ENDIExport_GPUAllocationMode            GPUAllocationMode;                                        // 0x0058(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0059(0x0003) MISSED OFFSET
	int                                                GPUAllocationFixedSize;                                   // 0x005C(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              GPUAllocationPerParticleSize;                             // 0x0060(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x0064(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class Niagara.NiagaraDataInterfaceExport"));
		return ptr;
	}

};


// Class Niagara.NiagaraDataInterfaceGBuffer
// 0x0000 (0x0038 - 0x0038)
class UNiagaraDataInterfaceGBuffer : public UNiagaraDataInterface
{
public:

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class Niagara.NiagaraDataInterfaceGBuffer"));
		return ptr;
	}

};


// Class Niagara.NiagaraDataInterfaceGrid2D
// 0x0028 (0x0060 - 0x0038)
class UNiagaraDataInterfaceGrid2D : public UNiagaraDataInterfaceRWBase
{
public:
	int                                                NumCellsX;                                                // 0x0038(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	int                                                NumCellsY;                                                // 0x003C(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	int                                                NumCellsMaxAxis;                                          // 0x0040(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
