#pragma once

//   SDK By:if

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace sdk
{
//---------------------------------------------------------------------------
// Classes
//---------------------------------------------------------------------------

// Class UMG.Visual
// 0x0000 (0x0028 - 0x0028)
class UVisual : public UObject
{
public:

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class UMG.Visual"));
		return ptr;
	}

};


// Class UMG.Widget
// 0x0100 (0x0128 - 0x0028)
class UWidget : public UVisual
{
public:
	class UPanelSlot*                                  Slot;                                                     // 0x0028(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData)
	struct FScriptDelegate                             bIsEnabledDelegate;                                       // 0x0030(0x0010) (ZeroConstructor, InstancedReference)
	struct FText                                       ToolTipText;                                              // 0x0040(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly)
	struct FScriptDelegate                             ToolTipTextDelegate;                                      // 0x0058(0x0010) (ZeroConstructor, InstancedReference)
	class UWidget*                                     ToolTipWidget;                                            // 0x0068(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	struct FScriptDelegate                             ToolTipWidgetDelegate;                                    // 0x0070(0x0010) (ZeroConstructor, InstancedReference)
	struct FScriptDelegate                             VisibilityDelegate;                                       // 0x0080(0x0010) (ZeroConstructor, InstancedReference)
	struct FWidgetTransform                            RenderTransform;                                          // 0x0090(0x0038) (Edit, BlueprintVisible, BlueprintReadOnly)
	struct FVector2D                                   RenderTransformPivot;                                     // 0x00C8(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      bIsVariable : 1;                                          // 0x00D8(0x0001)
	unsigned char                                      bCreatedByConstructionScript : 1;                         // 0x00D8(0x0001) (Transient)
	unsigned char                                      bIsEnabled : 1;                                           // 0x00D8(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bOverride_Cursor : 1;                                     // 0x00D8(0x0001) (Edit)
	enum class EFlowDirectionPreference                FlowDirectionPreference;                                  // 0x00D9(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x6];                                       // 0x00DA(0x0006) MISSED OFFSET
	class USlateAccessibleWidgetData*                  AccessibleWidgetData;                                     // 0x00E0(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	unsigned char                                      bIsVolatile : 1;                                          // 0x00E8(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	TEnumAsByte<EMouseCursor>                          Cursor;                                                   // 0x00E9(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	enum class EWidgetClipping                         Clipping;                                                 // 0x00EA(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	enum class ESlateVisibility                        Visibility;                                               // 0x00EB(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              RenderOpacity;                                            // 0x00EC(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	class UWidgetNavigation*                           Navigation;                                               // 0x00F0(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData)
	unsigned char                                      UnknownData01[0x20];                                      // 0x00F8(0x0020) MISSED OFFSET
	TArray<class UPropertyBinding*>                    NativeBindings;                                           // 0x0118(0x0010) (ZeroConstructor, Transient)

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class UMG.Widget"));
		return ptr;
	}


	void SetVisibility(enum class ESlateVisibility InVisibility);//Offset:Discovery.exe+0x4B7B250
	void SetUserFocus(class APlayerController* PlayerController);//Offset:Discovery.exe+0x4B7AC50
	void SetToolTipText(const struct FText& InToolTipText);//Offset:Discovery.exe+0x4B7B4A0
	void SetToolTip(class UWidget* Widget);//Offset:Discovery.exe+0x4B7B400
	void SetRenderTranslation(const struct FVector2D& Translation);//Offset:Discovery.exe+0x4B7B6F0
	void SetRenderTransformPivot(const struct FVector2D& Pivot);//Offset:Discovery.exe+0x4B7B650
	void SetRenderTransformAngle(float Angle);//Offset:Discovery.exe+0x4B7B7C0
	void SetRenderTransform(const struct FWidgetTransform& InTransform);//Offset:Discovery.exe+0x4B7B9A0
	void SetRenderShear(const struct FVector2D& Shear);//Offset:Discovery.exe+0x4B7B860
	void SetRenderScale(const struct FVector2D& Scale);//Offset:Discovery.exe+0x4B7B900
	void SetRenderOpacity(float InOpacity);//Offset:Discovery.exe+0x4B7B180
	void SetNavigationRuleExplicit(enum class EUINavigation Direction, class UWidget* InWidget);//Offset:Discovery.exe+0x4B7A7F0
	void SetNavigationRuleCustomBoundary(enum class EUINavigation Direction, const struct FScriptDelegate& InCustomDelegate);//Offset:Discovery.exe+0x4B7A5F0
	void SetNavigationRuleCustom(enum class EUINavigation Direction, const struct FScriptDelegate& InCustomDelegate);//Offset:Discovery.exe+0x4B7A6F0
	void SetNavigationRuleBase(enum class EUINavigation Direction, enum class EUINavigationRule Rule);//Offset:Discovery.exe+0x4B7A8D0
	void SetNavigationRule(enum class EUINavigation Direction, enum class EUINavigationRule Rule, const struct FName& WidgetToFocus);//Offset:Discovery.exe+0x4B7A9B0
	void SetKeyboardFocus();//Offset:Discovery.exe+0x4B7AEB0
	void SetIsEnabled(bool bInIsEnabled);//Offset:Discovery.exe+0x4B7B580
	void SetFocus();//Offset:Discovery.exe+0x4B7ACF0
	void SetCursor(TEnumAsByte<EMouseCursor> InCursor);//Offset:Discovery.exe+0x4B7B370
	void SetClipping(enum class EWidgetClipping InClipping);//Offset:Discovery.exe+0x4B7B0C0
	void SetAllNavigationRules(enum class EUINavigationRule Rule, const struct FName& WidgetToFocus);//Offset:Discovery.exe+0x4B7AAE0
	void ResetCursor();//Offset:Discovery.exe+0x4B7B350
	void RemoveFromParent();//Offset:Discovery.exe+0x11B97D0
	struct FEventReply OnReply__DelegateSignature();//Offset:Discovery.exe+0x327F8B0
	struct FEventReply OnPointerEvent__DelegateSignature(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);//Offset:Discovery.exe+0x327F8B0
	bool IsVisible();//Offset:Discovery.exe+0x4B7B320
	bool IsHovered();//Offset:Discovery.exe+0x11BE930
	void InvalidateLayoutAndVolatility();//Offset:Discovery.exe+0x4B7AC10
	bool HasUserFocusedDescendants(class APlayerController* PlayerController);//Offset:Discovery.exe+0x4B7AD10
	bool HasUserFocus(class APlayerController* PlayerController);//Offset:Discovery.exe+0x4B7AE10
	bool HasMouseCaptureByUser(int UserIndex, int PointerIndex);//Offset:Discovery.exe+0x4B7AED0
	bool HasMouseCapture();//Offset:Discovery.exe+0x4B7AFC0
	bool HasKeyboardFocus();//Offset:Discovery.exe+0x4B7AFF0
	bool HasFocusedDescendants();//Offset:Discovery.exe+0x4B7ADB0
	bool HasAnyUserFocus();//Offset:Discovery.exe+0x4B7ADE0
	class UWidget* GetWidget__DelegateSignature();//Offset:Discovery.exe+0x327F8B0
	enum class ESlateVisibility GetVisibility();//Offset:Discovery.exe+0x4B7B2F0
	struct FGeometry GetTickSpaceGeometry();//Offset:Discovery.exe+0x4B7A560
	struct FText GetText__DelegateSignature();//Offset:Discovery.exe+0x327F8B0
	enum class ESlateVisibility GetSlateVisibility__DelegateSignature();//Offset:Discovery.exe+0x327F8B0
	struct FSlateColor GetSlateColor__DelegateSignature();//Offset:Discovery.exe+0x327F8B0
	struct FSlateBrush GetSlateBrush__DelegateSignature();//Offset:Discovery.exe+0x327F8B0
	float GetRenderTransformAngle();//Offset:Discovery.exe+0x4B7B790
	float GetRenderOpacity();//Offset:Discovery.exe+0x4B7B220
	class UPanelWidget* GetParent();//Offset:Discovery.exe+0x4B7A5C0
	struct FGeometry GetPaintSpaceGeometry();//Offset:Discovery.exe+0x4B7A530
	class APlayerController* GetOwningPlayer();//Offset:Discovery.exe+0x11B97F0
	class ULocalPlayer* GetOwningLocalPlayer();//Offset:Discovery.exe+0x1DB6580
	TEnumAsByte<EMouseCursor> GetMouseCursor__DelegateSignature();//Offset:Discovery.exe+0x327F8B0
	struct FLinearColor GetLinearColor__DelegateSignature();//Offset:Discovery.exe+0x327F8B0
	bool GetIsEnabled();//Offset:Discovery.exe+0x4B7B620
	int GetInt32__DelegateSignature();//Offset:Discovery.exe+0x327F8B0
	class UGameInstance* GetGameInstance();//Offset:Discovery.exe+0x4B7A500
	float GetFloat__DelegateSignature();//Offset:Discovery.exe+0x327F8B0
	struct FVector2D GetDesiredSize();//Offset:Discovery.exe+0x4B7ABC0
	enum class EWidgetClipping GetClipping();//Offset:Discovery.exe+0x4B7B150
	enum class ECheckBoxState GetCheckBoxState__DelegateSignature();//Offset:Discovery.exe+0x327F8B0
	struct FGeometry GetCachedGeometry();//Offset:Discovery.exe+0x4B7A590
	bool GetBool__DelegateSignature();//Offset:Discovery.exe+0x327F8B0
	struct FText GetAccessibleText();//Offset:Discovery.exe+0x4B7A470
	struct FText GetAccessibleSummaryText();//Offset:Discovery.exe+0x4B7A3E0
	class UWidget* GenerateWidgetForString__DelegateSignature(const struct FString& Item);//Offset:Discovery.exe+0x327F8B0
	class UWidget* GenerateWidgetForObject__DelegateSignature(class UObject* Item);//Offset:Discovery.exe+0x327F8B0
	void ForceVolatile(bool bForce);//Offset:Discovery.exe+0x4B7B020
	void ForceLayoutPrepass();//Offset:Discovery.exe+0x4B7AC30
};


// Class UMG.UserWidget
// 0x0168 (0x0290 - 0x0128)
class UUserWidget : public UWidget
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0128(0x0008) MISSED OFFSET
	struct FLinearColor                                ColorAndOpacity;                                          // 0x0130(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FScriptDelegate                             ColorAndOpacityDelegate;                                  // 0x0140(0x0010) (ZeroConstructor, InstancedReference)
	struct FSlateColor                                 ForegroundColor;                                          // 0x0150(0x0014) (Edit, BlueprintVisible, BlueprintReadOnly)
	struct FScriptDelegate                             ForegroundColorDelegate;                                  // 0x0164(0x0010) (ZeroConstructor, InstancedReference)
	unsigned char                                      UnknownData01[0x4];                                       // 0x0174(0x0004) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnVisibilityChanged;                                      // 0x0178(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData02[0x18];                                      // 0x0188(0x0018) MISSED OFFSET
	struct FMargin                                     Padding;                                                  // 0x01A0(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	TArray<class UUMGSequencePlayer*>                  ActiveSequencePlayers;                                    // 0x01B0(0x0010) (ZeroConstructor, Transient)
	class UUMGSequenceTickManager*                     AnimationTickManager;                                     // 0x01C0(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	TArray<class UUMGSequencePlayer*>                  StoppedSequencePlayers;                                   // 0x01C8(0x0010) (ZeroConstructor, Transient)
	TArray<struct FNamedSlotBinding>                   NamedSlotBindings;                                        // 0x01D8(0x0010) (ZeroConstructor)
	class UWidgetTree*                                 WidgetTree;                                               // 0x01E8(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	int                                                Priority;                                                 // 0x01F0(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      bSupportsKeyboardFocus : 1;                               // 0x01F4(0x0001) (Deprecated)
	unsigned char                                      bIsFocusable : 1;                                         // 0x01F4(0x0001) (Edit, BlueprintVisible)
	unsigned char                                      bStopAction : 1;                                          // 0x01F4(0x0001) (Edit, BlueprintVisible)
	unsigned char                                      bHasScriptImplementedTick : 1;                            // 0x01F4(0x0001)
	unsigned char                                      bHasScriptImplementedPaint : 1;                           // 0x01F4(0x0001)
	unsigned char                                      UnknownData03[0x13];                                      // 0x01F5(0x0013) MISSED OFFSET
	enum class EWidgetTickFrequency                    TickFrequency;                                            // 0x0208(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData04[0x7];                                       // 0x0209(0x0007) MISSED OFFSET
	class UInputComponent*                             InputComponent;                                           // 0x0210(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, DuplicateTransient, IsPlainOldData)
	TArray<struct FAnimationEventBinding>              AnimationCallbacks;                                       // 0x0218(0x0010) (ZeroConstructor, Transient, DuplicateTransient)
	unsigned char                                      UnknownData05[0x68];                                      // 0x0228(0x0068) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class UMG.UserWidget"));
		return ptr;
	}


	void UnregisterInputComponent();//Offset:Discovery.exe+0x4B6D3E0
	void UnbindFromAnimationStarted(class UWidgetAnimation* Animation, const struct FScriptDelegate& Delegate);//Offset:Discovery.exe+0x4B6ECE0
	void UnbindFromAnimationFinished(class UWidgetAnimation* Animation, const struct FScriptDelegate& Delegate);//Offset:Discovery.exe+0x4B6EA40
	void UnbindAllFromAnimationStarted(class UWidgetAnimation* Animation);//Offset:Discovery.exe+0x4B6EC40
	void UnbindAllFromAnimationFinished(class UWidgetAnimation* Animation);//Offset:Discovery.exe+0x4B6E9A0
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);//Offset:Discovery.exe+0x327F8B0
	void StopListeningForInputAction(const struct FName& ActionName, TEnumAsByte<EInputEvent> EventType);//Offset:Discovery.exe+0x4B6D440
	void StopListeningForAllInputActions();//Offset:Discovery.exe+0x4B6D420
	void StopAnimationsAndLatentActions();//Offset:Discovery.exe+0x4B6EEE0
	void StopAnimation(class UWidgetAnimation* InAnimation);//Offset:Discovery.exe+0x4B6DDB0
	void StopAllAnimations();//Offset:Discovery.exe+0x4B6DD90
	void SetPositionInViewport(const struct FVector2D& Position, bool bRemoveDPIScale);//Offset:Discovery.exe+0x4B6F2F0
	void SetPlaybackSpeed(class UWidgetAnimation* InAnimation, float PlaybackSpeed);//Offset:Discovery.exe+0x4B6D8E0
	void SetPadding(const struct FMargin& InPadding);//Offset:Discovery.exe+0x4B6E580
	void SetOwningPlayer(class APlayerController* LocalPlayerController);//Offset:Discovery.exe+0x4B6EF80
	void SetNumLoopsToPlay(class UWidgetAnimation* InAnimation, int NumLoopsToPlay);//Offset:Discovery.exe+0x4B6D9C0
	void SetInputActionPriority(int NewPriority);//Offset:Discovery.exe+0x4B6D2A0
	void SetInputActionBlocking(bool bShouldBlock);//Offset:Discovery.exe+0x4B6D200
	void SetForegroundColor(const struct FSlateColor& InForegroundColor);//Offset:Discovery.exe+0x4B6E620
	void SetDesiredSizeInViewport(const struct FVector2D& Size);//Offset:Discovery.exe+0x4B6F250
	void SetColorAndOpacity(const struct FLinearColor& InColorAndOpacity);//Offset:Discovery.exe+0x4B6E6D0
	void SetAnimationCurrentTime(class UWidgetAnimation* InAnimation, float InTime);//Offset:Discovery.exe+0x4B6DB70
	void SetAnchorsInViewport(const struct FAnchors& Anchors);//Offset:Discovery.exe+0x4B6F1A0
	void SetAlignmentInViewport(const struct FVector2D& Alignment);//Offset:Discovery.exe+0x4B6F100
	void ReverseAnimation(class UWidgetAnimation* InAnimation);//Offset:Discovery.exe+0x4B6D840
	void RemoveFromViewport();//Offset:Discovery.exe+0x4B6F3E0
	void RegisterInputComponent();//Offset:Discovery.exe+0x4B6D400
	void PreConstruct(bool IsDesignTime);//Offset:Discovery.exe+0x327F8B0
	void PlaySound(class USoundBase* SoundToPlay);//Offset:Discovery.exe+0x4B6D6E0
	class UUMGSequencePlayer* PlayAnimationTimeRange(class UWidgetAnimation* InAnimation, float StartAtTime, float EndAtTime, int NumLoopsToPlay, TEnumAsByte<EUMGSequencePlayMode> PlayMode, float PlaybackSpeed, bool bRestoreState);//Offset:Discovery.exe+0x4B6E0D0
	class UUMGSequencePlayer* PlayAnimationReverse(class UWidgetAnimation* InAnimation, float PlaybackSpeed, bool bRestoreState);//Offset:Discovery.exe+0x4B6DE50
	class UUMGSequencePlayer* PlayAnimationForward(class UWidgetAnimation* InAnimation, float PlaybackSpeed, bool bRestoreState);//Offset:Discovery.exe+0x4B6DF90
	class UUMGSequencePlayer* PlayAnimation(class UWidgetAnimation* InAnimation, float StartAtTime, int NumLoopsToPlay, TEnumAsByte<EUMGSequencePlayMode> PlayMode, float PlaybackSpeed, bool bRestoreState);//Offset:Discovery.exe+0x4B6E350
	float PauseAnimation(class UWidgetAnimation* InAnimation);//Offset:Discovery.exe+0x4B6DCF0
	struct FEventReply OnTouchStarted(const struct FGeometry& MyGeometry, const struct FPointerEvent& InTouchEvent);//Offset:Discovery.exe+0x327F8B0
	struct FEventReply OnTouchMoved(const struct FGeometry& MyGeometry, const struct FPointerEvent& InTouchEvent);//Offset:Discovery.exe+0x327F8B0
	struct FEventReply OnTouchGesture(const struct FGeometry& MyGeometry, const struct FPointerEvent& GestureEvent);//Offset:Discovery.exe+0x327F8B0
	struct FEventReply OnTouchForceChanged(const struct FGeometry& MyGeometry, const struct FPointerEvent& InTouchEvent);//Offset:Discovery.exe+0x327F8B0
	struct FEventReply OnTouchEnded(const struct FGeometry& MyGeometry, const struct FPointerEvent& InTouchEvent);//Offset:Discovery.exe+0x327F8B0
	void OnRemovedFromFocusPath(const struct FFocusEvent& InFocusEvent);//Offset:Discovery.exe+0x327F8B0
	struct FEventReply OnPreviewMouseButtonDown(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);//Offset:Discovery.exe+0x327F8B0
	struct FEventReply OnPreviewKeyDown(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);//Offset:Discovery.exe+0x327F8B0
	void OnPaint(struct FPaintContext* Context);//Offset:Discovery.exe+0x327F8B0
	struct FEventReply OnMouseWheel(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);//Offset:Discovery.exe+0x327F8B0
	struct FEventReply OnMouseMove(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);//Offset:Discovery.exe+0x327F8B0
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);//Offset:Discovery.exe+0x327F8B0
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);//Offset:Discovery.exe+0x327F8B0
	void OnMouseCaptureLost();//Offset:Discovery.exe+0x327F8B0
	struct FEventReply OnMouseButtonUp(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);//Offset:Discovery.exe+0x327F8B0
	struct FEventReply OnMouseButtonDown(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);//Offset:Discovery.exe+0x327F8B0
	struct FEventReply OnMouseButtonDoubleClick(const struct FGeometry& InMyGeometry, const struct FPointerEvent& InMouseEvent);//Offset:Discovery.exe+0x327F8B0
	struct FEventReply OnMotionDetected(const struct FGeometry& MyGeometry, const struct FMotionEvent& InMotionEvent);//Offset:Discovery.exe+0x327F8B0
	struct FEventReply OnKeyUp(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);//Offset:Discovery.exe+0x327F8B0
	struct FEventReply OnKeyDown(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);//Offset:Discovery.exe+0x327F8B0
	struct FEventReply OnKeyChar(const struct FGeometry& MyGeometry, const struct FCharacterEvent& InCharacterEvent);//Offset:Discovery.exe+0x327F8B0
	void OnInitialized();//Offset:Discovery.exe+0x327F8B0
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);//Offset:Discovery.exe+0x327F8B0
	void OnFocusLost(const struct FFocusEvent& InFocusEvent);//Offset:Discovery.exe+0x327F8B0
	bool OnDrop(const struct FGeometry& MyGeometry, const struct FPointerEvent& PointerEvent, class UDragDropOperation* Operation);//Offset:Discovery.exe+0x327F8B0
	bool OnDragOver(const struct FGeometry& MyGeometry, const struct FPointerEvent& PointerEvent, class UDragDropOperation* Operation);//Offset:Discovery.exe+0x327F8B0
	void OnDragLeave(const struct FPointerEvent& PointerEvent, class UDragDropOperation* Operation);//Offset:Discovery.exe+0x327F8B0
	void OnDragEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& PointerEvent, class UDragDropOperation* Operation);//Offset:Discovery.exe+0x327F8B0
	void OnDragDetected(const struct FGeometry& MyGeometry, const struct FPointerEvent& PointerEvent, class UDragDropOperation** Operation);//Offset:Discovery.exe+0x327F8B0
	void OnDragCancelled(const struct FPointerEvent& PointerEvent, class UDragDropOperation* Operation);//Offset:Discovery.exe+0x327F8B0
	void OnAnimationStarted(class UWidgetAnimation* Animation);//Offset:Discovery.exe+0x1DB9050
	void OnAnimationFinished(class UWidgetAnimation* Animation);//Offset:Discovery.exe+0x4B6E770
	struct FEventReply OnAnalogValueChanged(const struct FGeometry& MyGeometry, const struct FAnalogInputEvent& InAnalogInputEvent);//Offset:Discovery.exe+0x327F8B0
	void OnAddedToFocusPath(const struct FFocusEvent& InFocusEvent);//Offset:Discovery.exe+0x327F8B0
	void ListenForInputAction(const struct FName& ActionName, TEnumAsByte<EInputEvent> EventType, bool bConsume, const struct FScriptDelegate& Callback);//Offset:Discovery.exe+0x4B6D520
	bool IsPlayingAnimation();//Offset:Discovery.exe+0x4B6D6C0
	bool IsListeningForInputAction(const struct FName& ActionName);//Offset:Discovery.exe+0x4B6D340
	bool IsInViewport();//Offset:Discovery.exe+0x4B6F020
	bool IsInteractable();//Offset:Discovery.exe+0x327F8B0
	bool IsAnyAnimationPlaying();//Offset:Discovery.exe+0x4B6DAA0
	bool IsAnimationPlayingForward(class UWidgetAnimation* InAnimation);//Offset:Discovery.exe+0x4B6D7A0
	bool IsAnimationPlaying(class UWidgetAnimation* InAnimation);//Offset:Discovery.exe+0x4B6DAD0
	class APawn* GetOwningPlayerPawn();//Offset:Discovery.exe+0x4B6EF50
	class APlayerCameraManager* GetOwningPlayerCameraManager();//Offset:Discovery.exe+0x4B6EF20
	bool GetIsVisible();//Offset:Discovery.exe+0x4B6F020
	float GetAnimationCurrentTime(class UWidgetAnimation* InAnimation);//Offset:Discovery.exe+0x4B6DC50
	struct FAnchors GetAnchorsInViewport();//Offset:Discovery.exe+0x4B6F0A0
	struct FVector2D GetAlignmentInViewport();//Offset:Discovery.exe+0x4B6F050
	void FlushAnimations();//Offset:Discovery.exe+0x4B6D780
	void Destruct();//Offset:Discovery.exe+0x327F8B0
	void Construct();//Offset:Discovery.exe+0x327F8B0
	void CancelLatentActions();//Offset:Discovery.exe+0x4B6EF00
	void BindToAnimationStarted(class UWidgetAnimation* Animation, const struct FScriptDelegate& Delegate);//Offset:Discovery.exe+0x4B6EDE0
	void BindToAnimationFinished(class UWidgetAnimation* Animation, const struct FScriptDelegate& Delegate);//Offset:Discovery.exe+0x4B6EB40
	void BindToAnimationEvent(class UWidgetAnimation* Animation, const struct FScriptDelegate& Delegate, enum class EWidgetAnimationEvent AnimationEvent, const struct FName& UserTag);//Offset:Discovery.exe+0x4B6E810
	void AddToViewport(int ZOrder);//Offset:Discovery.exe+0x4B6F4A0
	bool AddToPlayerScreen(int ZOrder);//Offset:Discovery.exe+0x4B6F400
};


// Class UMG.PanelWidget
// 0x0018 (0x0140 - 0x0128)
class UPanelWidget : public UWidget
{
public:
	TArray<class UPanelSlot*>                          Slots;                                                    // 0x0128(0x0010) (ExportObject, ZeroConstructor)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0138(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class UMG.PanelWidget"));
		return ptr;
	}


	bool RemoveChildAt(int Index);//Offset:Discovery.exe+0x4B5B300
	bool RemoveChild(class UWidget* Content);//Offset:Discovery.exe+0x4B5B1C0
	bool HasChild(class UWidget* Content);//Offset:Discovery.exe+0x4B5B3A0
	bool HasAnyChildren();//Offset:Discovery.exe+0x2503040
	int GetChildrenCount();//Offset:Discovery.exe+0x44D22E0
	int GetChildIndex(class UWidget* Content);//Offset:Discovery.exe+0x4B5B440
	class UWidget* GetChildAt(int Index);//Offset:Discovery.exe+0x4B5B560
	TArray<class UWidget*> GetAllChildren();//Offset:Discovery.exe+0x4B5B4E0
	void ClearChildren();//Offset:Discovery.exe+0x4B5B1A0
	class UPanelSlot* AddChild(class UWidget* Content);//Offset:Discovery.exe+0x4B5B260
};


// Class UMG.ContentWidget
// 0x0000 (0x0140 - 0x0140)
class UContentWidget : public UPanelWidget
{
public:

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class UMG.ContentWidget"));
		return ptr;
	}


	class UPanelSlot* SetContent(class UWidget* Content);//Offset:Discovery.exe+0x4B4B2F0
	class UPanelSlot* GetContentSlot();//Offset:Discovery.exe+0x4B4B390
	class UWidget* GetContent();//Offset:Discovery.exe+0x4B4B2C0
};


// Class UMG.Button
// 0x0490 (0x05D0 - 0x0140)
class UButton : public UContentWidget
{
public:
	class USlateWidgetStyleAsset*                      Style;                                                    // 0x0140(0x0008) (ZeroConstructor, Deprecated, IsPlainOldData)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0148(0x0008) MISSED OFFSET
	struct FButtonStyle                                WidgetStyle;                                              // 0x0150(0x03F0) (Edit, BlueprintVisible)
	struct FLinearColor                                ColorAndOpacity;                                          // 0x0540(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                BackgroundColor;                                          // 0x0550(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	TEnumAsByte<EButtonClickMethod>                    ClickMethod;                                              // 0x0560(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	TEnumAsByte<EButtonTouchMethod>                    TouchMethod;                                              // 0x0561(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	TEnumAsByte<EButtonPressMethod>                    PressMethod;                                              // 0x0562(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               IsFocusable;                                              // 0x0563(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x0564(0x0004) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnClicked;                                                // 0x0568(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnPressed;                                                // 0x0578(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnReleased;                                               // 0x0588(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnHovered;                                                // 0x0598(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnUnhovered;                                              // 0x05A8(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData02[0x18];                                      // 0x05B8(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class UMG.Button"));
		return ptr;
	}


	void SetTouchMethod(TEnumAsByte<EButtonTouchMethod> InTouchMethod);//Offset:Discovery.exe+0x4B456D0
	void SetStyle(const struct FButtonStyle& InStyle);//Offset:Discovery.exe+0x4B45960
	void SetPressMethod(TEnumAsByte<EButtonPressMethod> InPressMethod);//Offset:Discovery.exe+0x4B45640
	void SetColorAndOpacity(const struct FLinearColor& InColorAndOpacity);//Offset:Discovery.exe+0x4B458C0
	void SetClickMethod(TEnumAsByte<EButtonClickMethod> InClickMethod);//Offset:Discovery.exe+0x4B45760
	void SetBackgroundColor(const struct FLinearColor& InBackgroundColor);//Offset:Discovery.exe+0x4B45820
	bool IsPressed();//Offset:Discovery.exe+0x4B457F0
};


// Class UMG.WidgetSwitcher
// 0x0018 (0x0158 - 0x0140)
class UWidgetSwitcher : public UPanelWidget
{
public:
	int                                                ActiveWidgetIndex;                                        // 0x0140(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x14];                                      // 0x0144(0x0014) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class UMG.WidgetSwitcher"));
		return ptr;
	}


	void SetActiveWidgetIndex(int Index);//Offset:Discovery.exe+0x2516A70
	void SetActiveWidget(class UWidget* Widget);//Offset:Discovery.exe+0x1DB91F0
	class UWidget* GetWidgetAtIndex(int Index);//Offset:Discovery.exe+0x25169D0
	int GetNumWidgets();//Offset:Discovery.exe+0x4B8CE00
	int GetActiveWidgetIndex();//Offset:Discovery.exe+0x4B8CDD0
	class UWidget* GetActiveWidget();//Offset:Discovery.exe+0x4B8CDA0
};


// Class UMG.DynamicEntryBoxBase
// 0x00E0 (0x0208 - 0x0128)
class UDynamicEntryBoxBase : public UWidget
{
public:
	enum class EDynamicBoxType                         EntryBoxType;                                             // 0x0128(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0129(0x0007) MISSED OFFSET
	struct FVector2D                                   EntrySpacing;                                             // 0x0130(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	TArray<struct FVector2D>                           SpacingPattern;                                           // 0x0140(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	struct FSlateChildSize                             EntrySizeRule;                                            // 0x0150(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly)
	TEnumAsByte<EHorizontalAlignment>                  EntryHorizontalAlignment;                                 // 0x0158(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	TEnumAsByte<EVerticalAlignment>                    EntryVerticalAlignment;                                   // 0x0159(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x2];                                       // 0x015A(0x0002) MISSED OFFSET
	int                                                MaxElementSize;                                           // 0x015C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FRadialBoxSettings                          RadialBoxSettings;                                        // 0x0160(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      UnknownData02[0x10];                                      // 0x0170(0x0010) MISSED OFFSET
	struct FUserWidgetPool                             EntryWidgetPool;                                          // 0x0180(0x0088) (Transient)

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class UMG.DynamicEntryBoxBase"));
		return ptr;
	}


	void SetRadialSettings(const struct FRadialBoxSettings& InSettings);//Offset:Discovery.exe+0x4B4CCB0
	void SetEntrySpacing(const struct FVector2D& InEntrySpacing);//Offset:Discovery.exe+0x4B4CD70
	int GetNumEntries();//Offset:Discovery.exe+0x4B4CE10
	TArray<class UUserWidget*> GetAllEntries();//Offset:Discovery.exe+0x4B4CE40
};


// Class UMG.Image
// 0x0158 (0x0280 - 0x0128)
class UImage : public UWidget
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0128(0x0008) MISSED OFFSET
	struct FSlateBrush                                 Brush;                                                    // 0x0130(0x00D0) (Edit, BlueprintVisible, BlueprintReadOnly)
	struct FScriptDelegate                             BrushDelegate;                                            // 0x0200(0x0010) (ZeroConstructor, InstancedReference)
	struct FLinearColor                                ColorAndOpacity;                                          // 0x0210(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FScriptDelegate                             ColorAndOpacityDelegate;                                  // 0x0220(0x0010) (ZeroConstructor, InstancedReference)
	bool                                               bFlipForRightToLeftFlowDirection;                         // 0x0230(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x0231(0x0003) MISSED OFFSET
	struct FScriptDelegate                             OnMouseButtonDownEvent;                                   // 0x0234(0x0010) (Edit, ZeroConstructor, InstancedReference)
	unsigned char                                      UnknownData02[0x3C];                                      // 0x0244(0x003C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class UMG.Image"));
		return ptr;
	}


	void SetOpacity(float InOpacity);//Offset:Discovery.exe+0x4B52190
	void SetDesiredSizeOverride(const struct FVector2D& DesiredSize);//Offset:Discovery.exe+0x4B520F0
	void SetColorAndOpacity(const struct FLinearColor& InColorAndOpacity);//Offset:Discovery.exe+0x4B52230
	void SetBrushTintColor(const struct FSlateColor& TintColor);//Offset:Discovery.exe+0x4B52040
	void SetBrushResourceObject(class UObject* ResourceObject);//Offset:Discovery.exe+0x4B51FA0
	void SetBrushFromTextureDynamic(class UTexture2DDynamic* Texture, bool bMatchSize);//Offset:Discovery.exe+0x4B51B30
	void SetBrushFromTexture(class UTexture2D* Texture, bool bMatchSize);//Offset:Discovery.exe+0x4B51D10
	void SetBrushFromSoftTexture(bool bMatchSize);//Offset:Discovery.exe+0x4B51970
	void SetBrushFromSoftMaterial();//Offset:Discovery.exe+0x4B51810
	void SetBrushFromMaterial(class UMaterialInterface* Material);//Offset:Discovery.exe+0x1DB91F0
	void SetBrushFromAtlasInterface(const TScriptInterface<class USlateTextureAtlasInterface>& AtlasRegion, bool bMatchSize);//Offset:Discovery.exe+0x4B51C20
	void SetBrushFromAsset(class USlateBrushAsset* Asset);//Offset:Discovery.exe+0x4B51E00
	void SetBrush(const struct FSlateBrush& InBrush);//Offset:Discovery.exe+0x4B51EA0
	class UMaterialInstanceDynamic* GetDynamicMaterial();//Offset:Discovery.exe+0x4B517E0
};


// Class UMG.InputKeySelector
// 0x0848 (0x0970 - 0x0128)
class UInputKeySelector : public UWidget
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0128(0x0008) MISSED OFFSET
	struct FButtonStyle                                WidgetStyle;                                              // 0x0130(0x03F0) (Edit, BlueprintVisible)
	struct FTextBlockStyle                             TextStyle;                                                // 0x0520(0x0340) (Edit, BlueprintVisible)
	struct FInputChord                                 SelectedKey;                                              // 0x0860(0x0020) (BlueprintVisible, BlueprintReadOnly)
	struct FSlateFontInfo                              Font;                                                     // 0x0880(0x0058) (Deprecated)
	struct FMargin                                     Margin;                                                   // 0x08D8(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                ColorAndOpacity;                                          // 0x08E8(0x0010) (ZeroConstructor, Deprecated, IsPlainOldData)
	struct FText                                       KeySelectionText;                                         // 0x08F8(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly)
	struct FText                                       NoKeySpecifiedText;                                       // 0x0910(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly)
	bool                                               bAllowModifierKeys;                                       // 0x0928(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bAllowGamepadKeys;                                        // 0x0929(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x6];                                       // 0x092A(0x0006) MISSED OFFSET
	TArray<struct FKey>                                EscapeKeys;                                               // 0x0930(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	struct FScriptMulticastDelegate                    OnKeySelected;                                            // 0x0940(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnIsSelectingKeyChanged;                                  // 0x0950(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData02[0x10];                                      // 0x0960(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class UMG.InputKeySelector"));
		return ptr;
	}


	void SetTextBlockVisibility(enum class ESlateVisibility InVisibility);//Offset:Discovery.exe+0x4B52DC0
	void SetSelectedKey(const struct FInputChord& InSelectedKey);//Offset:Discovery.exe+0x4B531A0
	void SetNoKeySpecifiedText(const struct FText& InNoKeySpecifiedText);//Offset:Discovery.exe+0x4B52FC0
	void SetKeySelectionText(const struct FText& InKeySelectionText);//Offset:Discovery.exe+0x4B530B0
	void SetEscapeKeys(TArray<struct FKey> InKeys);//Offset:Discovery.exe+0x4B52CC0
	void SetAllowModifierKeys(bool bInAllowModifierKeys);//Offset:Discovery.exe+0x4B52F20
	void SetAllowGamepadKeys(bool bInAllowGamepadKeys);//Offset:Discovery.exe+0x4B52E80
	void OnKeySelected__DelegateSignature(const struct FInputChord& SelectedKey);//Offset:Discovery.exe+0x327F8B0
	void OnIsSelectingKeyChanged__DelegateSignature();//Offset:Discovery.exe+0x327F8B0
	bool GetIsSelectingKey();//Offset:Discovery.exe+0x4B52E50
};


// Class UMG.ListViewBase
// 0x0118 (0x0240 - 0x0128)
class UListViewBase : public UWidget
{
public:
	class UClass*                                      EntryWidgetClass;                                         // 0x0128(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              WheelScrollMultiplier;                                    // 0x0130(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bEnableScrollAnimation;                                   // 0x0134(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               AllowOverscroll;                                          // 0x0135(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bEnableRightClickScrolling;                               // 0x0136(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bEnableFixedLineOffset;                                   // 0x0137(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              FixedLineScrollOffset;                                    // 0x0138(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bAllowDragging;                                           // 0x013C(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x013D(0x0003) MISSED OFFSET
	struct FScriptMulticastDelegate                    BP_OnEntryGenerated;                                      // 0x0140(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    BP_OnEntryReleased;                                       // 0x0150(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FUserWidgetPool                             EntryWidgetPool;                                          // 0x0160(0x0088) (Transient)
	unsigned char                                      UnknownData01[0x58];                                      // 0x01E8(0x0058) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class UMG.ListViewBase"));
		return ptr;
	}


	void SetWheelScrollMultiplier(float NewWheelScrollMultiplier);//Offset:Discovery.exe+0x4B56FA0
	void SetScrollOffset(float InScrollOffset);//Offset:Discovery.exe+0x4B57040
	void SetScrollbarVisibility(enum class ESlateVisibility InVisibility);//Offset:Discovery.exe+0x4B56F10
	void ScrollToTop();//Offset:Discovery.exe+0x4B57100
	void ScrollToBottom();//Offset:Discovery.exe+0x4B570E0
	void RequestRefresh();//Offset:Discovery.exe+0x4B56EF0
	void RegenerateAllEntries();//Offset:Discovery.exe+0x4B57120
	float GetScrollOffset();//Offset:Discovery.exe+0x4B57140
	TArray<class UUserWidget*> GetDisplayedEntryWidgets();//Offset:Discovery.exe+0x4B57170
};


// Class UMG.ListView
// 0x09A0 (0x0BE0 - 0x0240)
class UListView : public UListViewBase
{
public:
	unsigned char                                      UnknownData00[0xC0];                                      // 0x0240(0x00C0) MISSED OFFSET
	struct FTableViewStyle                             WidgetStyle;                                              // 0x0300(0x00E0) (Edit, BlueprintVisible, BlueprintReadOnly)
	struct FScrollBarStyle                             ScrollBarStyle;                                           // 0x03E0(0x0770) (Edit, BlueprintVisible, BlueprintReadOnly)
	TEnumAsByte<EOrientation>                          Orientation;                                              // 0x0B50(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	TEnumAsByte<ESelectionMode>                        SelectionMode;                                            // 0x0B51(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	enum class EConsumeMouseWheel                      ConsumeMouseWheel;                                        // 0x0B52(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bClearSelectionOnClick;                                   // 0x0B53(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bIsFocusable;                                             // 0x0B54(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x0B55(0x0003) MISSED OFFSET
	float                                              EntrySpacing;                                             // 0x0B58(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bReturnFocusToSelection;                                  // 0x0B5C(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x3];                                       // 0x0B5D(0x0003) MISSED OFFSET
	TArray<class UObject*>                             ListItems;                                                // 0x0B60(0x0010) (ZeroConstructor, Transient)
	unsigned char                                      UnknownData03[0x10];                                      // 0x0B70(0x0010) MISSED OFFSET
	struct FScriptMulticastDelegate                    BP_OnEntryInitialized;                                    // 0x0B80(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    BP_OnItemClicked;                                         // 0x0B90(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    BP_OnItemDoubleClicked;                                   // 0x0BA0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    BP_OnItemIsHoveredChanged;                                // 0x0BB0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    BP_OnItemSelectionChanged;                                // 0x0BC0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    BP_OnItemScrolledIntoView;                                // 0x0BD0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class UMG.ListView"));
		return ptr;
	}


	void SetSelectionMode(TEnumAsByte<ESelectionMode> SelectionMode);//Offset:Discovery.exe+0x4B554A0
	void SetSelectedIndex(int Index);//Offset:Discovery.exe+0x4B55330
	void ScrollIndexIntoView(int Index);//Offset:Discovery.exe+0x4B553D0
	void RemoveItem(class UObject* Item);//Offset:Discovery.exe+0x4B556C0
	void OnListItemOuterEndPlayed(class AActor* ItemOuter, TEnumAsByte<EEndPlayReason> EndPlayReason);//Offset:Discovery.exe+0x4B550D0
	void OnListItemEndPlayed(class AActor* Item, TEnumAsByte<EEndPlayReason> EndPlayReason);//Offset:Discovery.exe+0x4B551B0
	void NavigateToIndex(int Index);//Offset:Discovery.exe+0x4B55290
	bool IsRefreshPending();//Offset:Discovery.exe+0x4B55470
	int GetNumItems();//Offset:Discovery.exe+0x4B555F0
	TArray<class UObject*> GetListItems();//Offset:Discovery.exe+0x4B55800
	class UObject* GetItemAt(int Index);//Offset:Discovery.exe+0x4B55620
	int GetIndexForItem(class UObject* Item);//Offset:Discovery.exe+0x4B55550
	void ClearListItems();//Offset:Discovery.exe+0x4B55530
	void BP_SetSelectedItem(class UObject* Item);//Offset:Discovery.exe+0x4B55030
	void BP_SetListItems(TArray<class UObject*> InListItems);//Offset:Discovery.exe+0x4B54B80
	void BP_SetItemSelection(class UObject* Item, bool bSelected);//Offset:Discovery.exe+0x4B54F40
	void BP_ScrollItemIntoView(class UObject* Item);//Offset:Discovery.exe+0x4B54C50
	void BP_NavigateToItem(class UObject* Item);//Offset:Discovery.exe+0x4B54CF0
	bool BP_IsItemVisible(class UObject* Item);//Offset:Discovery.exe+0x4B54D90
	bool BP_GetSelectedItems(TArray<class UObject*>* Items);//Offset:Discovery.exe+0x4B54E30
	class UObject* BP_GetSelectedItem();//Offset:Discovery.exe+0x4B54B50
	int BP_GetNumItemsSelected();//Offset:Discovery.exe+0x4B54EF0
	void BP_ClearSelection();//Offset:Discovery.exe+0x4B54F20
	void BP_CancelScrollIntoView();//Offset:Discovery.exe+0x4B54C30
	void AddItem(class UObject* Item);//Offset:Discovery.exe+0x4B55760
};


// Class UMG.RichTextBlockDecorator
// 0x0000 (0x0028 - 0x0028)
class URichTextBlockDecorator : public UObject
{
public:

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class UMG.RichTextBlockDecorator"));
		return ptr;
	}

};


// Class UMG.ScrollBox
// 0x0B40 (0x0C80 - 0x0140)
class UScrollBox : public UPanelWidget
{
public:
	struct FScrollBoxStyle                             WidgetStyle;                                              // 0x0140(0x0350) (Edit, BlueprintVisible)
	struct FScrollBarStyle                             WidgetBarStyle;                                           // 0x0490(0x0770) (Edit, BlueprintVisible)
	class USlateWidgetStyleAsset*                      Style;                                                    // 0x0C00(0x0008) (ZeroConstructor, Deprecated, IsPlainOldData)
	class USlateWidgetStyleAsset*                      BarStyle;                                                 // 0x0C08(0x0008) (ZeroConstructor, Deprecated, IsPlainOldData)
	TEnumAsByte<EOrientation>                          Orientation;                                              // 0x0C10(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	enum class ESlateVisibility                        ScrollBarVisibility;                                      // 0x0C11(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	enum class EConsumeMouseWheel                      ConsumeMouseWheel;                                        // 0x0C12(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x5];                                       // 0x0C13(0x0005) MISSED OFFSET
	struct FVector2D                                   ScrollbarThickness;                                       // 0x0C18(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FMargin                                     ScrollbarPadding;                                         // 0x0C28(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               AlwaysShowScrollbar;                                      // 0x0C38(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               AlwaysShowScrollbarTrack;                                 // 0x0C39(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               AllowOverscroll;                                          // 0x0C3A(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               BackPadScrolling;                                         // 0x0C3B(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               FrontPadScrolling;                                        // 0x0C3C(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bAnimateWheelScrolling;                                   // 0x0C3D(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	enum class EDescendantScrollDestination            NavigationDestination;                                    // 0x0C3E(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x1];                                       // 0x0C3F(0x0001) MISSED OFFSET
	float                                              NavigationScrollPadding;                                  // 0x0C40(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	enum class EScrollWhenFocusChanges                 ScrollWhenFocusChanges;                                   // 0x0C44(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bAllowRightClickDragScrolling;                            // 0x0C45(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x2];                                       // 0x0C46(0x0002) MISSED OFFSET
	float                                              WheelScrollMultiplier;                                    // 0x0C48(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData03[0x4];                                       // 0x0C4C(0x0004) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnUserScrolled;                                           // 0x0C50(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData04[0x20];                                      // 0x0C60(0x0020) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class UMG.ScrollBox"));
		return ptr;
	}


	void SetWheelScrollMultiplier(float NewWheelScrollMultiplier);//Offset:Discovery.exe+0x4B60360
	void SetScrollWhenFocusChanges(enum class EScrollWhenFocusChanges NewScrollWhenFocusChanges);//Offset:Discovery.exe+0x4B602D0
	void SetScrollOffset(float NewScrollOffset);//Offset:Discovery.exe+0x4B60180
	void SetScrollbarVisibility(enum class ESlateVisibility NewScrollBarVisibility);//Offset:Discovery.exe+0x4B60730
	void SetScrollbarThickness(const struct FVector2D& NewScrollbarThickness);//Offset:Discovery.exe+0x4B60690
	void SetScrollbarPadding(const struct FMargin& NewScrollbarPadding);//Offset:Discovery.exe+0x4B605E0
	void SetOrientation(TEnumAsByte<EOrientation> NewOrientation);//Offset:Discovery.exe+0x4B607C0
	void SetNavigationDestination(enum class EDescendantScrollDestination NewNavigationDestination);//Offset:Discovery.exe+0x4B60240
	void SetConsumeMouseWheel(enum class EConsumeMouseWheel NewConsumeMouseWheel);//Offset:Discovery.exe+0x4B60850
	void SetAnimateWheelScrolling(bool bShouldAnimateWheelScrolling);//Offset:Discovery.exe+0x4B60400
	void SetAlwaysShowScrollbar(bool NewAlwaysShowScrollbar);//Offset:Discovery.exe+0x4B60540
	void SetAllowOverscroll(bool NewAllowOverscroll);//Offset:Discovery.exe+0x4B604A0
	void ScrollWidgetIntoView(class UWidget* WidgetToFind, bool AnimateScroll, enum class EDescendantScrollDestination ScrollDestination, float Padding);//Offset:Discovery.exe+0x4B5FF20
	void ScrollToStart();//Offset:Discovery.exe+0x4B600D0
	void ScrollToEnd();//Offset:Discovery.exe+0x4B600B0
	float GetViewOffsetFraction();//Offset:Discovery.exe+0x4B600F0
	float GetScrollOffsetOfEnd();//Offset:Discovery.exe+0x4B60120
	float GetScrollOffset();//Offset:Discovery.exe+0x4B60150
	void EndInertialScrolling();//Offset:Discovery.exe+0x4B60220
};


// Class UMG.TextLayoutWidget
// 0x0020 (0x0148 - 0x0128)
class UTextLayoutWidget : public UWidget
{
public:
	struct FShapedTextOptions                          ShapedTextOptions;                                        // 0x0128(0x0003) (Edit, BlueprintVisible, BlueprintReadOnly)
	TEnumAsByte<ETextJustify>                          Justification;                                            // 0x012B(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	enum class ETextWrappingPolicy                     WrappingPolicy;                                           // 0x012C(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      AutoWrapText : 1;                                         // 0x012D(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      UnknownData00[0x2];                                       // 0x012E(0x0002) MISSED OFFSET
	float                                              WrapTextAt;                                               // 0x0130(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FMargin                                     Margin;                                                   // 0x0134(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              LineHeightPercentage;                                     // 0x0144(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;
		if(!ptr)
			ptr = UObject::FindClass(XorStr("Class UMG.TextLayoutWidget"));
		return ptr;
	}


	void SetJustification(TEnumAsByte<ETextJustify> InJustification);//Offset:Discovery.exe+0x4B6A5F0
};


// Class UMG.TextBlock
// 0x01C8 (0x0310 - 0x0148)
class UTextBlock : public UTextLayoutWidget
{
public:
	struct FText                                       Text;                                                     // 0x0148(0x0018) (Edit)
	struct FScriptDelegate                             TextDelegate;                                             // 0x0160(0x0010) (ZeroConstructor, InstancedReference)
